Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
/*
 * ESP32S3 SoC and Machine
 *
 * Copyright (c) 2023-2024 Espressif Systems (Shanghai) Co. Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#ifndef __EMSCRIPTEN__
#include <dlfcn.h>
#include <execinfo.h>
#include <signal.h>
#endif

#include "qemu/error-report.h"
#include "qemu/log.h"
#ifndef __EMSCRIPTEN__
static void mofei_crash_handler(int sig) {
  void* bt[32];
  int n = backtrace(bt, 32);
  fprintf(stderr, "\n[CRASH] Signal %d. %d frames:\n", sig, n);
  for (int i = 0; i < n; i++) {
    Dl_info info;
    if (dladdr(bt[i], &info) && info.dli_sname) {
      fprintf(stderr, "  [%d] %s (%s+0x%lx)\n", i, info.dli_sname, info.dli_fname,
              (unsigned long)((char*)bt[i] - (char*)info.dli_saddr));
    } else {
      fprintf(stderr, "  [%d] %p (???)\n", i, bt[i]);
    }
  }
  fflush(stderr);
  _exit(128 + sig);
}
static void __attribute__((constructor)) mofei_install_crash_handler(void) {
  struct sigaction sa = {0};
  sa.sa_handler = mofei_crash_handler;
  sa.sa_flags = SA_RESETHAND;
  sigaction(SIGSEGV, &sa, NULL);
  sigaction(SIGBUS, &sa, NULL);
  sigaction(SIGABRT, &sa, NULL);
}
#endif
#include "chardev/char-fe.h"
#include "core-esp32s3/core-isa.h"
#include "cpu_esp32s3.h"
#include "elf.h"
#include "exec/address-spaces.h"
#include "exec/exec-all.h"
#include "hw/boards.h"
#include "hw/char/esp32s3_uart.h"
#include "hw/char/lilygo_gnss_chardev.h"
#include "hw/display/esp_rgb.h"
#include "hw/dma/esp32s3_gdma.h"
#include "hw/gpio/esp32s3_gpio.h"
#include "hw/hw.h"
#include "hw/i2c/bitbang_i2c.h"
#include "hw/i2c/esp32_i2c.h"
#include "hw/i2c/i2c.h"
#include "hw/i2c/lilygo_bq27220.h"
#include "hw/i2c/lilygo_display_input.h"
#include "hw/i2c/lilygo_i2c_probe.h"
#include "hw/i2c/lilygo_power_rtc.h"
#include "hw/irq.h"
#include "hw/loader.h"
#include "hw/misc/esp32c3_jtag.h"
#include "hw/misc/esp32s3_aes.h"
#include "hw/misc/esp32s3_cache.h"
#include "hw/misc/esp32s3_ds.h"
#include "hw/misc/esp32s3_hmac.h"
#include "hw/misc/esp32s3_pms.h"
#include "hw/misc/esp32s3_rng.h"
#include "hw/misc/esp32s3_rsa.h"
#include "hw/misc/esp32s3_rtc_cntl.h"
#include "hw/misc/esp32s3_sha.h"
#include "hw/misc/esp32s3_xts_aes.h"
#include "hw/misc/ssi_psram.h"
#include "hw/misc/unimp.h"
#include "hw/net/can/esp32s3_twai.h"
#include "hw/nvram/esp32s3_efuse.h"
#include "hw/qdev-properties.h"
#include "hw/sd/dwc_sdmmc.h"
#include "hw/sd/sd.h"
#include "hw/ssi/esp32s3_spi.h"
#include "hw/ssi/lilygo_sx1262.h"
#include "hw/ssi/ssi.h"
#include "hw/sysbus.h"
#include "hw/timer/esp32s3_systimer.h"
#include "hw/timer/esp32s3_timg.h"
#include "hw/xtensa/esp32s3_clk.h"
#include "hw/xtensa/esp32s3_intc.h"
#include "hw/xtensa/xtensa_memory.h"
#include "net/net.h"
#include "qapi/error.h"
#include "qemu/datadir.h"
#include "qemu/memalign.h"
#include "qemu/timer.h"
#include "qemu/units.h"
#include "sysemu/block-backend.h"
#include "sysemu/blockdev.h"
#include "sysemu/cpus.h"
#include "sysemu/reset.h"
#include "sysemu/runstate.h"
#include "sysemu/sysemu.h"
#include "target/xtensa/cpu.h"

#define MOFEI_DEFAULT_FIRMWARE_ELF_PATH "apps/panda-os/device/build/panda_os.elf"
#define MOFEI_BROWSER_FIRMWARE_KERNEL_PATH "/murphy-os/murphy_os-kernel.img"
#define MOFEI_BROWSER_FIRMWARE_SYMBOLS_PATH "/murphy-os/murphy_os-symbols.txt"

static char* mofei_resolve_rom_binary(void) {
  const char* mofei_rom = getenv("MOFEI_ROM_BINARY");
  if (mofei_rom && mofei_rom[0]) {
    return g_strdup(mofei_rom);
  }
  return qemu_find_file(QEMU_FILE_TYPE_BIOS, "esp32s3_rev0_rom.bin");
}

/* Mofei peripheral pin map (verified from lib/hal/HalGPIO.h + MofeiDisplay.h) */
#define MOFEI_EPD_CS_GPIO 5
#define MOFEI_EPD_DC_GPIO 6
#define MOFEI_EPD_RST_GPIO 7
#define MOFEI_EPD_BUSY_GPIO 8
#define MOFEI_TOUCH_SDA_GPIO 13
#define MOFEI_TOUCH_SCL_GPIO 12
#define MOFEI_TOUCH_INT_GPIO 44

/* Physical button GPIO pins (active-low, pull-up) */
#define MOFEI_BTN_KEYLOCK_GPIO 0 /* MOFEI_KEY_LOCK */
#define MOFEI_BTN_KEY1_GPIO 1    /* MOFEI_KEY1 */
#define MOFEI_BTN_KEY2_GPIO 2    /* MOFEI_KEY2 */

#define S37UC_EPD_CS_GPIO 3
#define S37UC_EPD_DC_GPIO 2
#define S37UC_EPD_RST_GPIO 0
#define S37UC_EPD_BUSY_GPIO 1
#define S37UC_TOUCH_SDA_GPIO 13
#define S37UC_TOUCH_SCL_GPIO 12
#define S37UC_TOUCH_INT_GPIO 21
#define S37UC_BTN_SIDEKEY_GPIO 17
#define S37UC_BTN_SIDEKEY1_GPIO 46

#define LILYGO_SD_CS_GPIO 12
#define M5PAPERS3_SD_CS_GPIO 47
#define LILYGO_RADIO_CS_GPIO 46
#define LILYGO_TOUCH_INT_GPIO 3
#define LILYGO_TOUCH_RESET_GPIO 9

/* Mofei sim: CPU1 synchronization for flash boot.
 *
 * On real hardware, CPU0 boots first and unstalls CPU1; both cores then
 * handshake through shared volatile bools.  In QEMU, CPU1 is permanently
 * halted (powered off), so we simulate CPU1's side of the handshake by
 * writing 1 to the appropriate BSS variables after a short delay.
 *
 * The ESP-IDF boot sequence has two spin loops in cpu_start.c:
 *   1. start_other_core() spins on s_cpu_up[0] && s_cpu_up[1]
 *   2. call_start_cpu0()  spins on s_cpu_inited[0] && s_cpu_inited[1]
 * CPU1 also spins on s_resume_cores in call_start_cpu1(), but since CPU1
 * never runs we don't need to set that — CPU0 never checks it.
 *
 * Addresses are resolved at machine-init time from the firmware ELF.
 */
static struct {
  uint32_t s_cpu_up_1;
  uint32_t s_cpu_inited_1;
  uint32_t s_system_inited_1;
  uint32_t s_system_full_inited;
  uint32_t adc_patch_fns[16]; /* ADC functions to patch with entry+ret0 */
  int adc_patch_count;
  int delay_ms;
} mofei_cpu1_sync = {0, 0, 0, 0, {0}, 0, 500};

static QEMUTimer* mofei_debug_pc_timer;
static int mofei_debug_pc_dumps;

/* Periodic tick timer that keeps the simulated CPU alive.
 * The ESP32-S3 firmware uses `waiti` to sleep until the next timer
 * interrupt.  In QEMU the CCOMPARE/CCOUNT timer emulation may not
 * generate interrupts fast enough, so the CPU halts and never wakes.
 * This timer fires every 10 ms of virtual time and forces a level-1
 * software interrupt (INTSET bit 0) on CPU0 so it resumes execution.
 * Note: Esp32s3SocState is defined later, so we use first_cpu from
 * the global CPU list and operate on the CPUState/CPUXtensaState. */
static QEMUTimer* mofei_cpu_tick_timer;
static uint32_t mofei_cpu_tick_count;
#include "hw/xtensa/mofei-sim-addrs.h"

/* Global instance — accessible from translate.c and exc_helper.c via the header */
MofeiSimBoardKind mofei_sim_active_board = MOFEI_SIM_BOARD_MOFEI;
MofeiSimAddrs mofei_sim_addrs;
uint32_t mofei_sim_wrap_malloc_addr;
uint32_t mofei_sim_reset_display_update_control_addr;
uint32_t mofei_display_writeLutFull_addr;
uint32_t mofei_display_writeLutFast_addr;
uint32_t mofei_display_writeLutDu_addr;

static const char* mofei_sim_board_name(void) {
  if (mofei_sim_board_is_s37uc()) {
    return "s37uc";
  }
  if (mofei_sim_board_is_m5papers3()) {
    return "m5papers3";
  }
  if (mofei_sim_board_is_lilygo_t5s3_pro()) {
    return "lilygo-t5s3-pro";
  }
  return "mofei";
}

