Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
static bool mofei_sim_path_mentions_s37uc(const char* path) {
  return path && (g_strrstr(path, "s37uc") || g_strrstr(path, "S37UC"));
}

static bool mofei_sim_path_mentions_lilygo_t5s3_pro(const char* path) {
  return path && (g_strrstr(path, "lilygo-t5s3-pro") || g_strrstr(path, "LILYGO-T5S3-PRO"));
}

static bool mofei_sim_path_mentions_m5papers3(const char* path) {
  return path && (g_strrstr(path, "m5papers3") || g_strrstr(path, "M5PAPERS3"));
}
static void mofei_sim_select_board(const char* firmware_path) {
  const char* env_board = getenv("MOFEI_SIM_BOARD");
  if (env_board && env_board[0]) {
    if (g_ascii_strcasecmp(env_board, "s37uc") == 0) {
      mofei_sim_active_board = MOFEI_SIM_BOARD_S37UC;
      return;
    }
    if (g_ascii_strcasecmp(env_board, "lilygo-t5s3-pro") == 0) {
      mofei_sim_active_board = MOFEI_SIM_BOARD_LILYGO_T5S3_PRO;
      return;
    }
    if (g_ascii_strcasecmp(env_board, "m5papers3") == 0) {
      mofei_sim_active_board = MOFEI_SIM_BOARD_M5PAPERS3;
      return;
    }
    if (g_ascii_strcasecmp(env_board, "mofei") == 0) {
      mofei_sim_active_board = MOFEI_SIM_BOARD_MOFEI;
      return;
    }
    fprintf(stderr, "[QEMU-SIM] WARNING: unsupported MOFEI_SIM_BOARD=%s, falling back to firmware path/default\n",
            env_board);
  }

  if (mofei_sim_path_mentions_s37uc(firmware_path)) {
    mofei_sim_active_board = MOFEI_SIM_BOARD_S37UC;
  } else if (mofei_sim_path_mentions_lilygo_t5s3_pro(firmware_path)) {
    mofei_sim_active_board = MOFEI_SIM_BOARD_LILYGO_T5S3_PRO;
  } else if (mofei_sim_path_mentions_m5papers3(firmware_path)) {
    mofei_sim_active_board = MOFEI_SIM_BOARD_M5PAPERS3;
  } else {
    mofei_sim_active_board = MOFEI_SIM_BOARD_MOFEI;
  }
}

typedef struct MofeiAllocPatchSpec {
  uint8_t size_kind;
  uint8_t old_ptr_arg;
  uint8_t caps_arg;
} MofeiAllocPatchSpec;

static MofeiAllocPatchSpec mofei_alloc_patch_spec_for_name(const char* name) {
  const MofeiAllocPatchSpec none = {0, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_NONE};
  if (!name) {
    return none;
  }
  if (strcmp(name, "heap_caps_malloc") == 0 || strcmp(name, "heap_caps_malloc_base") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A2, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_A3};
  }
  if (strcmp(name, "heap_caps_malloc_default") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A2, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "heap_caps_calloc") == 0 || strcmp(name, "heap_caps_calloc_base") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_MUL_A2_A3, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_A4};
  }
  if (strcmp(name, "heap_caps_realloc") == 0 || strcmp(name, "heap_caps_realloc_base") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A3, MOFEI_ALLOC_ARG_A2, MOFEI_ALLOC_ARG_A4};
  }
  if (strcmp(name, "heap_caps_realloc_default") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A3, MOFEI_ALLOC_ARG_A2, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "heap_caps_malloc_prefer") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A2, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_A4};
  }
  if (strcmp(name, "heap_caps_calloc_prefer") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_MUL_A2_A3, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_A5};
  }
  if (strcmp(name, "heap_caps_realloc_prefer") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A3, MOFEI_ALLOC_ARG_A2, MOFEI_ALLOC_ARG_A5};
  }
  if (strcmp(name, "heap_caps_free") == 0 || strcmp(name, "vPortFree") == 0 || strcmp(name, "free") == 0 ||
      strcmp(name, "heap_caps_free_base") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_FREE, MOFEI_ALLOC_ARG_A2, MOFEI_ALLOC_ARG_NONE};
  }
  if (strcmp(name, "_ZdlPv") == 0 || strcmp(name, "_ZdlPvj") == 0 || strcmp(name, "_ZdaPv") == 0 ||
      strcmp(name, "_ZdaPvj") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_FREE, MOFEI_ALLOC_ARG_A2, MOFEI_ALLOC_ARG_NONE};
  }
  if (strcmp(name, "_free_r") == 0 || strcmp(name, "multi_heap_free") == 0 ||
      strcmp(name, "multi_heap_free_impl") == 0 || strcmp(name, "tlsf_free") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_FREE, MOFEI_ALLOC_ARG_A3, MOFEI_ALLOC_ARG_NONE};
  }
  if (strcmp(name, "malloc") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A2, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "calloc") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_MUL_A2_A3, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "_malloc_r") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A3, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "_calloc_r") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_MUL_A3_A4, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "realloc") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A3, MOFEI_ALLOC_ARG_A2, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "_realloc_r") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A4, MOFEI_ALLOC_ARG_A3, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "heap_caps_aligned_alloc") == 0 || strcmp(name, "heap_caps_aligned_alloc_base") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A3, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_A4};
  }
  if (strcmp(name, "multi_heap_malloc") == 0 || strcmp(name, "multi_heap_malloc_impl") == 0 ||
      strcmp(name, "tlsf_malloc") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A3, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_NONE};
  }
  if (strcmp(name, "tlsf_memalign_offs") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A4, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_NONE};
  }
  if (strcmp(name, "_Znwj") == 0 || strcmp(name, "_Znaj") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A2, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_DEFAULT_POLICY};
  }
  if (strcmp(name, "pvPortMalloc") == 0) {
    return (MofeiAllocPatchSpec){MOFEI_ALLOC_SIZE_A2, MOFEI_ALLOC_ARG_NONE, MOFEI_ALLOC_ARG_NONE};
  }
  return none;
}

static void mofei_add_alloc_patch(MofeiSimAddrs* a, uint32_t fn_addr, MofeiAllocPatchSpec spec, const char* name) {
  if (!a || fn_addr == 0 || spec.size_kind == 0) {
    return;
  }
  const uint32_t patch_addr = fn_addr + 3;
  for (int i = 0; i < a->alloc_patch_count; i++) {
    if (a->alloc_patch_addrs[i].addr == patch_addr) {
      return;
    }
  }
  if (a->alloc_patch_count >= MOFEI_ALLOC_PATCH_MAX) {
    fprintf(stderr, "[QEMU-DBG] WARNING: allocator patch table full, skipping %s @ 0x%08x\n", name ? name : "?",
            patch_addr);
    return;
  }
  a->alloc_patch_addrs[a->alloc_patch_count].addr = patch_addr;
  a->alloc_patch_addrs[a->alloc_patch_count].size_kind = spec.size_kind;
  a->alloc_patch_addrs[a->alloc_patch_count].old_ptr_arg = spec.old_ptr_arg;
  a->alloc_patch_addrs[a->alloc_patch_count].caps_arg = spec.caps_arg;
  a->alloc_patch_count++;
  if (name) {
    fprintf(stderr, "[QEMU-DBG] RETW+ALLOC %s size=%u old=%u caps=%u @ 0x%08x\n", name, spec.size_kind,
            spec.old_ptr_arg, spec.caps_arg, patch_addr);
  }
}

static void mofei_add_retw_patch(MofeiSimAddrs* a, uint32_t retw_pc, const char* name) {
  if (!a || retw_pc == 0) {
    return;
  }
  for (int i = 0; i < a->retw_patch_count; i++) {
    if (a->retw_patch_addrs[i] == retw_pc) {
      return;
    }
  }
  if (a->retw_patch_count >= MOFEI_RETW_PATCH_MAX) {
    fprintf(stderr, "[QEMU-DBG] WARNING: RETW patch table full, skipping %s @ 0x%08x\n", name ? name : "?", retw_pc);
    return;
  }
  a->retw_patch_addrs[a->retw_patch_count++] = retw_pc;
}

static void mofei_add_retw_normal_precheck(MofeiSimAddrs* a, uint32_t retw_pc, const char* name) {
  if (!a || retw_pc == 0) {
    return;
  }
  for (int i = 0; i < a->retw_normal_precheck_count; i++) {
    if (a->retw_normal_precheck_addrs[i] == retw_pc) {
      return;
    }
  }
  if (a->retw_normal_precheck_count >= MOFEI_RETW_NORMAL_PRECHECK_MAX) {
    fprintf(stderr, "[QEMU-DBG] WARNING: RETW normal-precheck table full, skipping %s @ 0x%08x\n", name ? name : "?",
            retw_pc);
    return;
  }
  a->retw_normal_precheck_addrs[a->retw_normal_precheck_count++] = retw_pc;
  if (name) {
    fprintf(stderr, "[QEMU-DBG] RETW+NORMAL-PRECHECK %s @ 0x%08x\n", name, retw_pc);
  }
}

