Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
static void mofei_cpu_tick_timer_cb(void* opaque) {
  CPUState* cpu0 = first_cpu;
  if (!cpu0) {
    return;
  }
  CPUXtensaState* env = &XTENSA_CPU(cpu0)->env;

  mofei_cpu_tick_count++;

  const char* debug_tick = getenv("MOFEI_SIM_DEBUG_TICK");
  if ((debug_tick != NULL && debug_tick[0] != '\0' && strcmp(debug_tick, "0") != 0) || mofei_cpu_tick_count <= 3 ||
      (mofei_cpu_tick_count % 1000) == 0) {
    uint32_t serial_console = 0;
    uint32_t serial_gnss = 0;
    uint8_t console_pending = 0;
    if (debug_tick != NULL && debug_tick[0] != '\0' && strcmp(debug_tick, "0") != 0) {
      if (mofei_sim_addrs.murphySimulatorShellContext_addr != 0) {
        address_space_read(&address_space_memory, mofei_sim_addrs.murphySimulatorShellContext_addr + 44,
                           MEMTXATTRS_UNSPECIFIED, &serial_console, sizeof(serial_console));
      }
      if (mofei_sim_addrs.g_mofeiSimConsolePending_addr != 0) {
        address_space_read(&address_space_memory, mofei_sim_addrs.g_mofeiSimConsolePending_addr, MEMTXATTRS_UNSPECIFIED,
                           &console_pending, sizeof(console_pending));
      }
      if (serial_console != 0) {
        address_space_read(&address_space_memory, serial_console + 32, MEMTXATTRS_UNSPECIFIED, &serial_gnss,
                           sizeof(serial_gnss));
      }
    }
    fprintf(stderr, "[TICK] #%u: pc=0x%08x a0=0x%08x sp=0x%08x halted=%d CCOUNT=0x%08x PS=0x%08x WB=%u WS=0x%x\n",
            mofei_cpu_tick_count, env->pc, env->regs[0], env->regs[1], cpu0->halted, env->sregs[CCOUNT], env->sregs[PS],
            env->sregs[WINDOW_BASE], env->sregs[WINDOW_START]);
    if (debug_tick != NULL && debug_tick[0] != '\0' && strcmp(debug_tick, "0") != 0) {
      fprintf(stderr, "[TICK-CONTEXT] serial_console=0x%08x serial_gnss=0x%08x console_pending=%u\n", serial_console,
              serial_gnss, console_pending);
    }
  }

  /* If CPU is halted, inject a software interrupt to wake it.
   * INTSET bit 0 is a software interrupt that triggers at level 1.
   * We also advance CCOUNT to give the firmware a sense of time. */
  if (cpu0->halted) {
    env->sregs[CCOUNT] += 10000;
    cpu0->halted = 0;
    qemu_cpu_kick(cpu0);
  }

  env->sregs[CCOUNT] += 1000;

  timer_mod(mofei_cpu_tick_timer, qemu_clock_get_ms(QEMU_CLOCK_REALTIME) + 100); /* 100 ms */
}

static void mofei_debug_pc_timer_cb(void* opaque) {
  XtensaCPU* cpu = XTENSA_CPU(first_cpu);
  if (cpu) {
    CPUXtensaState* env = &cpu->env;
    static uint32_t last_caller = 0;
    uint32_t caller = env->regs[0];
    {
      fprintf(stderr, "[QEMU-DBG] PC=0x%08x A0=0x%08x CCOUNT=0x%08x halted=%d PS=0x%08x excm=%d\n", env->pc, caller,
              env->sregs[CCOUNT], CPU(cpu)->halted, env->sregs[PS], (env->sregs[PS] & PS_EXCM) ? 1 : 0);
      last_caller = caller;
    }
  }
  if (++mofei_debug_pc_dumps < 50) {
    timer_mod(mofei_debug_pc_timer, qemu_clock_get_ms(QEMU_CLOCK_REALTIME) + 1);
  } else if (mofei_debug_pc_dumps < 300) {
    timer_mod(mofei_debug_pc_timer, qemu_clock_get_ms(QEMU_CLOCK_REALTIME) + 500);
  }
}

static void mofei_cpu1_done_timer_cb(void* opaque) {
  if (mofei_cpu1_sync.s_cpu_up_1) {
    uint8_t one = 1;
    /* Check s_cpu_up[0] first */
    uint8_t cpu0_val = 0;
    uint32_t s_cpu_up_0 = mofei_cpu1_sync.s_cpu_up_1 - 1;
    address_space_read(&address_space_memory, s_cpu_up_0, MEMTXATTRS_UNSPECIFIED, &cpu0_val, 1);
    if (!cpu0_val) {
      address_space_write(&address_space_memory, s_cpu_up_0, MEMTXATTRS_UNSPECIFIED, &one, 1);
    }
    address_space_write(&address_space_memory, mofei_cpu1_sync.s_cpu_up_1, MEMTXATTRS_UNSPECIFIED, &one, 1);
  }
  if (mofei_cpu1_sync.s_cpu_inited_1) {
    uint8_t one = 1;
    /* Also set s_cpu_inited[0] if needed */
    uint8_t cpu0_val = 0;
    uint32_t s_cpu_inited_0 = mofei_cpu1_sync.s_cpu_inited_1 - 1;
    address_space_read(&address_space_memory, s_cpu_inited_0, MEMTXATTRS_UNSPECIFIED, &cpu0_val, 1);
    if (!cpu0_val) {
      address_space_write(&address_space_memory, s_cpu_inited_0, MEMTXATTRS_UNSPECIFIED, &one, 1);
    }
    address_space_write(&address_space_memory, mofei_cpu1_sync.s_cpu_inited_1, MEMTXATTRS_UNSPECIFIED, &one, 1);
  }
  if (mofei_cpu1_sync.s_system_inited_1) {
    uint8_t one = 1;
    uint32_t s_system_inited_0 = mofei_cpu1_sync.s_system_inited_1 - 1;
    address_space_write(&address_space_memory, s_system_inited_0, MEMTXATTRS_UNSPECIFIED, &one, 1);
    address_space_write(&address_space_memory, mofei_cpu1_sync.s_system_inited_1, MEMTXATTRS_UNSPECIFIED, &one, 1);
  }
  if (mofei_cpu1_sync.s_system_full_inited) {
    uint8_t one = 1;
    address_space_write(&address_space_memory, mofei_cpu1_sync.s_system_full_inited, MEMTXATTRS_UNSPECIFIED, &one, 1);
  }

  /* Patch ADC calibration functions to return 0 immediately.
   * NOTE: This timer callback is currently unused (never scheduled).
   * ADC patches are applied during ELF loading instead. */
  for (int i = 0; i < mofei_cpu1_sync.adc_patch_count; i++) {
    if (mofei_cpu1_sync.adc_patch_fns[i]) {
      uint8_t patch[] = {0x36, 0x21, 0x00, 0x02, 0x0c, 0x1d, 0xf0};
      address_space_write(&address_space_memory, mofei_cpu1_sync.adc_patch_fns[i], MEMTXATTRS_UNSPECIFIED, patch,
                          sizeof(patch));
    }
  }

  /* Arm a periodic debug timer to dump CPU0 PC every second — DISABLED */
#if 0
    if (!mofei_debug_pc_timer) {
        mofei_debug_pc_timer = timer_new_ms(QEMU_CLOCK_REALTIME,
                                             mofei_debug_pc_timer_cb, NULL);
    }
    mofei_debug_pc_dumps = 0;
    timer_mod(mofei_debug_pc_timer,
              qemu_clock_get_ms(QEMU_CLOCK_REALTIME) + 1000);
#endif
}

#define TYPE_ESP32S3_SOC "xtensa.esp32s3"
#define ESP32S3_SOC(obj) OBJECT_CHECK(Esp32s3SocState, (obj), TYPE_ESP32S3_SOC)

#define TYPE_ESP32S3_CPU XTENSA_CPU_TYPE_NAME("esp32s3")

enum {
  ESP32S3_MEMREGION_IROM,
  ESP32S3_MEMREGION_DROM,
  ESP32S3_MEMREGION_DRAM,
  ESP32S3_MEMREGION_IRAM,
  ESP32S3_MEMREGION_ICACHE,
  ESP32S3_MEMREGION_DCACHE,
  ESP32S3_MEMREGION_RTCSLOW,
  ESP32S3_MEMREGION_RTCFAST,
  ESP32S3_MEMREGION_FRAMEBUF,
};

static const struct MemmapEntry {
  hwaddr base;
  hwaddr size;
} esp32s3_memmap[] = {
    [ESP32S3_MEMREGION_DROM] = {0x3ff00000, 0x20000},
    [ESP32S3_MEMREGION_IROM] = {0x40000000, 0x60000},
    [ESP32S3_MEMREGION_DRAM] = {MOFEI_SIM_INTERNAL_DRAM_BASE,
                                MOFEI_SIM_EXTERNAL_RAM_LIMIT - MOFEI_SIM_INTERNAL_DRAM_BASE},
    [ESP32S3_MEMREGION_IRAM] = {0x40370000, 0x80000},
    [ESP32S3_MEMREGION_DCACHE] = {0x3c000000, ESP32S3_EXTMEM_REGION_SIZE},
    [ESP32S3_MEMREGION_ICACHE] = {0x42000000, ESP32S3_EXTMEM_REGION_SIZE},
    [ESP32S3_MEMREGION_RTCSLOW] = {0x50000000, 0x2000},
    [ESP32S3_MEMREGION_RTCFAST] = {0x600fe000, 0x2000},
    /* Virtual Framebuffer, used for the graphical interface */
    [ESP32S3_MEMREGION_FRAMEBUF] = {0x20000000, ESP_RGB_MAX_VRAM_SIZE},
};

#define ESP32S3_SOC_RESET_PROCPU 0x1
#define ESP32S3_SOC_RESET_APPCPU 0x2
#define ESP32S3_SOC_RESET_PERIPH 0x4
#define ESP32S3_SOC_RESET_DIG (ESP32S3_SOC_RESET_PROCPU | ESP32S3_SOC_RESET_APPCPU | ESP32S3_SOC_RESET_PERIPH)
#define ESP32S3_SOC_RESET_RTC 0x8
#define ESP32S3_SOC_RESET_ALL (ESP32S3_SOC_RESET_RTC | ESP32S3_SOC_RESET_DIG)

#define ESP32S3_IO_WARNING 0

typedef struct Esp32s3SocState {
  /*< private >*/
  DeviceState parent_obj;

  /*< public >*/
  XtensaCPU cpu[ESP32S3_CPU_COUNT];
  Esp32s3IntMatrixState intmatrix;
  ESP32S3UARTState uart[ESP32S3_UART_COUNT];
  Esp32I2CState i2c[ESP32S3_I2C_COUNT];
  ESP32S3GPIOState gpio;
  Esp32s3RngState rng;
  Esp32S3TWAIState twai;

  Esp32s3RtcCntlState rtc_cntl;

