Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
  BusState rtc_bus;
  BusState periph_bus;

  MemoryRegion cpu_specific_mem[ESP32S3_CPU_COUNT];
  ESP32S3SpiState spi1;
  DeviceState* mofei_spi2;       /* GPSPI2 — selected e-ink SPI master */
  DeviceState* mofei_epd;        /* selected e-ink panel */
  DeviceState* lilygo_radio;     /* SX1262 on shared GPSPI2 target 1 */
  DeviceState* lilygo_touch;     /* GT911 on upstream I2C0 */
  Chardev* lilygo_gnss;          /* deterministic GNSS peer on UART2 */
  DeviceState* mofei_i2c_bridge; /* GPIO_I2C bridge for selected touch controller */
  DeviceState* mofei_touch;      /* selected touch controller */
  uint64_t kernel_entry;         /* Non-zero when -kernel ELF loaded */
  ESP32S3CacheState cache;
  ESP32S3EfuseState efuse;
  ESP32S3ClockState clock;
  ESP32S3GdmaState gdma;
  ESP32S3ShaState sha;
  ESP32S3AesState aes;
  ESP32S3RsaState rsa;
  ESP32S3HmacState hmac;
  ESP32S3DsState ds;
  ESP32S3PmsState pms;

  ESP32S3XtsAesState xts_aes;
  ESP32S3TimgState timg[2];
  ESP32S3SysTimerState systimer;

  ESP32C3UsbJtagState jtag;
  ESPRgbState rgb;

  MemoryRegion iomem;
  DWCSDMMCState sdmmc;
  DeviceState* eth;
  SsiPsramState* psram;

  uint32_t requested_reset;
  uint32_t suppress_reset_count;
} Esp32s3SocState;

static I2CBus* esp32s3_lilygo_i2c_bus(Esp32s3SocState* s) {
  if (mofei_sim_board_is_lilygo_t5s3_pro() || mofei_sim_board_is_m5papers3()) {
    return I2C_BUS(qdev_get_child_bus(DEVICE(&s->i2c[0]), "i2c"));
  }
  return NULL;
}

/* Temporary macro to mark the CPU as in non-debugging mode */
#define A_ASSIST_DEBUG_CORE_0_DEBUG_MODE_REG 0x098

/* "QEMU" as a 32-bit value, can be used by the application to to check whether it is running in
 * QEMU or on real hardware */
#define RGB_QEMU_ORIGIN 0x51454d55
#define RGB_QEMU_ORIGIN_REG 0x3F8

static void remove_cpu_watchpoints(XtensaCPU* xcs) {
  for (int i = 0; i < MAX_NDBREAK; ++i) {
    if (xcs->env.cpu_watchpoint[i]) {
      cpu_watchpoint_remove_by_ref(CPU(xcs), xcs->env.cpu_watchpoint[i]);
      xcs->env.cpu_watchpoint[i] = NULL;
    }
  }
}

static void esp32s3_dig_reset(void* opaque, int n, int level) {
  Esp32s3SocState* s = ESP32S3_SOC(opaque);
  if (level) {
    if (s->suppress_reset_count > 0) {
      s->suppress_reset_count--;
      return;
    }
    s->requested_reset = ESP32S3_SOC_RESET_DIG;
    qemu_system_reset_request(SHUTDOWN_CAUSE_GUEST_RESET);
  }
}

static void esp32s3_cpu_reset(void* opaque, int n, int level) {
  Esp32s3SocState* s = ESP32S3_SOC(opaque);
  if (level) {
    s->requested_reset = (n == 0) ? ESP32S3_SOC_RESET_PROCPU : ESP32S3_SOC_RESET_APPCPU;
    ShutdownCause cause = (n == 0) ? SHUTDOWN_CAUSE_GUEST_RESET : SHUTDOWN_CAUSE_SUBSYSTEM_RESET;
    qemu_system_reset_request(cause);
  }
}

static void esp32s3_soc_reset(DeviceState* dev) {
  Esp32s3SocState* s = ESP32S3_SOC(dev);
  if (s->requested_reset == 0) {
    s->requested_reset = ESP32S3_SOC_RESET_ALL;
  }
  if (s->requested_reset & ESP32S3_SOC_RESET_PERIPH) {
    device_cold_reset(DEVICE(&s->intmatrix));
    for (int i = 0; i < ESP32S3_UART_COUNT; ++i) {
      device_cold_reset(DEVICE(&s->uart[i]));
    }
  }
  if (s->requested_reset & ESP32S3_SOC_RESET_PROCPU) {
    xtensa_select_static_vectors(&s->cpu[0].env, s->rtc_cntl.stat_vector_sel[0]);
    remove_cpu_watchpoints(&s->cpu[0]);
    if (s->cpu[0].env.kernel_entry) {
      reset_mmu(&s->cpu[0].env);
      s->cpu[0].env.sregs[WINDOW_START] = 1;
      s->cpu[0].env.sregs[WINDOW_BASE] = 0;
      s->cpu[0].env.sregs[PS] &= ~PS_EXCM;
      s->cpu[0].env.sregs[PS] |= PS_WOE;
      s->cpu[0].env.sregs[VECBASE] = 0x40000000;
      s->cpu[0].env.pc = s->cpu[0].env.kernel_entry;
      CPU(&s->cpu[0])->exception_index = -1;
      CPU(&s->cpu[0])->halted = 0;
    }
    fprintf(stderr, "[SOC] PROCPU reset: pc=0x%x kernel_entry=0x%lx\n", s->cpu[0].env.pc,
            (unsigned long)s->cpu[0].env.kernel_entry);
  }
  if (s->requested_reset & ESP32S3_SOC_RESET_APPCPU && (ESP32S3_CPU_COUNT > 1)) {
    xtensa_select_static_vectors(&s->cpu[1].env, s->rtc_cntl.stat_vector_sel[1]);
    remove_cpu_watchpoints(&s->cpu[1]);
    if (!CPU(&s->cpu[1])->start_powered_off) {
      cpu_reset(CPU(&s->cpu[1]));
    }
  }
  s->requested_reset = 0;
}

static void esp32s3_cpu_stall(void* opaque, int n, int level) {}

static void esp32s3_clk_update(void* opaque, int n, int level) {
  if (!level) {
    return;
  }
}

static void esp32s3_soc_add_periph_device(MemoryRegion* dest, void* dev, hwaddr dport_base_addr) {
  MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0);
  /* Use priority 1 so real peripherals shadow the catch-all iomem region
   * mapped at 0x60000000 (ESP32S3_IO_START_ADDR).  Without this, the
   * iomem handler silently drops all reads/writes to UART0, SPI, etc. */
  memory_region_add_subregion_overlap(dest, dport_base_addr, mr, 1);
  MemoryRegion* mr_apb = g_new(MemoryRegion, 1);
  char* name = g_strdup_printf("mr-apb-0x%08x", (uint32_t)dport_base_addr);
  memory_region_init_alias(mr_apb, OBJECT(dev), name, mr, 0, memory_region_size(mr));
  g_free(name);
}

#define MB (1024 * 1024)

static void esp32s3_init_spi_flash(Esp32s3SocState* ms, BlockBackend* blk) {
  DeviceState* spi_master = DEVICE(&ms->spi1);
  BusState* spi_bus = qdev_get_child_bus(spi_master, "spi");
  const char* flash_model = NULL;
  int64_t image_size = blk_getlength(blk);

  switch (image_size) {
    case 2 * MB:
      flash_model = "w25x16";
      break;
    case 4 * MB:
      flash_model = "gd25q32";
      break;
    case 8 * MB:
      flash_model = "gd25q64";
      break;
    case 16 * MB:
      flash_model = "is25lp128";
      break;
    default:
      error_report("Drive size error: only 2, 4, 8, and 16MB images are supported");
      return;
  }

  /* Create the SPI flash model */
  DeviceState* flash_dev = qdev_new(flash_model);
  qdev_prop_set_drive(flash_dev, "drive", blk);

  /* Realize the SPI flash, its "drive" (blk) property must already be set! */
  qdev_realize(flash_dev, spi_bus, &error_fatal);
  qdev_connect_gpio_out_named(spi_master, SSI_GPIO_CS, 0, qdev_get_gpio_in_named(flash_dev, SSI_GPIO_CS, 0));
}

static void esp32s3_machine_init_psram(Esp32s3SocState* ms, uint32_t size_mbytes) {
  /* PSRAM attached to SPI1, CS1 */
  DeviceState* spi_master = DEVICE(&ms->spi1);
  BusState* spi_bus = qdev_get_child_bus(spi_master, "spi");
  DeviceState* psram = qdev_new(TYPE_SSI_PSRAM);
  qdev_prop_set_uint32(psram, "size_mbytes", size_mbytes);
  qdev_prop_set_uint8(psram, "cs", 1);
  qdev_realize(psram, spi_bus, &error_fatal);
  ms->psram = SSI_PSRAM(psram);
  qdev_connect_gpio_out_named(spi_master, SSI_GPIO_CS, 1, qdev_get_gpio_in_named(psram, SSI_GPIO_CS, 0));
}

static void esp32s3_machine_init_sd(Esp32s3SocState* ss, BlockBackend* blk) {
  if (blk != NULL) {
    DeviceState* card;

