Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
    card = qdev_new(TYPE_SD_CARD);
    qdev_prop_set_drive_err(card, "drive", blk, &error_fatal);
    /* See the comment on not using sysbus-default in esp32_machine_init_i2c */
    DeviceState* sdmmc = DEVICE(&ss->sdmmc);
    SDBus* sd_bus = SD_BUS(qdev_get_child_bus(sdmmc, "sd-bus"));
    qdev_realize_and_unref(card, BUS(sd_bus), &error_fatal);
  }
}

static void esp32s3_machine_attach_lilygo_spi_sd(DeviceState* spi2, BlockBackend* blk, int target) {
  SSIBus* spi_bus = (SSIBus*)qdev_get_child_bus(spi2, "spi");
  DeviceState* adapter = qdev_new("ssi-sd");
  qdev_prop_set_uint8(adapter, "cs", target);
  qdev_realize(adapter, BUS(spi_bus), &error_fatal);

  qemu_irq adapter_cs = qdev_get_gpio_in_named(adapter, SSI_GPIO_CS, 0);
  qemu_set_irq(adapter_cs, 1);
  qdev_connect_gpio_out_named(spi2, "target-select", target, adapter_cs);

  DeviceState* card = qdev_new(TYPE_SD_CARD_SPI);
  if (target == 0 && blk != NULL) qdev_prop_set_bit(card, "lilygo-storage", true);
  qdev_prop_set_drive_err(card, "drive", blk, &error_fatal);
  qdev_realize_and_unref(card, qdev_get_child_bus(adapter, "sd-bus"), &error_fatal);
}

static DeviceState* esp32s3_machine_init_lilygo_spi(DeviceState* spi2, BlockBackend* blk) {
  esp32s3_machine_attach_lilygo_spi_sd(spi2, blk, 0);
  fprintf(stderr, "[LILYGO-SPI] upstream ssi-sd media attached owner=sd cs=%d\n", LILYGO_SD_CS_GPIO);

  SSIBus* spi_bus = (SSIBus*)qdev_get_child_bus(spi2, "spi");
  DeviceState* radio = qdev_new(TYPE_LILYGO_SX1262);
  qdev_prop_set_uint8(radio, "cs", 1);
  qdev_realize(radio, BUS(spi_bus), &error_fatal);
  qemu_irq radio_cs = qdev_get_gpio_in_named(radio, SSI_GPIO_CS, 0);
  qemu_set_irq(radio_cs, 1);
  qdev_connect_gpio_out_named(spi2, "target-select", 1, radio_cs);
  fprintf(stderr, "[LILYGO-SPI] SX1262 attached owner=radio cs=%d\n", LILYGO_RADIO_CS_GPIO);
  return radio;
}

struct Esp32s3MachineState {
  MachineState parent;

  Esp32s3SocState esp32s3;
  DeviceState* flash_dev;
};
#define TYPE_ESP32S3_MACHINE MACHINE_TYPE_NAME("esp32s3")

static void esp32s3_init_openeth(Esp32s3SocState* ms) {
  MemoryRegion* mr = NULL;
  SysBusDevice* sbd = NULL;

  MemoryRegion* sys_mem = get_system_memory();

  /* Create a new OpenCores Ethernet component */
  DeviceState* open_eth_dev = qemu_create_nic_device("open_eth", true, NULL);
  if (!open_eth_dev) {
    return;
  }
  ms->eth = open_eth_dev;
  sbd = SYS_BUS_DEVICE(open_eth_dev);
  sysbus_realize(sbd, &error_fatal);

  /* OpenCores Ethernet has two memory regions: one for registers and one for descriptors,
   * we need to provide one I/O range for each of them */
  mr = sysbus_mmio_get_region(sbd, 0);
  memory_region_add_subregion_overlap(sys_mem, DR_REG_EMAC_BASE, mr, 0);
  mr = sysbus_mmio_get_region(sbd, 1);
  memory_region_add_subregion_overlap(sys_mem, DR_REG_EMAC_BASE + 0x400, mr, 0);

  sysbus_connect_irq(sbd, 0, qdev_get_gpio_in(DEVICE(&ms->intmatrix), ETS_ETH_MAC_INTR_SOURCE));
}

static void esp32s3_soc_realize(DeviceState* dev, Error** errp) {
  Esp32s3SocState* s = ESP32S3_SOC(dev);
  MachineState* ms = MACHINE(qdev_get_machine());
  DeviceState* intmatrix_dev = DEVICE(&s->intmatrix);
  MemoryRegion* sys_mem = get_system_memory();

  const struct MemmapEntry* memmap = esp32s3_memmap;

  MemoryRegion* iram = g_new(MemoryRegion, 1);
  MemoryRegion* rtcslow = g_new(MemoryRegion, 1);
  MemoryRegion* rtcfast = g_new(MemoryRegion, 1);

  MemoryRegion* irom_cpu0 = NULL;
  for (int i = 0; i < ms->smp.cpus; ++i) {
    MemoryRegion* drom = g_new(MemoryRegion, 1);
    MemoryRegion* irom = g_new(MemoryRegion, 1);

    char name[20];
    snprintf(name, sizeof(name), "esp32s3.irom.cpu%d", i);
    memory_region_init_rom(irom, NULL, name, memmap[ESP32S3_MEMREGION_IROM].size, &error_fatal);
    memory_region_add_subregion(&s->cpu_specific_mem[i], memmap[ESP32S3_MEMREGION_IROM].base, irom);

    const hwaddr offset_in_orig = 0x40000;
    snprintf(name, sizeof(name), "esp32s3.drom.cpu%d", i);
    memory_region_init_alias(drom, NULL, name, irom, offset_in_orig, memmap[ESP32S3_MEMREGION_DROM].size);
    memory_region_add_subregion(sys_mem, memmap[ESP32S3_MEMREGION_DROM].base, drom);

    if (i == 0) {
      irom_cpu0 = irom;
    }
  }

  /* Low-address aliases for windowed-call return addresses.
   *
   * The Xtensa callx4/callx8/callx12 instructions encode the window
   * increment in bits [31:30] of the return address, leaving only 30 bits
   * for the actual PC.  When code above 0x40000000 executes a callx8,
   * the return address is truncated: e.g. callx8 from 0x40043CE1 stores
   * 0x80043CE4, and retw jumps to 0x00043CE4.  On real ESP32-S3 hardware
   * the ROM, IRAM, and cached flash are aliased at both their canonical
   * addresses and the 30-bit-truncated addresses.  QEMU must create the
   * same aliases.
   *
   * Affected regions:
   *   0x40000000 (IROM)    → alias at 0x00000000
   *   0x40370000 (IRAM)    → alias at 0x00370000
   *   0x42000000 (ICACHE)  → alias at 0x02000000  (added later)
   */
  if (irom_cpu0) {
    MemoryRegion* irom_alias = g_new(MemoryRegion, 1);
    memory_region_init_alias(irom_alias, OBJECT(s), "esp32s3.irom-low", irom_cpu0, 0,
                             memmap[ESP32S3_MEMREGION_IROM].size);
    /* Must be added to the CPU's own address space (cpu_specific_mem),
     * not sys_mem, because the CPU fetches instructions through its
     * private address space and the alias must be resolved at that level.
     * Use priority 1 to shadow the sys_mem alias inside cpu_specific_mem. */
    memory_region_add_subregion_overlap(&s->cpu_specific_mem[0], 0x00000000, irom_alias, 1);
    fprintf(stderr, "[QEMU-DBG] IROM low-address alias at 0x00000000 (%lu KB)\n",
            (unsigned long)(memmap[ESP32S3_MEMREGION_IROM].size / 1024));
  }

  memory_region_init_ram(iram, NULL, "esp32s3.iram", memmap[ESP32S3_MEMREGION_IRAM].size, &error_fatal);
  memory_region_add_subregion(sys_mem, memmap[ESP32S3_MEMREGION_IRAM].base, iram);

  /* IRAM low-address alias (0x4037xxxx → 0x0037xxxx) */
  {
    MemoryRegion* iram_alias = g_new(MemoryRegion, 1);
    memory_region_init_alias(iram_alias, OBJECT(s), "esp32s3.iram-low", iram, 0, memmap[ESP32S3_MEMREGION_IRAM].size);
    memory_region_add_subregion_overlap(&s->cpu_specific_mem[0], 0x00370000, iram_alias, 1);
    fprintf(stderr, "[QEMU-DBG] IRAM low-address alias at 0x00370000 (%lu KB)\n",
            (unsigned long)(memmap[ESP32S3_MEMREGION_IRAM].size / 1024));
  }

  memory_region_init_ram(rtcslow, NULL, "esp32s3.rtcslow", memmap[ESP32S3_MEMREGION_RTCSLOW].size, &error_fatal);
  memory_region_add_subregion(sys_mem, memmap[ESP32S3_MEMREGION_RTCSLOW].base, rtcslow);

  memory_region_init_ram(rtcfast, NULL, "esp32s3.rtcfast", memmap[ESP32S3_MEMREGION_RTCFAST].size, &error_fatal);
  memory_region_add_subregion(sys_mem, memmap[ESP32S3_MEMREGION_RTCFAST].base, rtcfast);

