Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
  for (int i = 0; i < ms->smp.cpus; ++i) {
    qdev_realize(DEVICE(&s->cpu[i]), NULL, &error_fatal);
  }

  for (int i = 0; i < ESP32S3_CPU_COUNT; ++i) {
    char name[16];
    snprintf(name, sizeof(name), "cpu%d", i);
    object_property_set_link(OBJECT(&s->intmatrix), name, OBJECT(qemu_get_cpu(i)), &error_abort);
  }
  qdev_realize(DEVICE(&s->intmatrix), &s->periph_bus, &error_fatal);

  qdev_realize(DEVICE(&s->rtc_cntl), &s->rtc_bus, &error_fatal);
  esp32s3_soc_add_periph_device(sys_mem, &s->rtc_cntl, DR_REG_RTCCNTL_BASE);

  qdev_connect_gpio_out_named(DEVICE(&s->rtc_cntl), ESP32S3_RTC_DIG_RESET_GPIO, 0,
                              qdev_get_gpio_in_named(dev, ESP32S3_RTC_DIG_RESET_GPIO, 0));
  qdev_connect_gpio_out_named(DEVICE(&s->rtc_cntl), ESP32S3_RTC_CLK_UPDATE_GPIO, 0,
                              qdev_get_gpio_in_named(dev, ESP32S3_RTC_CLK_UPDATE_GPIO, 0));
  for (int i = 0; i < ms->smp.cpus; ++i) {
    qdev_connect_gpio_out_named(DEVICE(&s->rtc_cntl), ESP32S3_RTC_CPU_RESET_GPIO, i,
                                qdev_get_gpio_in_named(dev, ESP32S3_RTC_CPU_RESET_GPIO, i));
    qdev_connect_gpio_out_named(DEVICE(&s->rtc_cntl), ESP32S3_RTC_CPU_STALL_GPIO, i,
                                qdev_get_gpio_in_named(dev, ESP32S3_RTC_CPU_STALL_GPIO, i));
  }

  for (int i = 0; i < ESP32S3_UART_COUNT; ++i) {
    const hwaddr uart_base[] = {DR_REG_UART_BASE, DR_REG_UART1_BASE, DR_REG_UART2_BASE};
    qdev_realize(DEVICE(&s->uart[i]), &s->periph_bus, &error_fatal);
    esp32s3_soc_add_periph_device(sys_mem, &s->uart[i], uart_base[i]);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->uart[i]), 0, qdev_get_gpio_in(intmatrix_dev, ETS_UART0_INTR_SOURCE + i));
  }

  for (int i = 0; i < ESP32S3_I2C_COUNT; ++i) {
    const hwaddr i2c_base[] = {DR_REG_I2C_EXT_BASE, DR_REG_I2C1_EXT_BASE};
    qdev_prop_set_bit(DEVICE(&s->i2c[i]), "esp32s3-compat", true);
    qdev_realize(DEVICE(&s->i2c[i]), &s->periph_bus, &error_fatal);
    esp32s3_soc_add_periph_device(sys_mem, &s->i2c[i], i2c_base[i]);
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->i2c[i]), 0, qdev_get_gpio_in(intmatrix_dev, ETS_I2C_EXT0_INTR_SOURCE + i));
  }

  qdev_realize(DEVICE(&s->sdmmc), &s->periph_bus, &error_fatal);
  esp32s3_soc_add_periph_device(sys_mem, &s->sdmmc, DR_REG_SDMMC_BASE);
  sysbus_connect_irq(SYS_BUS_DEVICE(&s->sdmmc), 0, qdev_get_gpio_in(intmatrix_dev, ETS_SDIO_HOST_INTR_SOURCE));

  /* Emulation of APB_CTRL_DATE_REG, needed for ECO3 revision detection.
   * This is a small hack to avoid creating a whole new device just to emulate one
   * register.
   */
  const hwaddr apb_ctrl_regs = DR_REG_APB_CTRL_BASE;
  MemoryRegion* apbctrl_mem = g_new(MemoryRegion, 1);
  memory_region_init_ram(apbctrl_mem, NULL, "esp32s3.apbctrl", 0x400 /* bytes */, &error_fatal);
  memory_region_add_subregion(sys_mem, apb_ctrl_regs, apbctrl_mem);
  uint32_t apb_ctrl_date_reg_val = 0x16042000 | 0x80000000; /* MSB indicates ECO3 silicon revision */
  uint32_t qemu_sig = RGB_QEMU_ORIGIN;
  cpu_physical_memory_write(apb_ctrl_regs + 0x7c, &apb_ctrl_date_reg_val, 4);
  cpu_physical_memory_write(apb_ctrl_regs + RGB_QEMU_ORIGIN_REG, &qemu_sig, 4);

  qemu_register_reset((QEMUResetHandler*)esp32s3_soc_reset, dev);

  /* TWAI realization */
  {
    /* Initialize and realize the TWAI device */
    sysbus_realize(SYS_BUS_DEVICE(&s->twai), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&s->twai), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_TWAI_BASE, mr, 0);
    /* Connect TWAI interrupt to the interrupt matrix */
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->twai), 0, qdev_get_gpio_in(intmatrix_dev, ETS_TWAI_INTR_SOURCE));
  }
}

static uint64_t esp32s3_io_read(void* opaque, hwaddr addr, unsigned int size) {
  if (addr >= 0x40000 && addr < 0x42000) {
    return 1u << 16;
  }
  return 0;
}

static void esp32s3_io_write(void* opaque, hwaddr addr, uint64_t value, unsigned int size) {
  if (addr >= 0x40000 && addr < 0x42000) {
    static int adc_wr_log = 0;
    if (adc_wr_log < 5) {
      fprintf(stderr, "[QEMU-DBG] ADC IO write: addr=0x%lx value=0x%lx size=%u\n", (unsigned long)addr,
              (unsigned long)value, size);
      adc_wr_log++;
    }
  }
#if ESP32S3_IO_WARNING
  warn_report("[ESP32-S3] Unsupported write $%08lx = %08lx\n", ESP32S3_IO_START_ADDR + addr, value);
#endif
}

/* Define operations for I/OS */
static const MemoryRegionOps esp32s3_io_ops = {
    .read = esp32s3_io_read,
    .write = esp32s3_io_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};

static void esp32s3_soc_init(Object* obj) {
  Esp32s3SocState* s = ESP32S3_SOC(obj);
  MachineState* ms = MACHINE(qdev_get_machine());
  char name[16];
  MemoryRegion* system_memory = get_system_memory();

  qbus_init(&s->periph_bus, sizeof(s->periph_bus), TYPE_SYSTEM_BUS, DEVICE(s), "esp32-periph-bus");
  qbus_init(&s->rtc_bus, sizeof(s->rtc_bus), TYPE_SYSTEM_BUS, DEVICE(s), "esp32-rtc-bus");

  for (int i = 0; i < ms->smp.cpus; ++i) {
    snprintf(name, sizeof(name), "cpu%d", i);

    object_initialize_child(obj, name, &s->cpu[i], TYPE_ESP32S3_CPU);
    // Allocate memory for TIE registers
    s->cpu[i].env.ext = qemu_memalign(16, sizeof(CPUXtensaEsp32s3State));

    if (i == 0) {
      s->cpu[i].env.sregs[PRID] = 0xcdcd;
    }
    if (i == 1) {
      s->cpu[i].env.sregs[PRID] = 0xabab;
    }

    snprintf(name, sizeof(name), "cpu%d-mem", i);
    memory_region_init(&s->cpu_specific_mem[i], NULL, name, UINT32_MAX);

    CPUState* cs = CPU(&s->cpu[i]);
    cs->num_ases = 1;
    cpu_address_space_init(cs, 0, "cpu-memory", &s->cpu_specific_mem[i]);

    MemoryRegion* cpu_view_sysmem = g_new(MemoryRegion, 1);
    snprintf(name, sizeof(name), "cpu%d-sysmem", i);
    memory_region_init_alias(cpu_view_sysmem, NULL, name, system_memory, 0, UINT32_MAX);
    memory_region_add_subregion_overlap(&s->cpu_specific_mem[i], 0, cpu_view_sysmem, 0);
    cs->memory = &s->cpu_specific_mem[i];
  }

  for (int i = 0; i < ESP32S3_UART_COUNT; ++i) {
    snprintf(name, sizeof(name), "uart%d", i);
    object_initialize_child(obj, name, &s->uart[i], TYPE_ESP32S3_UART);
  }

  for (int i = 0; i < ESP32S3_I2C_COUNT; ++i) {
    snprintf(name, sizeof(name), "i2c%d", i);
    object_initialize_child(obj, name, &s->i2c[i], TYPE_ESP32_I2C);
  }

  object_property_add_alias(obj, "serial0", OBJECT(&s->uart[0]), "chardev");
  object_property_add_alias(obj, "serial1", OBJECT(&s->uart[1]), "chardev");
  // object_property_add_alias(obj, "serial2", OBJECT(&s->uart[2]), "chardev");
  qdev_prop_set_chr(DEVICE(&s->uart[0]), "chardev", serial_hd(0));
  qdev_prop_set_chr(DEVICE(&s->uart[1]), "chardev", serial_hd(1));
  // qdev_prop_set_chr(DEVICE(&s->uart[2]), "chardev", serial_hd(2));

  object_initialize_child(obj, "intmatrix", &s->intmatrix, TYPE_ESP32S3_INTMATRIX);

  object_initialize_child(obj, "rtc_cntl", &s->rtc_cntl, TYPE_ESP32S3_RTC_CNTL);

  qdev_init_gpio_in_named(DEVICE(s), esp32s3_dig_reset, ESP32S3_RTC_DIG_RESET_GPIO, 1);
  qdev_init_gpio_in_named(DEVICE(s), esp32s3_cpu_reset, ESP32S3_RTC_CPU_RESET_GPIO, ESP32S3_CPU_COUNT);
  qdev_init_gpio_in_named(DEVICE(s), esp32s3_cpu_stall, ESP32S3_RTC_CPU_STALL_GPIO, ESP32S3_CPU_COUNT);
  qdev_init_gpio_in_named(DEVICE(s), esp32s3_clk_update, ESP32S3_RTC_CLK_UPDATE_GPIO, 1);

  object_initialize_child(obj, "twai", &s->twai, TYPE_ESP32S3_TWAI);

  object_initialize_child(obj, "sdmmc", &s->sdmmc, TYPE_DWC_SDMMC);
}

static Property esp32s3_soc_properties[] = {
    DEFINE_PROP_END_OF_LIST(),
};

static void esp32s3_soc_class_init(ObjectClass* klass, void* data) {
  DeviceClass* dc = DEVICE_CLASS(klass);

  dc->realize = esp32s3_soc_realize;
  device_class_set_props(dc, esp32s3_soc_properties);
}

static const TypeInfo esp32s3_soc_info = {.name = TYPE_ESP32S3_SOC,
                                          .parent = TYPE_DEVICE,
                                          .instance_size = sizeof(Esp32s3SocState),
                                          .instance_init = esp32s3_soc_init,
                                          .class_init = esp32s3_soc_class_init};

