Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
static void esp32s3_soc_register_types(void) { type_register_static(&esp32s3_soc_info); }

type_init(esp32s3_soc_register_types)

    static uint64_t translate_phys_addr(void* opaque, uint64_t addr) {
  XtensaCPU* cpu = opaque;

  return cpu_get_phys_page_debug(CPU(cpu), addr);
}

OBJECT_DECLARE_SIMPLE_TYPE(Esp32s3MachineState, ESP32S3_MACHINE)

// -----------------------------------------------

static void esp32s3_soc_add_unimp_device(MemoryRegion* dest, const char* name, hwaddr dport_base_addr, size_t size) {
  create_unimplemented_device(name, dport_base_addr, size);
  char* name_apb = g_strdup_printf("%s-apb", name);
  create_unimplemented_device(name_apb, dport_base_addr + APB_REG_BASE, size);
  g_free(name_apb);
}

typedef struct MofeiFirmwareSymbol {
  uint32_t address;
  uint32_t size;
  char type;
  char* name;
} MofeiFirmwareSymbol;

static GArray* mofei_firmware_symbols;

static bool mofei_symbol_type_is_function(char type) {
  return type == 'T' || type == 't' || type == 'W' || type == 'w';
}

static void mofei_clear_firmware_symbols(void) {
  if (!mofei_firmware_symbols) {
    return;
  }
  for (guint i = 0; i < mofei_firmware_symbols->len; i++) {
    MofeiFirmwareSymbol* symbol = &g_array_index(mofei_firmware_symbols, MofeiFirmwareSymbol, i);
    g_free(symbol->name);
  }
  g_array_free(mofei_firmware_symbols, TRUE);
  mofei_firmware_symbols = NULL;
}

static const char* mofei_resolve_firmware_symbols_path(void) {
  const char* symbols_path = getenv("MOFEI_FIRMWARE_SYMBOLS");
  if (symbols_path && symbols_path[0]) {
    return symbols_path;
  }
  if (g_file_test(MOFEI_BROWSER_FIRMWARE_SYMBOLS_PATH, G_FILE_TEST_IS_REGULAR)) {
    return MOFEI_BROWSER_FIRMWARE_SYMBOLS_PATH;
  }
  return NULL;
}

static void mofei_load_firmware_symbols(void) {
  const char* symbols_path = mofei_resolve_firmware_symbols_path();
  if (!symbols_path || !symbols_path[0]) {
    return;
  }

  mofei_clear_firmware_symbols();

  gchar* contents = NULL;
  gsize contents_len = 0;
  if (!g_file_get_contents(symbols_path, &contents, &contents_len, NULL) || !contents) {
    fprintf(stderr, "[QEMU-SIM] WARNING: could not read firmware symbols '%s'\n", symbols_path);
    return;
  }

  mofei_firmware_symbols = g_array_new(FALSE, FALSE, sizeof(MofeiFirmwareSymbol));
  gchar** lines = g_strsplit(contents, "\n", -1);
  for (gchar** cursor = lines; cursor && *cursor; cursor++) {
    char* line = g_strstrip(*cursor);
    if (!line[0] || line[0] == '#') {
      continue;
    }

    unsigned int address = 0;
    unsigned int size = 0;
    char type = 0;
    int name_offset = 0;
    if (sscanf(line, "%x %x %c %n", &address, &size, &type, &name_offset) < 3 || name_offset <= 0) {
      continue;
    }

    char* name = g_strstrip(line + name_offset);
    if (!name[0]) {
      continue;
    }

    MofeiFirmwareSymbol symbol = {
        .address = (uint32_t)address,
        .size = (uint32_t)size,
        .type = type,
        .name = g_strdup(name),
    };
    g_array_append_val(mofei_firmware_symbols, symbol);
  }
  g_strfreev(lines);
  g_free(contents);

  fprintf(stderr, "[QEMU-SIM] Loaded %u firmware symbols from %s\n", mofei_firmware_symbols->len, symbols_path);
}

static const char* mofei_resolve_firmware_kernel_path(void) {
  const char* elf_path = getenv("MOFEI_FIRMWARE_ELF");
  if (elf_path && elf_path[0]) {
    return elf_path;
  }
  if (g_file_test(MOFEI_BROWSER_FIRMWARE_KERNEL_PATH, G_FILE_TEST_IS_REGULAR)) {
    return MOFEI_BROWSER_FIRMWARE_KERNEL_PATH;
  }
  return MOFEI_DEFAULT_FIRMWARE_ELF_PATH;
}

static const MofeiFirmwareSymbol* mofei_find_firmware_symbol(const char* sym_name) {
  if (!mofei_firmware_symbols || !sym_name || !sym_name[0]) {
    return NULL;
  }

  for (guint i = 0; i < mofei_firmware_symbols->len; i++) {
    const MofeiFirmwareSymbol* symbol = &g_array_index(mofei_firmware_symbols, MofeiFirmwareSymbol, i);
    if (symbol->address && symbol->name && strcmp(symbol->name, sym_name) == 0) {
      return symbol;
    }
  }

  return NULL;
}

/* Resolve a symbol's address from an ELF file's .symtab.
 * Returns the symbol value if found, or 0. */
static uint32_t mofei_resolve_elf_symbol(const uint8_t* elf_data, gsize elf_len, const char* sym_name) {
  const MofeiFirmwareSymbol* sidecar_symbol = mofei_find_firmware_symbol(sym_name);
  if (sidecar_symbol) {
    return sidecar_symbol->address;
  }

  if (!elf_data || elf_len < 52 || memcmp(elf_data, ELFMAG, 4) != 0) {
    return 0;
  }

  /* Read ELF header (assume LE — BE ELFs are pre-swapped by the caller) */
  uint32_t e_shoff = *(uint32_t*)(elf_data + 32);
  uint16_t e_shentsize = *(uint16_t*)(elf_data + 46);
  uint16_t e_shnum = *(uint16_t*)(elf_data + 48);

  /* Find SHT_SYMTAB (type 2) and its associated string table */
  uint32_t symtab_off = 0, symtab_size = 0, strtab_off = 0;
  for (int si = 0; si < e_shnum; si++) {
    uint32_t sh_off = e_shoff + si * e_shentsize;
    if (sh_off + 40 > elf_len) break;
    uint32_t sh_type = *(uint32_t*)(elf_data + sh_off + 4);
    if (sh_type == 2) { /* SHT_SYMTAB */
      symtab_off = *(uint32_t*)(elf_data + sh_off + 16);
      symtab_size = *(uint32_t*)(elf_data + sh_off + 20);
      uint32_t str_idx = *(uint32_t*)(elf_data + sh_off + 24);
      uint32_t str_sh_off = e_shoff + str_idx * e_shentsize;
      if (str_sh_off + 40 <= elf_len) {
        strtab_off = *(uint32_t*)(elf_data + str_sh_off + 16);
      }
      break;
    }
  }

  if (!symtab_off || !strtab_off) {
    return 0;
  }

  /* Iterate symbol table entries (Elf32_Sym = 16 bytes) */
  int n_syms = symtab_size / 16;
  int want_len = strlen(sym_name);
  for (int si = 0; si < n_syms; si++) {
    uint32_t sym_off = symtab_off + si * 16;
    if (sym_off + 16 > elf_len) break;
    uint32_t st_name = *(uint32_t*)(elf_data + sym_off);
    uint32_t st_value = *(uint32_t*)(elf_data + sym_off + 4);
    if (st_name == 0 || st_value == 0) continue;
    if (st_name + want_len >= elf_len) continue;
    if (strtab_off + st_name + want_len >= elf_len) continue;
    if (memcmp(elf_data + strtab_off + st_name, sym_name, want_len + 1) == 0) {
      return st_value;
    }
  }
  return 0;
}

