Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
static uint32_t mofei_resolve_elf_function_end(const uint8_t* elf_data, gsize elf_len, const char* sym_name) {
  const MofeiFirmwareSymbol* sidecar_symbol = mofei_find_firmware_symbol(sym_name);
  if (sidecar_symbol) {
    if (sidecar_symbol->size > 0) {
      return sidecar_symbol->address + sidecar_symbol->size;
    }

    uint32_t nearest_next = 0;
    for (guint i = 0; i < mofei_firmware_symbols->len; i++) {
      const MofeiFirmwareSymbol* candidate = &g_array_index(mofei_firmware_symbols, MofeiFirmwareSymbol, i);
      if (!mofei_symbol_type_is_function(candidate->type)) continue;
      if (candidate->address <= sidecar_symbol->address) continue;
      if (!nearest_next || candidate->address < nearest_next) {
        nearest_next = candidate->address;
      }
    }
    return nearest_next;
  }

  if (!elf_data || elf_len < 52 || memcmp(elf_data, ELFMAG, 4) != 0) {
    return 0;
  }

  uint32_t e_shoff = *(uint32_t*)(elf_data + 32);
  uint16_t e_shentsize = *(uint16_t*)(elf_data + 46);
  uint16_t e_shnum = *(uint16_t*)(elf_data + 48);

  uint32_t symtab_off = 0, symtab_size = 0, strtab_off = 0;
  for (int si = 0; si < e_shnum; si++) {
    uint32_t sh_off = e_shoff + si * e_shentsize;
    if (sh_off + 40 > elf_len) break;
    uint32_t sh_type = *(uint32_t*)(elf_data + sh_off + 4);
    if (sh_type == 2) { /* SHT_SYMTAB */
      symtab_off = *(uint32_t*)(elf_data + sh_off + 16);
      symtab_size = *(uint32_t*)(elf_data + sh_off + 20);
      uint32_t str_idx = *(uint32_t*)(elf_data + sh_off + 24);
      uint32_t str_sh_off = e_shoff + str_idx * e_shentsize;
      if (str_sh_off + 40 <= elf_len) {
        strtab_off = *(uint32_t*)(elf_data + str_sh_off + 16);
      }
      break;
    }
  }

  if (!symtab_off || !strtab_off) {
    return 0;
  }

  int n_syms = symtab_size / 16;
  int want_len = strlen(sym_name);
  uint32_t fn_start = 0;
  uint32_t fn_end = 0;

  for (int si = 0; si < n_syms; si++) {
    uint32_t sym_off = symtab_off + si * 16;
    if (sym_off + 16 > elf_len) break;
    uint32_t st_name = *(uint32_t*)(elf_data + sym_off);
    uint32_t st_value = *(uint32_t*)(elf_data + sym_off + 4);
    uint32_t st_size = *(uint32_t*)(elf_data + sym_off + 8);
    if (st_name == 0 || st_value == 0) continue;
    if (strtab_off + st_name + want_len >= elf_len) continue;
    if (memcmp(elf_data + strtab_off + st_name, sym_name, want_len + 1) == 0) {
      fn_start = st_value;
      if (st_size > 0) {
        fn_end = st_value + st_size;
      }
      break;
    }
  }

  if (!fn_start) {
    return 0;
  }
  if (fn_end > fn_start) {
    return fn_end;
  }

  uint32_t nearest_next = 0;
  for (int si = 0; si < n_syms; si++) {
    uint32_t sym_off = symtab_off + si * 16;
    if (sym_off + 16 > elf_len) break;
    uint32_t st_value = *(uint32_t*)(elf_data + sym_off + 4);
    uint8_t st_info = *(uint8_t*)(elf_data + sym_off + 12);
    if ((st_info & 0x0f) != 2) continue; /* STT_FUNC */
    if (st_value <= fn_start) continue;
    if (!nearest_next || st_value < nearest_next) {
      nearest_next = st_value;
    }
  }

  return nearest_next;
}

static uint32_t mofei_find_last_retw_in_elf_span(const uint8_t* elf_data, gsize elf_len, uint32_t fn_start,
                                                 uint32_t fn_end, uint32_t max_scan_len) {
  if (!elf_data || elf_len < 52 || !fn_start || fn_end <= fn_start) {
    return 0;
  }

  uint16_t phnum = *(uint16_t*)(elf_data + 44);
  uint32_t phoff = *(uint32_t*)(elf_data + 28);
  for (int pi = 0; pi < phnum; pi++) {
    uint32_t ph_base = phoff + pi * 32;
    if (ph_base + 32 > elf_len) break;
    uint32_t p_type = *(uint32_t*)(elf_data + ph_base);
    uint32_t p_offset = *(uint32_t*)(elf_data + ph_base + 4);
    uint32_t p_vaddr = *(uint32_t*)(elf_data + ph_base + 8);
    uint32_t p_filesz = *(uint32_t*)(elf_data + ph_base + 16);
    if (p_type != 1) continue; /* PT_LOAD */
    if (fn_start < p_vaddr || fn_start >= p_vaddr + p_filesz) continue;

    uint32_t off_in_seg = fn_start - p_vaddr;
    uint32_t avail = p_filesz - off_in_seg;
    uint32_t fn_size = fn_end - fn_start;
    uint32_t scan_len = avail < fn_size ? avail : fn_size;
    if (max_scan_len > 0 && scan_len > max_scan_len) scan_len = max_scan_len;
    if (scan_len < 2) return 0;
    if ((uint64_t)p_offset + off_in_seg + scan_len > elf_len) return 0;

    uint8_t* code = (uint8_t*)elf_data + p_offset + off_in_seg;
    for (int j = (int)scan_len - 2; j >= 0; j--) {
      if (code[j] == 0x1D && code[j + 1] == 0xF0) {
        return fn_start + (uint32_t)j;
      }
    }
    return 0;
  }
  return 0;
}

static void mofei_cpu_resume_timer_cb(void* opaque) {
  Esp32s3SocState* ss = ESP32S3_SOC(opaque);
  CPUState* cpu0 = CPU(&ss->cpu[0]);
  if (cpu0->stopped) {
    cpu_resume(cpu0);
    fprintf(stderr, "[QEMU] CPU0 resumed via safety timer\n");
  }
}

static void esp32s3_machine_init(MachineState* machine) {
  /* Read Mofei sim config from environment variables */
  const char* env_ms = getenv("MOFEI_CPU1_DONE_MS");
  if (env_ms) {
    mofei_cpu1_sync.delay_ms = (int)strtoul(env_ms, NULL, 0);
  }

  fprintf(stderr, "[QEMU] esp32s3_machine_init\n");

  /* Resolve CPU1 synchronization symbols from the firmware ELF.
   * For flash boot, CPU1 is permanently halted so we must simulate
   * its handshake with CPU0 by writing to the BSS bools that the
   * ESP-IDF boot code spins on.  We resolve the addresses from the
   * ELF .symtab so they stay correct across firmware rebuilds. */
  {
    const char* elf_path = mofei_resolve_firmware_kernel_path();
    mofei_sim_select_board(elf_path);
    mofei_load_firmware_symbols();
    fprintf(stderr, "[QEMU-SIM] selected simulator board: %s\n", mofei_sim_board_name());
    gsize elf_len = 0;
    guint8* elf_data = NULL;
    if (g_file_get_contents(elf_path, (gchar**)&elf_data, &elf_len, NULL) && elf_data && elf_len >= 52) {
      /* The Xtensa toolchain may produce big-endian ELF containers.
       * Our resolver expects LE, so detect and byte-swap the header
       * fields if needed (same logic as the ELF boot path below). */
      bool elf_is_be = (elf_data[5] == ELFDATA2MSB);
      if (elf_is_be) {
        uint16_t* h16;
        uint32_t* h32;
        h16 = (uint16_t*)(elf_data + 16);
        *h16 = __builtin_bswap16(*h16);
        h16 = (uint16_t*)(elf_data + 18);
        *h16 = __builtin_bswap16(*h16);
        h32 = (uint32_t*)(elf_data + 20);
        *h32 = __builtin_bswap32(*h32);
        h32 = (uint32_t*)(elf_data + 24);
        *h32 = __builtin_bswap32(*h32);
        h32 = (uint32_t*)(elf_data + 28);
        *h32 = __builtin_bswap32(*h32);
        h32 = (uint32_t*)(elf_data + 32);
        *h32 = __builtin_bswap32(*h32);
        h32 = (uint32_t*)(elf_data + 36);
        *h32 = __builtin_bswap32(*h32);
        h16 = (uint16_t*)(elf_data + 40);
        *h16 = __builtin_bswap16(*h16);
        h16 = (uint16_t*)(elf_data + 42);
        *h16 = __builtin_bswap16(*h16);
        h16 = (uint16_t*)(elf_data + 44);
        *h16 = __builtin_bswap16(*h16);
        h16 = (uint16_t*)(elf_data + 46);
        *h16 = __builtin_bswap16(*h16);
        h16 = (uint16_t*)(elf_data + 48);
        *h16 = __builtin_bswap16(*h16);
        h16 = (uint16_t*)(elf_data + 50);
        *h16 = __builtin_bswap16(*h16);
        /* Byte-swap program headers */
        uint16_t phnum = *(uint16_t*)(elf_data + 44);
        uint32_t phoff = *(uint32_t*)(elf_data + 28);
        for (int i = 0; i < phnum && phoff + (uint32_t)(i + 1) * 32 <= elf_len; i++) {
          uint32_t* ph = (uint32_t*)(elf_data + phoff + i * 32);
          for (int w = 0; w < 8; w++) {
            ph[w] = __builtin_bswap32(ph[w]);
          }
        }
        /* Byte-swap section headers for our resolver */
        uint32_t e_shoff = *(uint32_t*)(elf_data + 32);
        uint16_t e_shentsize = *(uint16_t*)(elf_data + 46);
        uint16_t e_shnum_val = *(uint16_t*)(elf_data + 48);
        for (int si = 0; si < e_shnum_val; si++) {
          uint32_t sh_off = e_shoff + si * e_shentsize;
          if (sh_off + 40 > elf_len) break;
          uint32_t* sh = (uint32_t*)(elf_data + sh_off);
          for (int w = 0; w < 10; w++) {
            sh[w] = __builtin_bswap32(sh[w]);
          }
        }
      }

      /* s_cpu_up is a volatile bool[2]; we need s_cpu_up[1] */
      uint32_t base = mofei_resolve_elf_symbol(elf_data, elf_len, "s_cpu_up");
      if (base) {
        mofei_cpu1_sync.s_cpu_up_1 = base + 1; /* [1] is one byte after [0] */
        mofei_sim_addrs.s_cpu_up_1_addr = mofei_cpu1_sync.s_cpu_up_1;
        fprintf(stderr, "[QEMU-DBG] Resolved s_cpu_up @ 0x%x → [1] at 0x%x\n", base, mofei_cpu1_sync.s_cpu_up_1);
      }

