Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
      /* s_cpu_inited is a volatile bool[2]; we need s_cpu_inited[1] */
      base = mofei_resolve_elf_symbol(elf_data, elf_len, "s_cpu_inited");
      if (base) {
        mofei_cpu1_sync.s_cpu_inited_1 = base + 1;
        mofei_sim_addrs.s_cpu_inited_1_addr = mofei_cpu1_sync.s_cpu_inited_1;
        fprintf(stderr, "[QEMU-DBG] Resolved s_cpu_inited @ 0x%x → [1] at 0x%x\n", base,
                mofei_cpu1_sync.s_cpu_inited_1);
      }

      base = mofei_resolve_elf_symbol(elf_data, elf_len, "s_system_inited");
      if (base) {
        mofei_cpu1_sync.s_system_inited_1 = base + 1;
        mofei_sim_addrs.s_system_inited_1_addr = mofei_cpu1_sync.s_system_inited_1;
        fprintf(stderr, "[QEMU-DBG] Resolved s_system_inited @ 0x%x → [1] at 0x%x\n", base,
                mofei_cpu1_sync.s_system_inited_1);
      }

      base = mofei_resolve_elf_symbol(elf_data, elf_len, "s_system_full_inited");
      if (base) {
        mofei_cpu1_sync.s_system_full_inited = base;
        mofei_sim_addrs.s_system_full_inited_addr = mofei_cpu1_sync.s_system_full_inited;
        fprintf(stderr, "[QEMU-DBG] Resolved s_system_full_inited @ 0x%x\n", base);
      }

      /* Patch adc_hal_self_calibration to return 0 immediately.
       * The function reads eFuse calibration data which is not emulated
       * in QEMU, causing an infinite loop in read_cal_channel.
       * Patch: entry a1, 0; movi.n a2, 0; retw.n — replaces the function body
       * with an immediate return of 0 (no calibration data). */
      base = mofei_resolve_elf_symbol(elf_data, elf_len, "adc_hal_self_calibration");
      if (base && mofei_cpu1_sync.adc_patch_count < 16) {
        mofei_cpu1_sync.adc_patch_fns[mofei_cpu1_sync.adc_patch_count++] = base;
        fprintf(stderr, "[QEMU-DBG] Resolved adc_hal_self_calibration @ 0x%x\n", base);
      }

      /* Also resolve ADC calibration functions for patching.
       * These functions read eFuse calibration data which is not emulated
       * in QEMU, causing infinite loops.
       * Only patch functions that are called via standard callN instructions.
       * read_cal_channel is the key function that loops on eFuse reads;
       * patching it allows the other ADC functions to run without looping. */
      {
        const char* adc_syms[] = {
            "read_cal_channel",
            "adc_hal_self_calibration",
        };
        for (int i = 0; i < (int)(sizeof(adc_syms) / sizeof(adc_syms[0])); i++) {
          base = mofei_resolve_elf_symbol(elf_data, elf_len, adc_syms[i]);
          if (base && mofei_cpu1_sync.adc_patch_count < 16) {
            mofei_cpu1_sync.adc_patch_fns[mofei_cpu1_sync.adc_patch_count++] = base;
            fprintf(stderr, "[QEMU-DBG] Resolved %s @ 0x%x\n", adc_syms[i], base);
          }
        }
      }

      /* Resolve simulator intercept addresses from the firmware ELF.
       * These are used by translate.c and exc_helper.c to dynamically
       * intercept firmware functions without hardcoding PC addresses. */
      {
        MofeiSimAddrs* a = &mofei_sim_addrs;
        memset(a, 0, sizeof(*a));

        struct {
          const char* name;
          uint32_t* out;
        } syms[] = {
            /* Core firmware functions */
            {"_Z5setupv", &a->setup_addr},
            {"_Z20setupDisplayAndFontsv", &a->setupDisplayAndFonts_addr},
            {"_Z4loopv", &a->loop_addr},
            {"app_main", &a->app_main_addr},
            {"murphySimulatorMain", &a->murphySimulatorMain_addr},
            {"murphySimulatorEnterRunLoop", &a->murphySimulatorEnterRunLoop_addr},
            {"_ZN8murphyos11DeviceShell18startSimulatorLoopERKNS0_7ContextE",
             &a->murphyDeviceShellStartSimulatorLoop_addr},
            {"_ZN8murphyos11DeviceShell16runSimulatorLoopERKNS0_7ContextE",
             &a->murphyDeviceShellRunSimulatorLoopContext_addr},
            {"_ZN8murphyos11DeviceShell16runSimulatorLoopEv", &a->murphyDeviceShellRunSimulatorLoopMethod_addr},
            {"_ZN8murphyos11DeviceShell27runSimulatorLoopWithContextERKNS0_7ContextE",
             &a->murphyDeviceShellRunSimulatorLoopWithContext_addr},
            {"murphyDeviceShellRunSimulatorLoop", &a->murphyDeviceShellRunSimulatorLoop_addr},
            {"_Z8loopTaskPv", &a->loopTask_addr},
            {"start_cpu0", &a->start_cpu0_addr},
            {"xTaskCreateUniversal", &a->xTaskCreateUniversal_addr},
            {"esp_cache_msync", &a->esp_cache_msync_addr},
            {"setjmp", &a->setjmp_addr},
            {"gfxSimulatorPublishFrameBuffer", &a->gfxSimulatorPublishFrameBuffer_addr},
            {"mofeiSimulatorPublishFramebuffer", &a->mofeiSimulatorPublishFramebuffer_addr},
            {"murphySimulatorBootFirstFrame", &a->murphySimulatorBootFirstFrame_addr},
            {"murphySimulatorPublishFramebuffer", &a->murphySimulatorPublishFramebuffer_addr},
            {"murphySimulatorTraceActivity", &a->murphySimulatorTraceActivity_addr},
            {"murphySimulatorHooksEnabled", &a->murphySimulatorHooksEnabled_addr},
            /* ActivityManager */
            {"_ZN15ActivityManager8goToBootEv", &a->goToBoot_addr},
            {"_ZN15ActivityManager6goHomeEv", &a->goHome_addr},
            {"_ZN15ActivityManager5beginEv", &a->activityManager_begin_addr},
            {"activityManager", &a->activityManager_addr},
            {"_ZZL19runMurphyDeviceMainvE5shell", &a->murphyDeviceShell_addr},
            {"_ZZL19runMurphyDeviceMainvE6runner", &a->murphyDeviceRunner_addr},
            {"_ZZL19runMurphyDeviceMainvE2fb", &a->murphyDeviceFramebuffer_addr},
            {"_ZZL19runMurphyDeviceMainvE7display", &a->murphyDeviceDisplay_addr},
            {"_ZZL19runMurphyDeviceMainvE10sleepInput", &a->murphyDeviceSleepInput_addr},
            {"_ZZL19runMurphyDeviceMainvE5power", &a->murphyDevicePower_addr},
            {"_ZZL19runMurphyDeviceMainvE10frontlight", &a->murphyDeviceFrontlight_addr},
            {"_ZZL19runMurphyDeviceMainvE7storage", &a->murphyDeviceStorage_addr},
            {"_ZZL19runMurphyDeviceMainvE9castStore", &a->murphyDeviceCastStore_addr},
            {"_ZZL19runMurphyDeviceMainvE5input", &a->murphyDeviceInput_addr},
            {"_ZZL19runMurphyDeviceMainvE11mappedInput", &a->murphyDeviceMappedInput_addr},
            {"_ZZL19runMurphyDeviceMainvE10debugInput", &a->murphyDeviceDebugInput_addr},
            {"_ZZL19runMurphyDeviceMainvE11remoteInput", &a->murphyDeviceRemoteInput_addr},
            {"_ZZL19runMurphyDeviceMainvE6window", &a->murphyDeviceWindow_addr},
            {"_ZN12_GLOBAL__N_1L5nowMsEv", &a->murphyDeviceNowMs_addr},
            {"_ZTVN8murphyos8InputEspE", &a->murphyInputEspVtable_addr},
            {"_ZTVN8murphyos13PortraitInputE", &a->murphyPortraitInputVtable_addr},
            {"_ZTVN8murphyos14SleepHoldInputE", &a->murphySleepHoldInputVtable_addr},
            {"_ZTVN8murphyos11RemoteInputE", &a->murphyRemoteInputVtable_addr},
            {"_ZTVN8murphyos14SyntheticInputE", &a->murphySyntheticInputVtable_addr},
            {"murphySimulatorShellContext", &a->murphySimulatorShellContext_addr},
            {"murphySimulatorRunner", &a->murphySimulatorRunner_addr},
            {"murphySimulatorFramebufferObject", &a->murphySimulatorFramebufferObject_addr},
            {"murphySimulatorDisplay", &a->murphySimulatorDisplay_addr},
            {"murphySimulatorSleepInput", &a->murphySimulatorSleepInput_addr},
            {"murphySimulatorPower", &a->murphySimulatorPower_addr},
            {"murphySimulatorFrontlight", &a->murphySimulatorFrontlight_addr},
            {"murphySimulatorStorage", &a->murphySimulatorStorage_addr},
            {"murphySimulatorUiFont", &a->murphySimulatorUiFont_addr},
            {"murphySimulatorBodyFont", &a->murphySimulatorBodyFont_addr},
            {"murphySimulatorCastStore", &a->murphySimulatorCastStore_addr},
            {"murphySimulatorRunnerInput", &a->murphySimulatorRunnerInput_addr},
            {"murphySimulatorRunnerWindow", &a->murphySimulatorRunnerWindow_addr},
            {"murphySimulatorRunnerNowMs", &a->murphySimulatorRunnerNowMs_addr},
            /* Display */
            {"display", &a->display_addr},
            {"renderer", &a->renderer_addr},
            {"simulatorFrameBuffer", &a->gfxSimulatorFrameBuffer_addr},
            {"murphySimulatorFramebuffer", &a->murphySimulatorFramebuffer_addr},
            {"murphySimulatorFramebufferStorage", &a->murphySimulatorFramebufferStorage_addr},
            /* SPI / MofeiDisplay */
            {"_ZN8SPIClass16beginTransactionE11SPISettings", &a->spi_beginTransaction_addr},
            {"_ZN8SPIClass14endTransactionEv", &a->spi_endTransaction_addr},
            {"_ZN8SPIClass8transferEh", &a->spi_transfer_addr},
            {"_ZN8SPIClass10writeBytesEPKhm", &a->spi_writeBytes_addr},
            {"_ZNK12MofeiDisplay11sendCommandEh", &a->sendCommand_addr},
            {"_ZNK12MofeiDisplay8sendDataEh", &a->sendData_byte_addr},
            {"_ZNK12MofeiDisplay8sendDataEPKhm", &a->sendData_buf_addr},
            {"_ZN8murphyos9EpdBusEsp12writeCommandEh", &a->epdBusWriteCommand_addr},
            {"_ZN8murphyos9EpdBusEsp9writeDataEPKhj", &a->epdBusWriteData_addr},
            {"_ZN8murphyos9EpdBusEsp8waitBusyEv", &a->epdBusWaitBusy_addr},
            {"_ZN12MofeiDisplay25resetDisplayUpdateControlEv", &mofei_sim_reset_display_update_control_addr},
            {"_ZN12MofeiDisplay12writeLutFullEv", &mofei_display_writeLutFull_addr},
            {"_ZN12MofeiDisplay12writeLutFastEv", &mofei_display_writeLutFast_addr},
            {"_ZN12MofeiDisplay10writeLutDuEv", &mofei_display_writeLutDu_addr},
            /* Skip/intercept */
            {"addApbChangeCallback", &a->addApbChangeCallback_addr},
            {"removeApbChangeCallback", &a->removeApbChangeCallback_addr},
            {"getApbFrequency", &a->getApbFrequency_addr},
            {"gpio_config", &a->gpio_config_addr},
            {"gpio_set_level", &a->gpio_set_level_addr},
            {"gpio_get_level", &a->gpio_get_level_addr},
            {"__pinMode", &a->pinMode_addr},
            {"__digitalWrite", &a->digitalWrite_addr},
            {"__digitalRead", &a->digitalRead_addr},
            {"pvPortMalloc", &a->pvPortMalloc_addr},
            {"__wrap_malloc", &mofei_sim_wrap_malloc_addr},
            {"heap_caps_malloc", &a->heap_caps_malloc_addr},
            {"heap_caps_malloc_base", &a->heap_caps_malloc_base_addr},
            {"heap_caps_malloc_default", &a->heap_caps_malloc_default_addr},
            {"heap_caps_malloc_prefer", &a->heap_caps_malloc_prefer_addr},
            {"malloc", &a->malloc_addr},
            {"calloc", &a->calloc_addr},
            {"realloc", &a->realloc_addr},
            {"_malloc_r", &a->malloc_r_addr},
            {"_calloc_r", &a->calloc_r_addr},
            {"_realloc_r", &a->realloc_r_addr},
            {"_Znwj", &a->operator_new_addr},
            {"_Znaj", &a->operator_new_array_addr},
            /* ROM/RTOS */
            {"vTaskStartScheduler", &a->vTaskStartScheduler_addr},
            {"__assert_func", &a->__assert_func_addr},
            {"xTaskCreatePinnedToCore", &a->xTaskCreatePinnedToCore_addr},
            /* Partition/OTA */
            {"esp_partition_find", &a->esp_partition_find_addr},
            {"esp_partition_next", &a->esp_partition_next_addr},
            {"esp_partition_find_first", &a->esp_partition_find_first_addr},
            {"esp_partition_verify", &a->esp_partition_verify_addr},
            {"esp_timer_get_time", &a->esp_timer_get_time_addr},
            {"systimer_hal_get_counter_value", &a->systimer_hal_get_counter_value_addr},
            {"esp_ota_get_running_partition", &a->esp_ota_get_running_partition_addr},
            {"esp_ota_get_next_update_partition", &a->esp_ota_get_next_update_partition_addr},
            {"__atomic_s32c1i_exchange_1", &a->atomic_s32c1i_exchange_1_addr},
            {"__atomic_fetch_add_2", &a->atomic_fetch_add_2_addr},
            {"__atomic_fetch_add_4", &a->atomic_fetch_add_4_addr},
            {"__atomic_s32c1i_compare_exchange_1", &a->atomic_s32c1i_compare_exchange_1_addr},
            {"__atomic_s32c1i_compare_exchange_4", &a->atomic_s32c1i_compare_exchange_4_addr},
            {"__atomic_compare_exchange_4", &a->atomic_compare_exchange_4_addr},
            /* NVS */
            {"nvs_flash_init", &a->nvs_flash_init_addr},
            {"nvs_flash_init_partition", &a->nvs_flash_init_partition_addr},
            {"nvs_open", &a->nvs_open_addr},
            {"nvs_open_from_partition", &a->nvs_open_from_partition_addr},
            {"nvs_get_blob", &a->nvs_get_blob_addr},
            {"nvs_get_i8", &a->nvs_get_i8_addr},
            {"nvs_get_u8", &a->nvs_get_u8_addr},
            {"nvs_get_u16", &a->nvs_get_u16_addr},
            {"nvs_get_u32", &a->nvs_get_u32_addr},
            {"nvs_set_blob", &a->nvs_set_blob_addr},
            {"nvs_set_i8", &a->nvs_set_i8_addr},
            {"nvs_set_u8", &a->nvs_set_u8_addr},
            {"nvs_set_u16", &a->nvs_set_u16_addr},
            {"nvs_set_u32", &a->nvs_set_u32_addr},
            /* OTA */
            {"esp_ota_get_app_partition_count", &a->esp_ota_get_app_partition_count_addr},
            {"esp_ota_begin", &a->esp_ota_begin_addr},
            {"esp_ota_end", &a->esp_ota_end_addr},
            {"esp_ota_write", &a->esp_ota_write_addr},
            /* Heap */
            {"heap_caps_calloc", &a->heap_caps_calloc_addr},
            {"heap_caps_calloc_base", &a->heap_caps_calloc_base_addr},
            {"heap_caps_calloc_prefer", &a->heap_caps_calloc_prefer_addr},
            {"heap_caps_realloc", &a->heap_caps_realloc_addr},
            {"heap_caps_realloc_base", &a->heap_caps_realloc_base_addr},
            {"heap_caps_realloc_default", &a->heap_caps_realloc_default_addr},
            {"heap_caps_realloc_prefer", &a->heap_caps_realloc_prefer_addr},
            {"heap_caps_get_free_size", &a->heap_caps_get_free_size_addr},
            {"heap_caps_get_largest_free_block", &a->heap_caps_get_largest_free_block_addr},
            {"heap_caps_get_total_size", &a->heap_caps_get_total_size_addr},
            {"heap_caps_get_allocated_size", &a->heap_caps_get_allocated_size_addr},
            {"_ZN8EspClass12getPsramSizeEv", &a->esp_get_psram_size_addr},
            {"_ZN8EspClass12getFreePsramEv", &a->esp_get_free_psram_addr},
            {"_ZN8EspClass16getMaxAllocPsramEv", &a->esp_get_max_alloc_psram_addr},
            /* Queue/RTOS */
            {"xQueueGenericSend", &a->xQueueGenericSend_addr},
            {"xQueueSemaphoreTake", &a->xQueueSemaphoreTake_addr},
            {"xQueueGiveMutexRecursive", &a->xQueueGiveMutexRecursive_addr},
            {"xQueueReceive", &a->xQueueReceive_addr},
            {"xQueueTakeMutexRecursive", &a->xQueueTakeMutexRecursive_addr},
            {"xQueueGenericCreate", &a->xQueueGenericCreate_addr},
            {"xQueueCreateMutex", &a->xQueueCreateMutex_addr},
            {"xQueueCreateWithCaps", &a->xQueueCreateWithCaps_addr},
            {"xSemaphoreCreateGenericWithCaps", &a->xSemaphoreCreateGenericWithCaps_addr},
            {"vPortYield", &a->vPortYield_addr},
            {"i2c_master_transmit", &a->i2c_master_transmit_addr},
            {"i2c_master_receive", &a->i2c_master_receive_addr},
            {"i2c_master_transmit_receive", &a->i2c_master_transmit_receive_addr},
            {"i2c_master_multi_buffer_transmit", &a->i2c_master_multi_buffer_transmit_addr},
            {"esp_intr_alloc", &a->esp_intr_alloc_addr},
            {"esp_intr_alloc_intrstatus", &a->esp_intr_alloc_intrstatus_addr},
            {"esp_intr_enable", &a->esp_intr_enable_addr},
            {"esp_intr_disable", &a->esp_intr_disable_addr},
            {"esp_intr_free", &a->esp_intr_free_addr},
            {"spi_device_polling_transmit", &a->spi_device_polling_transmit_addr},
            {"spi_device_transmit", &a->spi_device_transmit_addr},
            {"sdmmc_host_wait_for_event", &a->sdmmc_host_wait_for_event_addr},
            /* Log */
            {"_Z9logPrintfPKcS0_S0_z", &a->logPrintf_addr},
            {"__wrap_log_printf", &a->wrap_log_printf_addr},
            {"log_printf", &a->log_printf_addr},
            {"log_printfv", &a->log_printfv_addr},
            {"esp_log", &a->esp_log_addr},
            {"esp_log_va", &a->esp_log_va_addr},
            {"esp_log_write", &a->esp_log_write_addr},
            {"esp_log_writev", &a->esp_log_writev_addr},
            {"esp_log_impl_lock", &a->esp_log_impl_lock_addr},
            {"esp_log_impl_unlock", &a->esp_log_impl_unlock_addr},
            {"__env_lock", &a->__env_lock_addr},
            {"__env_unlock", &a->__env_unlock_addr},
            /* Pthread TLS used by libstdc++ C++ exception globals */
            {"pthread_key_create", &a->pthread_key_create_addr},
            {"pthread_getspecific", &a->pthread_getspecific_addr},
            {"pthread_setspecific", &a->pthread_setspecific_addr},
            {"__esp_system_init_fn_mbedtls_psa_crypto_init_fn", &a->esp_system_init_mbedtls_psa_crypto_addr},
            /* Sleep functions to skip in simulator (GPIO not emulated) */
            {"_Z14enterDeepSleepv", &a->enterDeepSleep_addr},
            {"_Z19enterAutoLightSleepv", &a->enterAutoLightSleep_addr},
            {"_Z23mofeiSimulatorTouchReadPtS_PhS0_", &a->mofeiSimulatorTouchRead_addr},
            {"mofeiSimulatorButtonRead", &a->mofeiSimulatorButtonRead_addr},
            {"mofeiSimulatorTraceFileBrowserDirectory", &a->mofeiSimulatorTraceFileBrowserDirectory_addr},
            {"mofeiSimulatorTraceRpipe", &a->mofeiSimulatorTraceRpipe_addr},
            {"mofeiSimulatorTraceOpdsFetch", &a->mofeiSimulatorTraceOpdsFetch_addr},
            {"mofeiSimulatorTraceOpdsSearch", &a->mofeiSimulatorTraceOpdsSearch_addr},
            {"g_mofeiSimButtonBits", &a->g_mofeiSimButtonBits_addr},
            {"g_mofeiSimButtonPressedEvents", &a->g_mofeiSimButtonPressedEvents_addr},
            {"g_mofeiSimButtonReleasedEvents", &a->g_mofeiSimButtonReleasedEvents_addr},
            {"g_mofeiSimTouchEventPending", &a->g_mofeiSimTouchEventPending_addr},
            {"g_mofeiSimTouchEventType", &a->g_mofeiSimTouchEventType_addr},
            {"g_mofeiSimTouchEventX", &a->g_mofeiSimTouchEventX_addr},
            {"g_mofeiSimTouchEventY", &a->g_mofeiSimTouchEventY_addr},
            {"g_mofeiSimConsolePending", &a->g_mofeiSimConsolePending_addr},
            {"g_mofeiSimConsoleLength", &a->g_mofeiSimConsoleLength_addr},
            {"g_mofeiSimConsoleBuffer", &a->g_mofeiSimConsoleBuffer_addr},
            {"g_mofeiSimPandaDebugRequestPending", &a->g_mofeiSimPandaDebugRequestPending_addr},
            {"g_mofeiSimPandaDebugRequestLength", &a->g_mofeiSimPandaDebugRequestLength_addr},
            {"g_mofeiSimPandaDebugRequestBuffer", &a->g_mofeiSimPandaDebugRequestBuffer_addr},
            {"g_mofeiSimPandaDebugResponsePending", &a->g_mofeiSimPandaDebugResponsePending_addr},
            {"g_mofeiSimPandaDebugResponseLength", &a->g_mofeiSimPandaDebugResponseLength_addr},
            {"g_mofeiSimPandaDebugResponseBuffer", &a->g_mofeiSimPandaDebugResponseBuffer_addr},
            {"mofeiSimulatorPandaDebugMailboxCapacity", &a->mofeiSimulatorPandaDebugMailboxCapacity_addr},
            {"mofeiSimulatorPandaDebugReset", &a->mofeiSimulatorPandaDebugReset_addr},
            {"mofeiSimulatorPandaDebugPump", &a->mofeiSimulatorPandaDebugPump_addr},
            /* ADC calibration (skip at translate time) */
            {"read_cal_channel", &a->read_cal_channel_addr},
            {"adc_hal_set_controller", &a->adc_hal_set_controller_addr},
            {"adc_hal_self_calibration", &a->adc_hal_self_calibration_addr},
            {"adc_hal_calibration_init", &a->adc_hal_calibration_init_addr},
            {"adc_hal_set_calibration_param", &a->adc_hal_set_calibration_param_addr},
            {"esp_efuse_read_field_blob", &a->esp_efuse_read_field_blob_addr},
            {"esp_efuse_read_field_blob$part$0", &a->esp_efuse_read_field_blob_part_addr},
            /* Render/activity trace points for simulator diagnosis */
            {"_ZN17DashboardActivity6renderEO10RenderLock", &a->dashboardRender_addr},
            {"_ZN16SettingsActivity6renderEO10RenderLock", &a->settingsRender_addr},
            {"_ZN19ButtonRemapActivity6renderEO10RenderLock", &a->buttonRemapRender_addr},
            {"_ZN25DeviceDiagnosticsActivity6renderEO10RenderLock", &a->deviceDiagnosticsRender_addr},
            {"_ZN25StatusBarSettingsActivity6renderEO10RenderLock", &a->statusBarSettingsRender_addr},
            {"_ZN16CalendarActivity6renderEO10RenderLock", &a->calendarRender_addr},
            {"_ZN20WeatherClockActivity6renderEO10RenderLock", &a->weatherClockRender_addr},
            {"_ZN17ArcadeHubActivity6renderEO10RenderLock", &a->arcadeHubRender_addr},
            {"_ZN16Game2048Activity6renderEO10RenderLock", &a->game2048Render_addr},
            {"_ZN19RecentBooksActivity6renderEO10RenderLock", &a->recentBooksRender_addr},
            {"_ZN19FileBrowserActivity6renderEO10RenderLock", &a->fileBrowserRender_addr},
            {"_ZN15AppletsActivity6renderEO10RenderLock", &a->appletsRender_addr},
            {"_ZN14LuaAppActivity6renderEO10RenderLock", &a->luaAppRender_addr},
            {"_ZN18ReadingHubActivity6renderEO10RenderLock", &a->readingHubRender_addr},
            {"_ZN16StudyHubActivity6renderEO10RenderLock", &a->studyHubRender_addr},
            {"_ZN23StudyCardsTodayActivity6renderEO10RenderLock", &a->studyCardsTodayRender_addr},
            {"_ZN22OpdsServerListActivity6renderEO10RenderLock", &a->opdsServerListRender_addr},
            {"_ZN23OpdsBookBrowserActivity6renderEO10RenderLock", &a->opdsBookBrowserRender_addr},
            {"_ZN20OpdsSettingsActivity6renderEO10RenderLock", &a->opdsSettingsRender_addr},
            {"_ZN18DictionaryActivity6renderEO10RenderLock", &a->dictionaryRender_addr},
            {"_ZN21KeyboardEntryActivity6renderEO10RenderLock", &a->keyboardEntryRender_addr},
            {"_ZN34EpubReaderChapterSelectionActivity6renderEO10RenderLock", &a->epubChapterSelectRender_addr},
            {"_ZN34EpubReaderPercentSelectionActivity6renderEO10RenderLock", &a->epubPercentSelectionRender_addr},
            {"_ZN25EpubSearchResultsActivity6renderEO10RenderLock", &a->epubSearchResultsRender_addr},
            {"_ZN24TxtSearchResultsActivity6renderEO10RenderLock", &a->txtSearchResultsRender_addr},
            {"_ZN20TxtBookmarksActivity6renderEO10RenderLock", &a->txtBookmarksRender_addr},
            {"_ZN21EpubBookmarksActivity6renderEO10RenderLock", &a->epubBookmarksRender_addr},
            {"_ZN27EpubReaderFootnotesActivity6renderEO10RenderLock", &a->epubReaderFootnotesRender_addr},
            {"_ZN21TtfFontSelectActivity6renderEO10RenderLock", &a->ttfFontSelectRender_addr},
            {"_ZN22TimeZoneSelectActivity6renderEO10RenderLock", &a->timeZoneSelectRender_addr},
            {"_ZN31TraditionalChineseFontsActivity6renderEO10RenderLock", &a->traditionalChineseFontsRender_addr},
            {"_ZN22LanguageSelectActivity6renderEO10RenderLock", &a->languageSelectRender_addr},
            {"_ZN22SleepWallpaperActivity6renderEO10RenderLock", &a->sleepWallpaperRender_addr},
            {"_ZN33ReaderFrontlightSelectionActivity6renderEO10RenderLock", &a->readerFrontlightSelectionRender_addr},
            {"_ZN14ReaderActivity6renderEO10RenderLock", &a->readerRender_addr},
            {"_ZN18EpubReaderActivity6renderEO10RenderLock", &a->epubReaderRender_addr},
            {"_ZN17TxtReaderActivity6renderEO10RenderLock", &a->txtReaderRender_addr},
            {"_ZN17XtcReaderActivity6renderEO10RenderLock", &a->xtcReaderRender_addr},
            {"_ZTVN5panda3app9HomeSceneE", &a->murphyVtableHomeScene_addr},
            {"_ZTVN5panda3app13SettingsSceneE", &a->murphyVtableSettingsScene_addr},
            {"_ZTVN5panda3app18WifiSelectionSceneE", &a->murphyVtableWifiSelectionScene_addr},
