Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
            {"_ZTVN5panda3app16FileBrowserSceneE", &a->murphyVtableFileBrowserScene_addr},
            {"_ZTVN5panda3app12LibrarySceneE", &a->murphyVtableLibraryScene_addr},
            {"_ZTVN5panda3app16RecentBooksSceneE", &a->murphyVtableRecentBooksScene_addr},
            {"_ZTVN5panda3app14ArcadeHubSceneE", &a->murphyVtableArcadeHubScene_addr},
            {"_ZTVN5panda3app13Game2048SceneE", &a->murphyVtableGame2048Scene_addr},
            {"_ZTVN5panda3app12_GLOBAL__N_112WeatherSceneE", &a->murphyVtableWeatherScene_addr},
            {"_ZTVN5panda3app12_GLOBAL__N_113CalendarSceneE", &a->murphyVtableCalendarScene_addr},
            {"_ZTVN5panda3app5study13StudyHubSceneE", &a->murphyVtableStudyHubScene_addr},
            {"_ZTVN5panda3app5study12_GLOBAL__N_115CardsTodaySceneE", &a->murphyVtableCardsTodayScene_addr},
            {"_ZTVN5panda3app5study12_GLOBAL__N_114QueueListSceneE", &a->murphyVtableStudyQueueScene_addr},
            {"_ZTVN5panda3app5study12_GLOBAL__N_116ReviewQueueSceneE", &a->murphyVtableStudyReviewQueueScene_addr},
            {"_ZTVN5panda3app5study12_GLOBAL__N_117ImportStatusSceneE", &a->murphyVtableStudyImportStatusScene_addr},
            {"_ZTVN5panda3app5study12_GLOBAL__N_19QuizSceneE", &a->murphyVtableStudyQuizScene_addr},
            {"_ZTVN5panda3app5study12_GLOBAL__N_111ReportSceneE", &a->murphyVtableStudyReportScene_addr},
            {"_ZTVN5panda3app5study12_GLOBAL__N_113RecoverySceneE", &a->murphyVtableStudyRecoveryScene_addr},
            {"_ZTVN5panda2ui13KeyboardSceneE", &a->murphyVtableKeyboardScene_addr},
            {"_ZTVN5panda2ui17ConfirmationSceneE", &a->murphyVtableConfirmationScene_addr},
            {"_ZTVN5panda3app11ReaderSceneE", &a->murphyVtableReaderScene_addr},
            {"_ZTVN5panda3app10SleepSceneE", &a->murphyVtableSleepScene_addr},
            {"_ZTVN5panda3app13PandaHubSceneE", &a->murphyVtablePandaHubScene_addr},
            {"_ZTVN5panda3app16PandaLuaAppSceneE", &a->murphyVtablePandaLuaAppScene_addr},
            {"_ZTVN5panda3app16ButtonRemapSceneE", &a->murphyVtableButtonRemapScene_addr},
            {"_ZTVN5panda3app16DiagnosticsSceneE", &a->murphyVtableDiagnosticsScene_addr},
            {"_ZTVN5panda3app15FontPickerSceneE", &a->murphyVtableFontPickerScene_addr},
            {"_ZTVN5panda3app15EnumEditorSceneE", &a->murphyVtableEnumEditorScene_addr},
            {"_ZTVN5panda3app16ToggleGroupSceneE", &a->murphyVtableToggleGroupScene_addr},
            {"_ZTVN5panda3app18SearchResultsSceneE", &a->murphyVtableSearchResultsScene_addr},
            {"_ZTVN5panda3app17BookmarkListSceneE", &a->murphyVtableBookmarkListScene_addr},
            {"_ZTVN5panda3app16ChapterListSceneE", &a->murphyVtableChapterListScene_addr},
            {"_ZTVN5panda3app16PercentJumpSceneE", &a->murphyVtablePercentJumpScene_addr},
            {"_ZTVN5panda3app27ReaderDictionaryResultSceneE", &a->murphyVtableDictionaryScene_addr},
            {"_ZTVN5panda3app11SudokuSceneE", &a->murphyVtableSudokuScene_addr},
            {"_ZTVN5panda3app15VirtualPetSceneE", &a->murphyVtableVirtualPetScene_addr},
            {"_ZNK11GfxRenderer8fillRectEiiiib", &a->fillRect_addr},
            {"_ZNK11GfxRenderer13displayBufferEN10HalDisplay11RefreshModeE", &a->displayBuffer_addr},
            {"_ZN12_GLOBAL__N_137SimulatorActivityManagerRenderBackend27renderActivitySynchronouslyEP8Activity",
             &a->renderActivitySync_addr},
            {"_ZNK11GfxRenderer8drawLineEiiiib", &a->drawLine_addr},
            {"_ZN12_GLOBAL__N_116fillPhysicalRectEPhiiiib", &a->fillPhysicalRect_addr},
            /* EPUB open pipeline trace points for simulator E2E diagnosis */
            {"_ZN4Epub4loadEbb", &a->epubLoad_addr},
            {"_ZNK4Epub13setupCacheDirEv", &a->epubSetupCacheDir_addr},
            {"_ZN7ZipFile4openEv", &a->zipFileOpen_addr},
            {"_ZN17BookMetadataCache10beginWriteEv", &a->bmcBeginWrite_addr},
            {"_ZN17BookMetadataCache19beginContentOpfPassEv", &a->bmcBeginContentOpfPass_addr},
            {"_ZN4Epub15parseContentOpfERN17BookMetadataCache12BookMetadataEb", &a->epubParseContentOpf_addr},
            {"_ZNK4Epub18findContentOpfFileEPNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE",
             &a->epubFindContentOpfFile_addr},
            {"_ZNK4Epub24readItemContentsToStreamERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEER5Printj",
             &a->epubReadItemStream_addr},
            {"_ZNK4Epub28readItemContentsToUtf8StreamERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEER5Printj",
             &a->epubReadItemUtf8Stream_addr},
            {"_ZN7ZipFile16readFileToStreamEPKcR5Printj", &a->zipReadFileToStream_addr},
            {"_ZN16ContentOpfParser5writeEPKhj", &a->contentOpfWrite_addr},
            {"_ZN16ContentOpfParser5flushEv", &a->contentOpfFlush_addr},
            {"_ZN17BookMetadataCache16createSpineEntryESt17basic_string_viewIcSt11char_traitsIcEE",
             &a->bmcCreateSpineEntry_addr},
            {"_ZN17BookMetadataCache17endContentOpfPassEv", &a->bmcEndContentOpfPass_addr},
            {"_ZN4epub11expat_psram10xmlReallocEPvj", &a->expatPsramRealloc_addr},
            {"_ZN17BookMetadataCache12beginTocPassEv", &a->bmcBeginTocPass_addr},
            {"_ZN17BookMetadataCache8endWriteEv", &a->bmcEndWrite_addr},
            {"_ZN17BookMetadataCache12buildBookBinER7ZipFileRKNS_12BookMetadataE", &a->bmcBuildBookBin_addr},
            {"_ZNK17BookMetadataCache21cleanupBuildArtifactsEv", &a->bmcCleanupBuildArtifacts_addr},
        };

        int resolved_count = 0;
        for (int i = 0; i < (int)(sizeof(syms) / sizeof(syms[0])); i++) {
          uint32_t val = mofei_resolve_elf_symbol(elf_data, elf_len, syms[i].name);
          if (val) {
            *syms[i].out = val;
            resolved_count++;
            fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", syms[i].name, val);
          } else {
            fprintf(stderr, "[QEMU-SIM] WARNING: symbol not found: %s\n", syms[i].name);
          }
        }
        if (mofei_sim_board_is_s37uc()) {
          struct {
            const char* name;
            uint32_t* out;
          } s37uc_display_syms[] = {
              {"_ZNK13Uc8253Display11sendCommandEh", &a->sendCommand_addr},
              {"_ZNK13Uc8253Display8sendDataEh", &a->sendData_byte_addr},
              {"_ZNK13Uc8253Display8sendDataEPKhm", &a->sendData_buf_addr},
              {"_ZN13Uc8253Display10writeLut5sEv", &mofei_display_writeLutFull_addr},
              {"_ZN13Uc8253Display10writeLutGcEv", &mofei_display_writeLutFast_addr},
              {"_ZN13Uc8253Display10writeLutDuEv", &mofei_display_writeLutDu_addr},
          };
          for (int i = 0; i < (int)(sizeof(s37uc_display_syms) / sizeof(s37uc_display_syms[0])); i++) {
            if (*s37uc_display_syms[i].out) {
              continue;
            }
            uint32_t val = mofei_resolve_elf_symbol(elf_data, elf_len, s37uc_display_syms[i].name);
            if (val) {
              *s37uc_display_syms[i].out = val;
              resolved_count++;
              fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", s37uc_display_syms[i].name, val);
            } else {
              fprintf(stderr, "[QEMU-SIM] WARNING: symbol not found: %s\n", s37uc_display_syms[i].name);
            }
          }
        }
        a->memset_addr = MOFEI_ESP32S3_ROM_MEMSET_ADDR;
        a->memcpy_addr = MOFEI_ESP32S3_ROM_MEMCPY_ADDR;
        a->strcmp_addr = mofei_resolve_elf_symbol(elf_data, elf_len, "strcmp");
        if (!a->strcmp_addr) {
          a->strcmp_addr = MOFEI_ESP32S3_ROM_STRCMP_ADDR;
        }
        a->strlen_addr = mofei_resolve_elf_symbol(elf_data, elf_len, "strlen");
        if (!a->strlen_addr) {
          a->strlen_addr = MOFEI_ESP32S3_ROM_STRLEN_ADDR;
        }
        a->strdup_addr = mofei_resolve_elf_symbol(elf_data, elf_len, "strdup");
        a->cxa_guard_acquire_addr = mofei_resolve_elf_symbol(elf_data, elf_len, "__cxa_guard_acquire");
        a->cxa_guard_release_addr = mofei_resolve_elf_symbol(elf_data, elf_len, "__cxa_guard_release");
        a->heap_start_addr = mofei_resolve_elf_symbol(elf_data, elf_len, "_heap_start");
        if (!a->heap_start_addr) {
          a->heap_start_addr = mofei_resolve_elf_symbol(elf_data, elf_len, "_heap_low_start");
        }
        if (!a->heap_start_addr) {
          a->heap_start_addr = MOFEI_SIM_INTERNAL_HEAP_FALLBACK_BASE;
          fprintf(stderr, "[QEMU-SIM] WARNING: symbol not found: _heap_start/_heap_low_start; using 0x%08x\n",
                  a->heap_start_addr);
        }
        fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "ROM memset", a->memset_addr);
        fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "ROM memcpy", a->memcpy_addr);
        fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "libc/ROM strcmp", a->strcmp_addr);
        fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "libc/ROM strlen", a->strlen_addr);
        fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "__cxa_guard_acquire", a->cxa_guard_acquire_addr);
        fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "__cxa_guard_release", a->cxa_guard_release_addr);
        fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "linker heap start", a->heap_start_addr);
        if (a->strdup_addr) {
          fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "libc strdup", a->strdup_addr);
        } else {
          fprintf(stderr, "[QEMU-SIM] WARNING: symbol not found: strdup\n");
        }

        if (a->gfxSimulatorPublishFrameBuffer_addr) {
          a->gfxSimulatorPublishFrameBuffer_return =
              (a->gfxSimulatorPublishFrameBuffer_addr + MOFEI_GFX_SIMULATOR_PUBLISH_RETURN_OFFSET) |
              MOFEI_XTENSA_CALL8_RETURN_MARKER;
          fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "gfxSimulatorPublishFrameBuffer return",
                  a->gfxSimulatorPublishFrameBuffer_return);
        }
        if (a->mofeiSimulatorPublishFramebuffer_addr) {
          a->mofeiSimulatorPublishFramebuffer_retw =
              a->mofeiSimulatorPublishFramebuffer_addr + MOFEI_SIMULATOR_PUBLISH_RET_OFFSET;
          fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "mofeiSimulatorPublishFramebuffer RETW",
                  a->mofeiSimulatorPublishFramebuffer_retw);
        }
        if (a->murphySimulatorPublishFramebuffer_addr) {
          a->murphySimulatorPublishFramebuffer_retw =
              a->murphySimulatorPublishFramebuffer_addr + MOFEI_SIMULATOR_PUBLISH_RET_OFFSET;
          fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "murphySimulatorPublishFramebuffer RETW",
                  a->murphySimulatorPublishFramebuffer_retw);
        }
        {
          const char* run_device_main_sym = "_ZL19runMurphyDeviceMainv";
          const uint32_t fn_start = mofei_resolve_elf_symbol(elf_data, elf_len, run_device_main_sym);
          const uint32_t fn_end = mofei_resolve_elf_function_end(elf_data, elf_len, run_device_main_sym);
          if (fn_start && fn_end > fn_start) {
            const uint32_t scan_len = fn_end - fn_start;
            const uint32_t retw_pc = mofei_find_last_retw_in_elf_span(elf_data, elf_len, fn_start, fn_end, scan_len);
            if (retw_pc) {
              a->murphyRunDeviceMain_retw = retw_pc;
              fprintf(stderr, "[QEMU-SIM] Resolved %-45s → 0x%08x\n", "runMurphyDeviceMain final RETW", retw_pc);
            }
          }
          if (!a->murphyRunDeviceMain_retw) {
            fprintf(stderr, "[QEMU-SIM] WARNING: could not resolve runMurphyDeviceMain final RETW\n");
          }
        }
        if (a->murphySimulatorHooksEnabled_addr) {
          const uint8_t enabled = 1;
          if (address_space_write(&address_space_memory, a->murphySimulatorHooksEnabled_addr, MEMTXATTRS_UNSPECIFIED,
                                  &enabled, sizeof(enabled)) == MEMTX_OK) {
            fprintf(stderr, "[QEMU-SIM] Murphy OS simulator hooks enabled at 0x%08x\n",
                    a->murphySimulatorHooksEnabled_addr);
          }
        }

        /* Scan setupDisplayAndFonts for its RETW instruction.
         * The function has exactly one RETW (.n) near its end.
         * RETW.n encoding: 0x1D 0xF0 (narrow, 2 bytes)
         * Use the ELF function span so the scan cannot cross into the next
         * function when setup() is linked before setupDisplayAndFonts(). */
        if (a->setupDisplayAndFonts_addr) {
          uint32_t fn_start = a->setupDisplayAndFonts_addr;
          uint32_t fn_end = mofei_resolve_elf_function_end(elf_data, elf_len, "_Z20setupDisplayAndFontsv");
          if (fn_end <= fn_start) fn_end = fn_start + 2048;
          fprintf(stderr, "[QEMU-SIM] setupDisplayAndFonts span 0x%08x..0x%08x\n", fn_start, fn_end);

