Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
          uint32_t retw_pc = mofei_find_last_retw_in_elf_span(elf_data, elf_len, fn_start, fn_end, 2048);

          if (retw_pc) {
            a->setupDisplayAndFonts_retw = retw_pc;
            fprintf(stderr, "[QEMU-SIM] Resolved setupDisplayAndFonts RETW @ 0x%08x\n", retw_pc);
          } else {
            fprintf(stderr, "[QEMU-SIM] WARNING: could not find RETW in setupDisplayAndFonts\n");
          }
        }

        /* Mark as resolved if all critical symbols were found */
        a->resolved = (a->setup_addr && a->setupDisplayAndFonts_addr && a->setupDisplayAndFonts_retw && a->loop_addr &&
                       a->activityManager_addr);

        /* Pre-compute allocator RETW patch addresses for translate.c's RETW handler.
         * All these functions get their bodies patched at offset +3 with RETW
         * (the 'entry' instruction at offset 0 is preserved, RETW overwrites
         * offset 3-5).  So the RETW PC = function_addr + 3.
         * translate.c checks PC == function_addr + 3 to detect these patched RETWs.
         * Each entry also records which argument register contains the size. */
        {
          struct {
            const char* name;
            uint32_t addr;
          } alloc_fns[] = {
              {"pvPortMalloc", a->pvPortMalloc_addr},
              {"heap_caps_malloc", a->heap_caps_malloc_addr},
              {"heap_caps_malloc_base", a->heap_caps_malloc_base_addr},
              {"heap_caps_malloc_default", a->heap_caps_malloc_default_addr},
              {"heap_caps_malloc_prefer", a->heap_caps_malloc_prefer_addr},
              {"malloc", a->malloc_addr},
              {"_malloc_r", a->malloc_r_addr},
              {"_Znwj", a->operator_new_addr},
              {"_Znaj", a->operator_new_array_addr},
              {"calloc", a->calloc_addr},
              {"_calloc_r", a->calloc_r_addr},
              {"realloc", a->realloc_addr},
              {"_realloc_r", a->realloc_r_addr},
              {"heap_caps_calloc", a->heap_caps_calloc_addr},
              {"heap_caps_calloc_base", a->heap_caps_calloc_base_addr},
              {"heap_caps_calloc_prefer", a->heap_caps_calloc_prefer_addr},
              {"heap_caps_realloc", a->heap_caps_realloc_addr},
              {"heap_caps_realloc_base", a->heap_caps_realloc_base_addr},
              {"heap_caps_realloc_default", a->heap_caps_realloc_default_addr},
              {"heap_caps_realloc_prefer", a->heap_caps_realloc_prefer_addr},
              {"heap_caps_free", 0},
              {"vPortFree", 0},
              {"free", 0},
              {"_free_r", 0},
              {"multi_heap_free", 0},
              {"multi_heap_free_impl", 0},
              {"tlsf_free", 0},
          };
          for (int i = 0; i < (int)(sizeof(alloc_fns) / sizeof(alloc_fns[0])); i++) {
            mofei_add_alloc_patch(a, alloc_fns[i].addr, mofei_alloc_patch_spec_for_name(alloc_fns[i].name),
                                  alloc_fns[i].name);
          }
        }

        /* Pre-compute callN target addresses that return NULL.
         * These are used at call-translation time (not RETW time). */
        {
          uint32_t null_fns[] = {
              a->esp_partition_find_addr,
              a->esp_partition_next_addr,
              a->esp_partition_find_first_addr,
              a->esp_partition_verify_addr,
              a->esp_ota_get_running_partition_addr,
              a->esp_ota_get_next_update_partition_addr,
          };
          for (int i = 0; i < (int)(sizeof(null_fns) / sizeof(null_fns[0])); i++) {
            if (null_fns[i] && a->call_null_count < MOFEI_CALL_NULL_MAX) {
              a->call_null_addrs[a->call_null_count++] = null_fns[i];
            }
          }
        }

        /* Pre-compute callN target addresses that return ESP_FAIL */
        {
          uint32_t fail_fns[] = {
              a->nvs_flash_init_addr,
              a->nvs_flash_init_partition_addr,
              a->nvs_open_addr,
              a->nvs_open_from_partition_addr,
              a->nvs_get_blob_addr,
              a->nvs_get_i8_addr,
              a->nvs_get_u8_addr,
              a->nvs_get_u16_addr,
              a->nvs_get_u32_addr,
              a->nvs_set_blob_addr,
              a->nvs_set_i8_addr,
              a->nvs_set_u8_addr,
              a->nvs_set_u16_addr,
              a->nvs_set_u32_addr,
              a->esp_ota_get_app_partition_count_addr,
              a->esp_ota_begin_addr,
              a->esp_ota_end_addr,
              a->esp_ota_write_addr,
          };
          for (int i = 0; i < (int)(sizeof(fail_fns) / sizeof(fail_fns[0])); i++) {
            if (fail_fns[i] && a->call_fail_count < MOFEI_CALL_FAIL_MAX) {
              a->call_fail_addrs[a->call_fail_count++] = fail_fns[i];
            }
          }
        }

        fprintf(
            stderr,
            "[QEMU-SIM] Symbol resolution: %d/%d symbols, resolved=%s, alloc_patches=%d, call_null=%d, call_fail=%d\n",
            resolved_count, (int)(sizeof(syms) / sizeof(syms[0])), a->resolved ? "YES" : "NO (partial)",
            a->alloc_patch_count, a->call_null_count, a->call_fail_count);
      }

      g_free(elf_data);
    } else {
      fprintf(stderr,
              "[QEMU-DBG] WARNING: could not read firmware ELF '%s', "
              "CPU1 sync symbols not resolved\n",
              elf_path);
    }
  }

  DriveInfo* dinfo = drive_get(IF_MTD, 0, 0);
  BlockBackend* blk = NULL;
  if (dinfo) {
    /* MTD was given! We need to initialize and emulate SPI flash */
    qemu_log("Adding SPI flash device\n");
    blk = blk_by_legacy_dinfo(dinfo);
  } else {
    qemu_log("Not initializing SPI Flash\n");
  }
  DriveInfo* sd_dinfo = drive_get(IF_SD, 0, 0);
  BlockBackend* sd_blk = sd_dinfo != NULL ? blk_by_legacy_dinfo(sd_dinfo) : NULL;

  MemoryRegion* sys_mem = get_system_memory();
  Esp32s3MachineState* ms = ESP32S3_MACHINE(machine);
  object_initialize_child(OBJECT(ms), "soc", &ms->esp32s3, TYPE_ESP32S3_SOC);
  Esp32s3SocState* ss = ESP32S3_SOC(&ms->esp32s3);
  if (mofei_sim_board_is_lilygo_t5s3_pro()) {
    ss->lilygo_gnss = lilygo_gnss_chardev_create();
    qdev_prop_set_chr(DEVICE(&ss->uart[2]), "chardev", ss->lilygo_gnss);
  }

  MemoryRegion* dram = g_new(MemoryRegion, 1);
  const struct MemmapEntry* memmap = esp32s3_memmap;

  memory_region_init_ram(dram, NULL, "esp32s3.dram", memmap[ESP32S3_MEMREGION_DRAM].size, &error_fatal);
  memory_region_add_subregion(sys_mem, memmap[ESP32S3_MEMREGION_DRAM].base, dram);

  /* Inject a tiny stub function into DRAM that writes a character directly
   * to the UART0 TX FIFO register (0x60000000), bypassing all ROM init
   * checks.  Then set the ROM's "alternate putc" function pointer so
   * esp_rom_printf calls our stub instead of the ROM's own multi-layer
   * checked version.
   *
   * Stub layout (placed at 0x3FCE0000, 13 bytes, no literal pool):
   *   +0  entry a1, 16              -- 36 21 00
   *   +3  movi  a8, 0x60            -- 82 a0 60   (96 decimal)
   *   +6  slli  a8, a8, 24          -- 80 88 01   (a8 = 0x60000000)
   *   +9  s32i.n a2, a8, 0          -- 29 08     (write char to FIFO)
   *   +B  retw.n                    -- 1d f0
   *
   * The ROM esp_rom_printf calls through *0x3FCEF750 when its primary
   * putc pointer (*0x3FCEF754) is NULL.  Setting *0x3FCEF750 to the
   * stub's entry point makes all ROM printf output flow to the QEMU
   * UART0 model, which is connected to stdio.
   */
  {
    static const uint8_t uart_putc_stub[] = {
        0x36, 0x21, 0x00, /* entry a1, 16 */
        0x1D, 0xF0,       /* retw.n */
    };
    const uint32_t stub_addr = 0x3FCE0000;
    address_space_write(&address_space_memory, stub_addr, MEMTXATTRS_UNSPECIFIED, uart_putc_stub,
                        sizeof(uart_putc_stub));

    /* Set the ROM alternate putc pointer to NULL so ROM printf
     * skips character output entirely. This avoids deep call chains
     * through the UART stub that trigger window overflow exceptions. */
    const uint32_t rom_alt_putc_addr = 0x3FCEF750;
    const uint32_t null_ptr = 0;
    address_space_write(&address_space_memory, rom_alt_putc_addr, MEMTXATTRS_UNSPECIFIED, (const uint8_t*)&null_ptr, 4);

