Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
    fprintf(stderr, "[QEMU-DBG] UART putc stub at 0x%x, *0x%x = NULL (no output)\n", stub_addr, rom_alt_putc_addr);
  }

  memory_region_init_io(&ss->iomem, OBJECT(&ss->cpu[0]), &esp32s3_io_ops, NULL, "esp32s3.iomem", 0xd1000);
  memory_region_add_subregion(sys_mem, ESP32S3_IO_START_ADDR, &ss->iomem);

  // qdev_prop_set_chr(DEVICE(ss), "serial0", serial_hd(0));
  // qdev_prop_set_chr(DEVICE(ss), "serial1", serial_hd(1));
  // qdev_prop_set_chr(DEVICE(ss), "serial2", serial_hd(2));

  qdev_realize(DEVICE(ss), NULL, &error_fatal);

  I2CBus* lilygo_i2c_bus = esp32s3_lilygo_i2c_bus(ss);
  if (lilygo_i2c_bus != NULL) {
    i2c_slave_create_simple(lilygo_i2c_bus, TYPE_LILYGO_I2C_PROBE, LILYGO_I2C_PROBE_ADDRESS);
    ss->lilygo_touch = DEVICE(i2c_slave_create_simple(lilygo_i2c_bus, TYPE_LILYGO_GT911, LILYGO_GT911_ADDRESS));
    i2c_slave_create_simple(lilygo_i2c_bus, TYPE_LILYGO_PCA9535, LILYGO_PCA9535_ADDRESS);
    i2c_slave_create_simple(lilygo_i2c_bus, TYPE_LILYGO_TPS65185, LILYGO_TPS65185_ADDRESS);
    lilygo_bq27220_attach(lilygo_i2c_bus);
    lilygo_bq25896_attach(lilygo_i2c_bus);
    lilygo_pcf8563_attach(lilygo_i2c_bus);
    lilygo_pca9535_set_gnss_power_sink(lilygo_gnss_chardev_set_board_power);
    fprintf(stderr, "[QEMU-SIM] lilygo I2C controller bus ready base=0x%08x\n", DR_REG_I2C_EXT_BASE);
  }

  object_initialize_child(OBJECT(ss), "extmem", &ss->cache, TYPE_ESP32S3_CACHE);
  object_initialize_child(OBJECT(ss), "spi1", &ss->spi1, TYPE_ESP32S3_SPI);
  object_initialize_child(OBJECT(ss), "efuse", &ss->efuse, TYPE_ESP32S3_EFUSE);
  object_initialize_child(OBJECT(ss), "jtag", &ss->jtag, TYPE_ESP32C3_JTAG);
  object_initialize_child(OBJECT(ss), "gpio", &ss->gpio, TYPE_ESP32S3_GPIO);
  object_initialize_child(OBJECT(ss), "rng", &ss->rng, TYPE_ESP32S3_RNG);

  object_initialize_child(OBJECT(ss), "clock", &ss->clock, TYPE_ESP32S3_CLOCK);

  object_initialize_child(OBJECT(ss), "gdma", &ss->gdma, TYPE_ESP32S3_GDMA);
  object_initialize_child(OBJECT(ss), "sha", &ss->sha, TYPE_ESP32S3_SHA);
  object_initialize_child(OBJECT(ss), "aes", &ss->aes, TYPE_ESP32S3_AES);
  object_initialize_child(OBJECT(ss), "rsa", &ss->rsa, TYPE_ESP32S3_RSA);
  object_initialize_child(OBJECT(ss), "hmac", &ss->hmac, TYPE_ESP32S3_HMAC);
  object_initialize_child(OBJECT(ss), "ds", &ss->ds, TYPE_ESP32S3_DS);
  object_initialize_child(OBJECT(ss), "pms", &ss->pms, TYPE_ESP32S3_PMS);

  object_initialize_child(OBJECT(ss), "xts_aes", &ss->xts_aes, TYPE_ESP32S3_XTS_AES);
  object_initialize_child(OBJECT(ss), "timg0", &ss->timg[0], TYPE_ESP32S3_TIMG);
  object_initialize_child(OBJECT(ss), "timg1", &ss->timg[1], TYPE_ESP32S3_TIMG);
  object_initialize_child(OBJECT(ss), "systimer", &ss->systimer, TYPE_ESP32S3_SYSTIMER);
  object_initialize_child(OBJECT(ss), "rgb", &ss->rgb, TYPE_ESP_RGB);

  /* Board-specific SPI/display and legacy bit-bang touch peripherals. */
  ss->mofei_spi2 = qdev_new("esp32s3-gpspi2");
  object_property_set_link(OBJECT(ss->mofei_spi2), "gdma", OBJECT(&ss->gdma), &error_abort);
  if (mofei_sim_board_is_lilygo_t5s3_pro()) {
    qdev_prop_set_bit(ss->mofei_spi2, "route-chip-selects", true);
    ss->mofei_epd = qdev_new("ssd1677-gdeq0426");
    ss->mofei_touch = NULL;
    ss->mofei_i2c_bridge = NULL;
  } else if (mofei_sim_board_is_m5papers3()) {
    qdev_prop_set_bit(ss->mofei_spi2, "route-chip-selects", true);
    ss->mofei_epd = qdev_new("ssd1677-gdeq0426");
    ss->mofei_touch = NULL;
    ss->mofei_i2c_bridge = NULL;
  } else if (mofei_sim_board_is_s37uc()) {
    ss->mofei_i2c_bridge = qdev_new(TYPE_GPIO_I2C);
    ss->mofei_epd = qdev_new("uc8253c-s37uc");
    ss->mofei_touch = qdev_new("chsc6440-s37uc");
    qdev_prop_set_uint8(ss->mofei_touch, "address", 0x40);
  } else {
    ss->mofei_i2c_bridge = qdev_new(TYPE_GPIO_I2C);
    ss->mofei_epd = qdev_new("ssd1677-gdeq0426");
    ss->mofei_touch = qdev_new("ft6336u-mofei");
    qdev_prop_set_uint8(ss->mofei_touch, "address", 0x2E);
  }

  Chardev* mofei_chr = qemu_chr_find("mofei");
  if (mofei_chr && ss->mofei_epd != NULL) {
    qdev_prop_set_chr(ss->mofei_epd, "chardev", mofei_chr);
    fprintf(stderr, "[QEMU-DBG] Mofei chardev 'mofei' connected to %s display\n", mofei_sim_board_name());
  }

  DeviceState* intmatrix_dev = DEVICE(&ss->intmatrix);
  {
    /* Store the current Machine CPU in the interrupt matrix */
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->intmatrix), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_INTERRUPT_BASE, mr, 0);
  }

  /* Initialize OpenCores Ethernet controller now sicne it requires the interrupt matrix */
  esp32s3_init_openeth(ss);

  /* USB Serial JTAG realization */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->jtag), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->jtag), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_USB_SERIAL_JTAG_BASE, mr, 0);
  }

  /* SPI1 controller (SPI Flash) */
  {
    ss->spi1.xts_aes = &ss->xts_aes;
    sysbus_realize(SYS_BUS_DEVICE(&ss->spi1), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->spi1), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_SPI1_BASE, mr, 0);
    if (blk) {
      esp32s3_init_spi_flash(ss, blk);
    }
    if (machine->ram_size > 0) {
      esp32s3_machine_init_psram(ss, (uint32_t)(machine->ram_size / MiB));
    }
  }

  /* Mofei/s37uc GPSPI2 (SPI2) controller + selected e-ink/touch
   * Realize the SPI controller and connect peripherals on the bus,
   * but skip all GPIO wiring (DC/CS/RST/BUSY/INT lines) since the
   * Espressif QEMU fork does not emulate the GPIO matrix.
   */
  {
    /* GPSPI2 MMIO at DR_REG_SPI2_BASE */
    sysbus_realize(SYS_BUS_DEVICE(ss->mofei_spi2), &error_fatal);
    memory_region_add_subregion(sys_mem, DR_REG_SPI2_BASE, sysbus_mmio_get_region(SYS_BUS_DEVICE(ss->mofei_spi2), 0));

    sysbus_connect_irq(SYS_BUS_DEVICE(ss->mofei_spi2), 0, qdev_get_gpio_in(intmatrix_dev, ETS_SPI2_INTR_SOURCE));

    if (mofei_sim_board_is_lilygo_t5s3_pro() || mofei_sim_board_is_m5papers3()) {
      SSIBus* frame_ipc_bus = ssi_create_bus(DEVICE(ss), "lilygo-frame-ipc");
      qdev_realize(ss->mofei_epd, BUS(frame_ipc_bus), &error_fatal);
      if (mofei_sim_board_is_lilygo_t5s3_pro()) {
        ss->lilygo_radio = esp32s3_machine_init_lilygo_spi(ss->mofei_spi2, sd_blk);
        lilygo_pca9535_set_radio_power_sink(lilygo_sx1262_set_board_power);
      } else {
        /* PaperS3 has SPI2 SD on CS47, but no radio target. */
        esp32s3_machine_attach_lilygo_spi_sd(ss->mofei_spi2, sd_blk, 0);
        fprintf(stderr, "[PAPERS3-SPI] SD media attached cs=%d\n", M5PAPERS3_SD_CS_GPIO);
      }
    } else {
      /* Selected e-ink display on GPSPI2's SSI bus. */
      BusState* spi2_bus = qdev_get_child_bus(ss->mofei_spi2, "spi");
      qdev_realize(ss->mofei_epd, spi2_bus, &error_fatal);

      /* Selected touch controller on the legacy bit-bang I2C bus. */
      sysbus_realize_and_unref(SYS_BUS_DEVICE(ss->mofei_i2c_bridge), &error_fatal);
      I2CBus* i2c_bus = (I2CBus*)qdev_get_child_bus(ss->mofei_i2c_bridge, "i2c");
      qdev_realize_and_unref(ss->mofei_touch, BUS(i2c_bus), &error_fatal);
      i2c_slave_set_address(I2C_SLAVE(ss->mofei_touch), mofei_sim_board_is_s37uc() ? 0x40 : 0x2E);
    }

    fprintf(stderr, "[QEMU-DBG] %s peripherals realized\n", mofei_sim_board_name());
    fflush(stderr);
  }

