Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
  /* (Extmem) Cache realization */
  {
    if (blk) {
      ss->cache.flash_blk = blk;
    } else if (machine->kernel_filename || machine->firmware) {
      /* Fix: When booting from ELF without a flash drive, ss->cache.flash_blk is NULL,
       * which leaves ss->cache.flash_mr uninitialized. The cache controller later
       * asserts on memory_region_get_ram_ptr(&s->flash_mr) when the firmware clears the cache.
       * Workaround: Initialize a dummy RAM region so it doesn't assert. */
      memory_region_init_ram(&ss->cache.flash_mr, OBJECT(&ss->cache), "esp32s3.cache.dummy_flash", 8 * MiB,
                             &error_fatal);
    }
    if (ss->psram) {
      ss->cache.psram = ss->psram;
    }
    ss->cache.xts_aes = &ss->xts_aes;
    sysbus_realize(SYS_BUS_DEVICE(&ss->cache), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->cache), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_EXTMEM_BASE, mr, 0);

    memory_region_add_subregion(sys_mem, memmap[ESP32S3_MEMREGION_DCACHE].base, &ss->cache.dcache);
    memory_region_add_subregion(sys_mem, memmap[ESP32S3_MEMREGION_ICACHE].base, &ss->cache.icache);
  }

  /* eFuses realization */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->efuse), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->efuse), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_EFUSE_BASE, mr, 0);
    sysbus_connect_irq(SYS_BUS_DEVICE(&ss->efuse), 0, qdev_get_gpio_in(intmatrix_dev, ETS_EFUSE_INTR_SOURCE));
  }

  /* System clock realization */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->clock), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->clock), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_SYSTEM_BASE, mr, 0);
    /* Connect the IRQ lines to the interrupt matrix */
    for (int i = 0; i < ESP32S3_SYSTEM_CPU_INTR_COUNT; i++) {
      sysbus_connect_irq(SYS_BUS_DEVICE(&ss->clock), i, qdev_get_gpio_in(intmatrix_dev, ETS_FROM_CPU_INTR0_SOURCE + i));
    }
  }
  /* Timer Groups realization */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->timg[0]), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->timg[0]), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_TIMERGROUP0_BASE, mr, 0);
    /* Connect the T0 interrupt line to the interrupt matrix */
    qdev_connect_gpio_out_named(DEVICE(&ss->timg[0]), ESP32S3_T0_IRQ_INTERRUPT, 0,
                                qdev_get_gpio_in(intmatrix_dev, ETS_TG0_T0_LEVEL_INTR_SOURCE));
    /* Connect the T1 interrupt line to the interrupt matrix */
    qdev_connect_gpio_out_named(DEVICE(&ss->timg[0]), ESP32S3_T1_IRQ_INTERRUPT, 0,
                                qdev_get_gpio_in(intmatrix_dev, ETS_TG0_T1_LEVEL_INTR_SOURCE));
    /* Connect the Watchdog interrupt line to the interrupt matrix */
    qdev_connect_gpio_out_named(DEVICE(&ss->timg[0]), ESP32S3_WDT_IRQ_INTERRUPT, 0,
                                qdev_get_gpio_in(intmatrix_dev, ETS_TG0_WDT_LEVEL_INTR_SOURCE));
  }
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->timg[1]), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->timg[1]), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_TIMERGROUP1_BASE, mr, 0);
    /* Connect the T0 interrupt line to the interrupt matrix */
    qdev_connect_gpio_out_named(DEVICE(&ss->timg[1]), ESP32S3_T0_IRQ_INTERRUPT, 0,
                                qdev_get_gpio_in(intmatrix_dev, ETS_TG1_T0_LEVEL_INTR_SOURCE));
    /* Connect the T1 interrupt line to the interrupt matrix */
    qdev_connect_gpio_out_named(DEVICE(&ss->timg[1]), ESP32S3_T1_IRQ_INTERRUPT, 0,
                                qdev_get_gpio_in(intmatrix_dev, ETS_TG1_T1_LEVEL_INTR_SOURCE));
    /* Connect the Watchdog interrupt line to the interrupt matrix */
    qdev_connect_gpio_out_named(DEVICE(&ss->timg[1]), ESP32S3_WDT_IRQ_INTERRUPT, 0,
                                qdev_get_gpio_in(intmatrix_dev, ETS_TG1_WDT_LEVEL_INTR_SOURCE));
  }

  /* System timer */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->systimer), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->systimer), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_SYSTIMER_BASE, mr, 0);
    for (int i = 0; i < ESP_SYSTIMER_IRQ_COUNT; i++) {
      sysbus_connect_irq(SYS_BUS_DEVICE(&ss->systimer), i,
                         qdev_get_gpio_in(intmatrix_dev, ETS_SYSTIMER_TARGET0_EDGE_INTR_SOURCE + i));
    }
  }

  /* GPIO realization */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->gpio), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->gpio), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_GPIO_BASE, mr, 0);
  }

  /* Board GPIO wiring — connect GPIO pins to peripheral control lines. */
  {
    DeviceState* gpio_dev = DEVICE(&ss->gpio);
    if (mofei_sim_board_is_lilygo_t5s3_pro()) {
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", LILYGO_SD_CS_GPIO,
                                  qdev_get_gpio_in_named(ss->mofei_spi2, "chip-select", 0));
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", LILYGO_RADIO_CS_GPIO,
                                  qdev_get_gpio_in_named(ss->mofei_spi2, "chip-select", 1));
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", LILYGO_TOUCH_RESET_GPIO,
                                  qdev_get_gpio_in_named(ss->lilygo_touch, "reset", 0));
      qdev_connect_gpio_out_named(ss->lilygo_touch, "int", 0, qdev_get_gpio_in(gpio_dev, LILYGO_TOUCH_INT_GPIO));
    } else if (mofei_sim_board_is_m5papers3()) {
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", M5PAPERS3_SD_CS_GPIO,
                                  qdev_get_gpio_in_named(ss->mofei_spi2, "chip-select", 0));
    } else {
      const int epd_dc_gpio = mofei_sim_board_is_s37uc() ? S37UC_EPD_DC_GPIO : MOFEI_EPD_DC_GPIO;
      const int epd_rst_gpio = mofei_sim_board_is_s37uc() ? S37UC_EPD_RST_GPIO : MOFEI_EPD_RST_GPIO;
      const int epd_busy_gpio = mofei_sim_board_is_s37uc() ? S37UC_EPD_BUSY_GPIO : MOFEI_EPD_BUSY_GPIO;
      const int touch_sda_gpio = mofei_sim_board_is_s37uc() ? S37UC_TOUCH_SDA_GPIO : MOFEI_TOUCH_SDA_GPIO;
      const int touch_scl_gpio = mofei_sim_board_is_s37uc() ? S37UC_TOUCH_SCL_GPIO : MOFEI_TOUCH_SCL_GPIO;
      const int touch_int_gpio = mofei_sim_board_is_s37uc() ? S37UC_TOUCH_INT_GPIO : MOFEI_TOUCH_INT_GPIO;

