Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", epd_dc_gpio, qdev_get_gpio_in_named(ss->mofei_epd, "dc", 0));
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", epd_rst_gpio,
                                  qdev_get_gpio_in_named(ss->mofei_epd, "reset", 0));
      qdev_connect_gpio_out_named(ss->mofei_epd, "busy", 0, qdev_get_gpio_in(gpio_dev, epd_busy_gpio));
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", touch_sda_gpio, qdev_get_gpio_in(ss->mofei_i2c_bridge, 0));
      qdev_connect_gpio_out_named(gpio_dev, "gpio-out", touch_scl_gpio, qdev_get_gpio_in(ss->mofei_i2c_bridge, 1));
      qdev_connect_gpio_out(ss->mofei_i2c_bridge, 0, qdev_get_gpio_in(gpio_dev, touch_sda_gpio));
      qdev_connect_gpio_out_named(ss->mofei_touch, "int", 0, qdev_get_gpio_in(gpio_dev, touch_int_gpio));

      if (mofei_sim_board_is_s37uc()) {
        qdev_connect_gpio_out_named(ss->mofei_touch, "button-out", 0,
                                    qdev_get_gpio_in(gpio_dev, S37UC_BTN_SIDEKEY_GPIO));
        qdev_connect_gpio_out_named(ss->mofei_touch, "button-out", 1,
                                    qdev_get_gpio_in(gpio_dev, S37UC_BTN_SIDEKEY1_GPIO));
      } else {
        qdev_connect_gpio_out_named(ss->mofei_touch, "button-out", 0,
                                    qdev_get_gpio_in(gpio_dev, MOFEI_BTN_KEYLOCK_GPIO));
        qdev_connect_gpio_out_named(ss->mofei_touch, "button-out", 1, qdev_get_gpio_in(gpio_dev, MOFEI_BTN_KEY1_GPIO));
        qdev_connect_gpio_out_named(ss->mofei_touch, "button-out", 2, qdev_get_gpio_in(gpio_dev, MOFEI_BTN_KEY2_GPIO));
      }
    }

    fprintf(stderr, "[QEMU-DBG] %s GPIO wiring complete\n", mofei_sim_board_name());
    fflush(stderr);
  }

  {
    qdev_realize(DEVICE(&ss->rng), &ss->periph_bus, &error_fatal);
    esp32s3_soc_add_periph_device(sys_mem, &ss->rng, ESP32S3_RNG_BASE);
  }

  /* GDMA Realization */
  {
    object_property_set_link(OBJECT(&ss->gdma), "soc_mr", OBJECT(dram), &error_abort);
    sysbus_realize(SYS_BUS_DEVICE(&ss->gdma), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->gdma), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_GDMA_BASE, mr, 0);
    /* Connect the IRQs to the Interrupt Matrix */
    for (int i = 0; i < ESP32S3_GDMA_CHANNEL_COUNT; i++) {
      qdev_connect_gpio_out_named(DEVICE(&ss->gdma), ESP_GDMA_IRQ_IN_NAME, i,
                                  qdev_get_gpio_in(intmatrix_dev, ETS_DMA_IN_CH0_INTR_SOURCE + i));
      qdev_connect_gpio_out_named(DEVICE(&ss->gdma), ESP_GDMA_IRQ_OUT_NAME, i,
                                  qdev_get_gpio_in(intmatrix_dev, ETS_DMA_OUT_CH0_INTR_SOURCE + i));
    }
  }

  /* SHA realization */
  {
    ss->sha.parent.gdma = ESP_GDMA(&ss->gdma);
    sysbus_realize(SYS_BUS_DEVICE(&ss->sha), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->sha), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_SHA_BASE, mr, 0);
    sysbus_connect_irq(SYS_BUS_DEVICE(&ss->sha), 0, qdev_get_gpio_in(intmatrix_dev, ETS_SHA_INTR_SOURCE));
  }

  /* AES realization */
  {
    ss->aes.parent.gdma = ESP_GDMA(&ss->gdma);
    sysbus_realize(SYS_BUS_DEVICE(&ss->aes), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->aes), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_AES_BASE, mr, 0);
    sysbus_connect_irq(SYS_BUS_DEVICE(&ss->aes), 0, qdev_get_gpio_in(intmatrix_dev, ETS_AES_INTR_SOURCE));
  }
  /* RSA realization */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->rsa), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->rsa), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_RSA_BASE, mr, 0);
    sysbus_connect_irq(SYS_BUS_DEVICE(&ss->rsa), 0, qdev_get_gpio_in(intmatrix_dev, ETS_RSA_INTR_SOURCE));
  }
  /* PMS realization */
  {
    sysbus_realize(SYS_BUS_DEVICE(&ss->pms), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->pms), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_SENSITIVE_BASE, mr, 0);
  }

  /* HMAC realization */
  {
    ss->hmac.parent.efuse = ESP_EFUSE(&ss->efuse);
    qdev_realize(DEVICE(&ss->hmac), &ss->periph_bus, &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->hmac), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_HMAC_BASE, mr, 0);
  }

  /* Digital Signature realization */
  {
    ss->ds.parent.hmac = ESP_HMAC(&ss->hmac);
    ss->ds.parent.aes = ESP_AES(&ss->aes);
    ss->ds.parent.rsa = ESP_RSA(&ss->rsa);
    ss->ds.parent.sha = ESP_SHA(&ss->sha);
    qdev_realize(DEVICE(&ss->ds), &ss->periph_bus, &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->ds), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_DIGITAL_SIGNATURE_BASE, mr, 0);
  }
  /* XTS-AES realization */
  {
    ss->xts_aes.efuse = ESP_EFUSE(&ss->efuse);
    ss->xts_aes.clock = &ss->clock;
    qdev_realize(DEVICE(&ss->xts_aes), &ss->periph_bus, &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->xts_aes), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_AES_XTS_BASE, mr, 0);
  }

  /* RGB display realization */
  {
    /* Give the internal RAM memory region to the display */
    ss->rgb.intram = dram;
    sysbus_realize(SYS_BUS_DEVICE(&ss->rgb), &error_fatal);
    MemoryRegion* mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(&ss->rgb), 0);
    memory_region_add_subregion_overlap(sys_mem, DR_REG_FRAMEBUF_BASE, mr, 0);
    memory_region_add_subregion_overlap(sys_mem, esp32s3_memmap[ESP32S3_MEMREGION_FRAMEBUF].base, &ss->rgb.vram, 0);
  }

  esp32s3_soc_add_unimp_device(sys_mem, "esp32s3.rmt", DR_REG_RMT_BASE, 0x1000);
  esp32s3_soc_add_unimp_device(sys_mem, "esp32s3.iomux", DR_REG_IO_MUX_BASE, 0x2000);

  if (!mofei_sim_board_is_lilygo_t5s3_pro() && !mofei_sim_board_is_m5papers3()) {
    esp32s3_machine_init_sd(ss, sd_blk);
  }

  /* For flash boot, set static_vectors=1 (ROM reset vector at 0x40000400)
   * before any reset runs.  On power-on, the ESP32-S3 boots from ROM.
   * This must be set before cpu_reset() or the QOM system reset, because
   * xtensa_cpu_resetfn reads static_vectors to determine the initial PC. */
  if (!machine->kernel_filename && !machine->firmware) {
    xtensa_select_static_vectors(&ss->cpu[0].env, true);
  }

