Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
  /* Need MMU initialized prior to ELF loading,
   * so that ELF gets loaded into virtual addresses
   */
  cpu_reset(CPU(&ss->cpu[0]));

  const char* load_elf_filename = NULL;
  if (machine->firmware) {
    load_elf_filename = machine->firmware;
  }
  if (machine->kernel_filename) {
    qemu_log("Warning: both -bios and -kernel arguments specified. Only loading the the -kernel file.\n");
    load_elf_filename = machine->kernel_filename;
  }

  if (load_elf_filename) {
    /* Create ICACHE/DCACHE RAM overlays BEFORE loading the ELF so that
     * load_elf writes patched firmware data into the overlay RAM rather
     * than into the default (empty) cache model regions.  Without these
     * overlays, the cache model's IOMMU translates ICACHE reads to flash
     * (which has no ELF data), causing fetch errors (cause=14). */
    MemoryRegion* icache_ram = g_new(MemoryRegion, 1);
    MemoryRegion* dcache_ram = g_new(MemoryRegion, 1);
    memory_region_init_ram(icache_ram, NULL, "esp32s3.icache.ram", ESP32S3_EXTMEM_REGION_SIZE, &error_fatal);
    memory_region_init_ram(dcache_ram, NULL, "esp32s3.dcache.ram", ESP32S3_EXTMEM_REGION_SIZE, &error_fatal);
    memory_region_add_subregion_overlap(sys_mem, esp32s3_memmap[ESP32S3_MEMREGION_ICACHE].base, icache_ram, 1);
    memory_region_add_subregion_overlap(sys_mem, esp32s3_memmap[ESP32S3_MEMREGION_DCACHE].base, dcache_ram, 1);
    fprintf(stderr, "[QEMU-DBG] ICACHE/DCACHE RAM overlays created at 0x%lx (%lu KB each)\n",
            (unsigned long)esp32s3_memmap[ESP32S3_MEMREGION_ICACHE].base,
            (unsigned long)(ESP32S3_EXTMEM_REGION_SIZE / 1024));

    MemoryRegion* icache_low_alias = g_new(MemoryRegion, 1);
    memory_region_init_alias(icache_low_alias, OBJECT(ss), "esp32s3.icache-low", icache_ram, 0,
                             ESP32S3_EXTMEM_REGION_SIZE);
    memory_region_add_subregion_overlap(&ss->cpu_specific_mem[0], 0x02000000, icache_low_alias, 1);
    fprintf(stderr, "[QEMU-DBG] ICACHE low-address alias at 0x02000000 (%lu KB)\n",
            (unsigned long)(ESP32S3_EXTMEM_REGION_SIZE / 1024));

    MemoryRegion* icache_cpu_alias = g_new(MemoryRegion, 1);
    MemoryRegion* dcache_cpu_alias = g_new(MemoryRegion, 1);
    memory_region_init_alias(icache_cpu_alias, OBJECT(ss), "esp32s3.icache-cpu", icache_ram, 0,
                             ESP32S3_EXTMEM_REGION_SIZE);
    memory_region_init_alias(dcache_cpu_alias, OBJECT(ss), "esp32s3.dcache-cpu", dcache_ram, 0,
                             ESP32S3_EXTMEM_REGION_SIZE);
    memory_region_add_subregion_overlap(&ss->cpu_specific_mem[0], esp32s3_memmap[ESP32S3_MEMREGION_ICACHE].base,
                                        icache_cpu_alias, 2);
    memory_region_add_subregion_overlap(&ss->cpu_specific_mem[0], esp32s3_memmap[ESP32S3_MEMREGION_DCACHE].base,
                                        dcache_cpu_alias, 2);
    fprintf(stderr, "[QEMU-DBG] ICACHE/DCACHE CPU-view aliases installed for firmware fetch/data overlays\n");

    /* Load ROM bootloader to IROM — it provides functions at 0x40000000+
     * (e.g. esp_rom_get_reset_reason, memset) that the firmware calls. */
    char* rom_binary = mofei_resolve_rom_binary();
    if (rom_binary == NULL) {
      error_report("Error: ROM binary not found (set MOFEI_ROM_BINARY or ensure pc-bios/esp32s3_rev0_rom.bin exists)");
      exit(1);
    }
    gsize rom_len = 0;
    guint8* rom_data = NULL;
    if (!g_file_get_contents(rom_binary, (gchar**)&rom_data, &rom_len, NULL) || rom_len == 0) {
      error_report("Error: could not read ROM binary '%s'", rom_binary);
      g_free(rom_binary);
      exit(1);
    }
    fprintf(stderr, "[QEMU-DBG] ROM bootloader: %lu bytes from %s at 0x%lx\n", (unsigned long)rom_len, rom_binary,
            (unsigned long)esp32s3_memmap[ESP32S3_MEMREGION_IROM].base);
    g_free(rom_binary);

    uint64_t image_entry = 0;
    uint64_t image_lowaddr = 0;
    int image_size = 0;

    /* Detect file type: .bin (ESP image) or .elf */
    bool is_esp_image = false;
    size_t fnlen = strlen(load_elf_filename);
    if (fnlen >= 4 && g_ascii_strcasecmp(load_elf_filename + fnlen - 4, ".bin") == 0) {
      is_esp_image = true;
    }

    if (is_esp_image) {
      /* Parse ESP32/ESP32-S3 firmware image (.bin).
       * Format: 8-byte header + 16-byte extended header +
       *         N segments (each: 4B addr + 4B len + data) */
      gsize bin_len = 0;
      guint8* bin_data = NULL;
      if (g_file_get_contents(load_elf_filename, (gchar**)&bin_data, &bin_len, NULL) && bin_len >= 8) {
        if (bin_data[0] != 0xE9) {
          error_report("Not a valid ESP image: magic 0x%02x", bin_data[0]);
          exit(1);
        }
        uint8_t seg_count = bin_data[1];
        memcpy(&image_entry, bin_data + 4, 4);
        image_size = (int)bin_len;

        /* Extended header is 16 bytes for ESP32-S3 */
        size_t off = 8 + 16;
        fprintf(stderr, "[QEMU-DBG] Loading ESP image: %s (%lu bytes, %d segments, entry=0x%lx)\n", load_elf_filename,
                (unsigned long)bin_len, seg_count, (unsigned long)image_entry);

        for (int si = 0; si < seg_count && off + 8 <= bin_len; si++) {
          uint32_t load_addr, data_len;
          memcpy(&load_addr, bin_data + off, 4);
          memcpy(&data_len, bin_data + off + 4, 4);
          off += 8;
          if (off + data_len > bin_len) {
            error_report("ESP image segment %d overflows file", si);
            exit(1);
          }
          if (si == 0) {
            image_lowaddr = load_addr;
          }
          /* Patch out problematic calls in call_start_cpu0 that
           * access un-emulated hardware registers.
           * Replace call8 (3 bytes) with or a0,a0,a0 (NOP, 0x200000). */
          if (load_addr == 0x40374000) { /* IRAM segment */
            struct {
              uint32_t off;
              const char* name;
            } patches[] = {
                {0x1D16, "call_start_cpu1 call8 -> NOP"},
            };
            /* 0x200000 = 'or a0, a0, a0' (true 24-bit NOP, LE bytes).
             * Do NOT use {0x02,0x00,0x00} — that's 'l8ui a0,a0,0'!
             * Do NOT use {0x20,0x00,0x00} — that's a different opcode! */
            uint8_t nop3[] = {0x00, 0x00, 0x20};
            for (int pi = 0; pi < 1; pi++) {
              if (patches[pi].off + 3 <= data_len) {
                memcpy(bin_data + off + patches[pi].off, nop3, 3);
                fprintf(stderr, "[QEMU-DBG] Patched %s at seg off 0x%x\n", patches[pi].name, patches[pi].off);
              }
            }
          }
          gchar* seg_name = g_strdup_printf("esp32s3.bin_s%d", si);
          rom_add_blob_fixed_as(seg_name, bin_data + off, data_len, load_addr, CPU(&ss->cpu[0])->as);
          g_free(seg_name);
          fprintf(stderr, "[QEMU-DBG]   seg %d: 0x%x bytes at 0x%x\n", si, data_len, load_addr);
          off += data_len;
        }
        ss->kernel_entry = image_entry;
        g_free(bin_data);
      } else {
        error_report("Error: could not read '%s'", load_elf_filename);
        exit(1);
      }
    } else {
      fprintf(stderr, "[QEMU-DBG] Loading ELF: %s\n", load_elf_filename);
      gsize elf_len = 0;
      gchar* elf_data = NULL;
      if (!g_file_get_contents(load_elf_filename, &elf_data, &elf_len, NULL)) {
        error_report("Error: could not read '%s'", load_elf_filename);
        exit(1);
      }

      /* Patch do_multicore_settings (entry at 0x40375d98) to retw.
       * IRAM loads at 0x40374000, so offset = 0x1D98 in the IRAM ELF segment.
       * We patch the raw ELF file by finding the PT_LOAD segment that
       * covers 0x40375d98 and adjusting the file offset. */
      /* Memory-set patches: find symbols by name and write a
       * non-zero value to their address in DRAM after loading.
       * Used to bypass dual-core synchronization: CPU1 is
       * halted in QEMU so the "other core started" flag never
       * gets set. We write 1 to it so CPU0 proceeds. */
      struct {
        const char* name;
        uint32_t value;
        int found;
        uint32_t addr;
      } memset_patches[] = {
          {"s_other_cpu_startup_done", 1, 0, 0},
      };
      int n_memset = sizeof(memset_patches) / sizeof(memset_patches[0]);

      if (elf_len >= 52 && memcmp(elf_data, ELFMAG, 4) == 0) {
        /* The Xtensa bare-metal toolchain can produce big-endian ELF
         * containers (EI_DATA=ELFDATA2MSB), while ESP firmware builds
         * usually produce little-endian ELFs (EI_DATA=ELFDATA2LSB).  The custom
         * patching code reads ELF header fields by direct uint16/uint32
         * dereference, which only works for LE on a LE host.  For BE
         * ELFs, byte-swap the header fields and flip EI_DATA to LE so
         * the downstream load_elf() call (with big_endian=0) accepts it.
         * The Xtensa instruction encoding is always little-endian, so
         * segment data bytes need no conversion. */
        const bool elf_is_be = ((uint8_t)elf_data[5] == ELFDATA2MSB);
        if (elf_is_be) {
          /* Byte-swap ELF header fields from BE to LE.
           * e_ident (bytes 0..15) is single-byte — no swap needed.
           * The rest of the header (bytes 16..51) is a mix of
           * uint16 and uint32 fields, so we must swap each by
           * its actual size, not as bulk uint32 words. */
          uint16_t* h16;
          uint32_t* h32;
          h16 = (uint16_t*)(elf_data + 16);
          *h16 = __builtin_bswap16(*h16); /* e_type */
          h16 = (uint16_t*)(elf_data + 18);
          *h16 = __builtin_bswap16(*h16); /* e_machine */
          h32 = (uint32_t*)(elf_data + 20);
          *h32 = __builtin_bswap32(*h32); /* e_version */
          h32 = (uint32_t*)(elf_data + 24);
          *h32 = __builtin_bswap32(*h32); /* e_entry */
          h32 = (uint32_t*)(elf_data + 28);
          *h32 = __builtin_bswap32(*h32); /* e_phoff */
          h32 = (uint32_t*)(elf_data + 32);
          *h32 = __builtin_bswap32(*h32); /* e_shoff */
          h32 = (uint32_t*)(elf_data + 36);
          *h32 = __builtin_bswap32(*h32); /* e_flags */
          h16 = (uint16_t*)(elf_data + 40);
          *h16 = __builtin_bswap16(*h16); /* e_ehsize */
          h16 = (uint16_t*)(elf_data + 42);
          *h16 = __builtin_bswap16(*h16); /* e_phentsize */
          h16 = (uint16_t*)(elf_data + 44);
          *h16 = __builtin_bswap16(*h16); /* e_phnum */
          h16 = (uint16_t*)(elf_data + 46);
          *h16 = __builtin_bswap16(*h16); /* e_shentsize */
          h16 = (uint16_t*)(elf_data + 48);
          *h16 = __builtin_bswap16(*h16); /* e_shnum */
          h16 = (uint16_t*)(elf_data + 50);
          *h16 = __builtin_bswap16(*h16); /* e_shstrndx */
          /* Byte-swap all program header fields */
          uint16_t phnum = *(uint16_t*)(elf_data + 44);
          uint32_t phoff = *(uint32_t*)(elf_data + 28);
          for (int i = 0; i < phnum && phoff + (i + 1) * 32 <= elf_len; i++) {
            uint32_t* ph = (uint32_t*)(elf_data + phoff + i * 32);
            for (int w = 0; w < 8; w++) {
              ph[w] = __builtin_bswap32(ph[w]);
            }
          }
          /* Mark as LE so load_elf() (big_endian=0) accepts it */
          elf_data[5] = ELFDATA2LSB;
          fprintf(stderr, "[QEMU-DBG] BE ELF detected — header fields byte-swapped to LE\n");
        }

/* ---- Dynamic ELF symbol-based patching ----
 *
 * Instead of hardcoding instruction addresses (which shift on
 * every firmware rebuild), we parse the ELF .symtab at load
 * time and look up functions by name.  Each matched function
 * gets its second instruction (entry+3) overwritten with RETW
 * so it returns immediately after setting up its window frame.
 *
 * This makes the simulator robust across firmware rebuilds.
 * The patch list below only contains function names, not
 * addresses.
 */

/* --- Resolve function addresses from ELF symbol table --- */
#define MAX_RETW_PATCHES 512
        struct {
          const char* name;
          uint32_t addr;
          int found;
          int return_success;
        } retw_dyn[MAX_RETW_PATCHES];
        int n_retw = 0;

        /* Functions that must preserve a caller-provided non-zero return
         * candidate or receive a TCG-level success override.  These get
         * patched with 'nop.n; retw.n' instead of a wide RETW so the
         * translate.c RETW handler can distinguish them at offset +5.
         *
         * NOTE: xQueueGenericCreate and xQueueCreateMutex are NOT listed
         * here because translate.c's RETW handler allocates unique queue
         * handles via mofei_bump_queue_create(). They keep plain RETW so
         * the TCG helper fires at PC=addr+3. Same for malloc-family
         * functions which need mofei_bump_malloc(). */
        static const char* retw_success_names[] = {
            /* FreeRTOS task creation — returns pdPASS (1) */
            "xTaskCreatePinnedToCore",
            "xTaskCreateStaticPinnedToCore",
            "xTaskGetSchedulerState",
            "xTaskGenericNotify",
            "prvInitialiseNewTask$constprop$0",
            "prvAddNewTaskToReadyList",
            "prvAddCurrentTaskToDelayedList",
            "prvCheckForValidListAndQueue",
            /* FreeRTOS queue/semaphore operations — returns pdPASS/pdTRUE.
             * (Creation functions handled by translate.c TCG helpers.) */
            "xQueueGenericReset",
            "xQueueGenericSend",
            "xQueueSemaphoreTake",
            "xQueueTakeMutexRecursive",
            "xQueueGiveMutexRecursive",
            "xQueueReceive",
            "xQueuePeek",
            "xQueueGenericSendFromISR",
            "xQueueGiveFromISR",
            "xQueueReceiveFromISR",
            "xQueueGenericGetStaticBuffers",
            "xQueueGenericCreateStatic",
            "xQueueCreateCountingSemaphore",
            "xQueueCreateCountingSemaphoreStatic",
            "xQueueCreateMutexStatic",
            /* FreeRTOS event groups — returns non-NULL handle or bits */
            "xEventGroupCreate",
            "xEventGroupSetBits",
            "xEventGroupWaitBits",
            /* FreeRTOS idle/timer memory — void but harmless */
            "vApplicationGetIdleTaskMemory",
            "vApplicationGetTimerTaskMemory",
            /* Partition table — returns non-NULL iterator/handle */
            "esp_partition_find",
            "esp_partition_find_first",
            /* SPI bus init — returns spi_t* handle; loops polling
             * SPI peripheral registers in QEMU. */
            "spiStartBus",
        };
        int n_retw_success = sizeof(retw_success_names) / sizeof(retw_success_names[0]);

