Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
        /* Functions that must RETW (return immediately).
         * Grouped by subsystem.  Each name is looked up in the ELF
         * .symtab; if found, entry+3 is overwritten with RETW. */
        static const char* retw_names[] = {
            /* Boot / cache */
            "do_multicore_settings",
            "cache_hal_init",
            "Cache_Suspend_DCache",
            "Cache_Suspend_ICache",
            "Cache_Freeze_ICache_Enable",
            "Cache_Freeze_DCache_Enable",
            "cache_hal_disable",
            /* PSRAM (no PSRAM in QEMU) */
            "esp_psram_impl_enable",
            "esp_psram_chip_init",
            "s_psram_chip_init",
            /* SPI flash (not fully emulated) */
            "bootloader_flash_execute_command_common",
            "bootloader_flash_update_id",
            "flash_init_state",
            "esp_mmu_map_init",
            /* Partition table (flash not emulated) */
            "esp_partition_find",
            "esp_partition_next",
            "esp_partition_find_first",
            "esp_partition_verify",
            /* NVS (needs partitions + flash) */
            "nvs_flash_init",
            "nvs_flash_init_partition",
            "nvs_open",
            "nvs_open_from_partition",
            "nvs_commit",
            "nvs_close",
            "nvs_get_blob",
            "nvs_get_i8",
            "nvs_get_u8",
            "nvs_get_u16",
            "nvs_get_u32",
            "nvs_set_blob",
            "nvs_set_i8",
            "nvs_set_u8",
            "nvs_set_u16",
            "nvs_set_u32",
            "nvs_erase_key",
            /* OTA (needs flash partitions) */
            "esp_ota_get_running_partition",
            "esp_ota_get_app_partition_count",
            "esp_ota_get_next_update_partition",
            "esp_ota_begin",
            "esp_ota_end",
            "esp_ota_write",
            "esp_ota_abort",
            /* GPIO (peripheral register access) — keep stubbed
             * because gpio_get_level loops on BUSY pin polling,
             * and the GPIO matrix is not fully emulated. Display
             * DC/CS/RST control is handled by the display-bypass
             * mechanism instead. */
            "esp_gpio_reserve",
            "gpio_pullup_en",
            "gpio_pullup_dis",
            "gpio_pulldown_en",
            "gpio_pulldown_dis",
            "gpio_set_intr_type",
            "gpio_intr_enable",
            "gpio_intr_disable",
            "gpio_input_enable",
            "gpio_input_disable",
            "gpio_output_enable",
            "gpio_output_disable",
            "gpio_od_enable",
            "gpio_od_disable",
            "gpio_set_level",
            "gpio_get_level",
            "gpio_set_direction",
            "gpio_config_as_analog",
            "gpio_reset_pin",
            "gpio_set_drive_capability",
            "gpio_iomux_input",
            "gpio_iomux_output",
            "gpio_sleep_sel_dis",
            "gpio_func_sel",
            /* ADC oneshot (flash-resident, skip hardware init) */
            "__analogInit",
            "analogReadMilliVolts",
            "__analogReadMilliVolts",
            "adc_oneshot_new_unit",
            "adc_oneshot_del_unit",
            "adc_oneshot_read",
            "adc_oneshot_config_channel",
            "adc_oneshot_get_calibrated_result",
            "adc_oneshot_channel_to_io",
            "adc_oneshot_io_to_channel",
            "adc_oneshot_hal_setup",
            "adc_oneshot_hal_init",
            "adc_oneshot_hal_convert",
            "adc_oneshot_hal_channel_config",
            /* Serial/Print (virtual dispatch crashes in QEMU).
             * Keep Print::write overloads native: HalFile inherits the base
             * bulk write implementation, which fans buffers out through the
             * concrete byte writer used by EPUB section streaming. */
            "_ZN5Print7printlnEPKc",
            "_ZN5Print5printEPKc",
            "_ZN5Print7printlnEv",
            "_ZN5Print6printfEPKcz",
            "_ZN5Print7vprintfEPKc13__va_list_tag",
            "_ZN5Print11printNumberEmh",
            "_ZN5Print5printEli",
            "_ZN5Print5printEii",
            "_ZN5Print5printEmi",
            "_ZN5Print5printEhi",
            "_ZN5Print7printlnERK9Printable",
            "_ZN5Print5printERK6String",
            "_ZN5Print5printEc",
            "_ZN5Print5printERK9Printable",
            "_ZN5Print17availableForWriteEv",
            "_ZN5Print5flushEv",
            "_ZN5HWCDC5beginEm",
            "_ZNK5HWCDCcvbEv",
            "_ZN14HardwareSerial5beginEm",
            /* SPI bus init — spiStartBus loops calling xQueueSemaphoreTake
             * and polling SPI peripheral status registers that never
             * change in QEMU.  RETW-patched to skip hardware init.
             * (Also in retw_success_names to return non-NULL handle.) */
            "spiStartBus",
            /* SPI: SPIClass transaction functions are intercepted at
             * the TCG level (translate.c) and never execute natively.
             * Keeping them commented out here so the intercepts work. */
            /* "_ZN8SPIClass5beginEaaaa", */
            /* "_ZN8SPIClass16beginTransactionE11SPISettings", */
            /* "_ZN8SPIClass14endTransactionEv", */
            /* "_ZN8SPIClass8transferEh", */
            /* "_ZN8SPIClass10writeBytesEPKhm", */
            /* "_ZN8SPIClass3endEv", */
            /* Touch driver (I2C bitbang loops in QEMU) */
            "_ZN16MofeiTouchDriver12detectOnPinsEii",
            "_ZN16MofeiTouchDriver12readRegisterEhPhh",
            /* MPU/PMS (locks out memory) */
            "esp_cpu_configure_region_protection",
            /* Atomic CAS (peripheral register) */
            "esp_cpu_compare_and_set",
            /* FreeRTOS critical sections */
            "xPortEnterCriticalTimeout",
            "vPortExitCritical",
            "xPortInIsrContext",
            "xTaskGetCurrentTaskHandle",
            /* Clock / RTC */
            "rtc_clk_cpu_freq_to_xtal",
            "rtc_clk_cpu_freq_to_pll_mhz",
            "rtc_clk_cpu_freq_set_config",
            "rtc_clk_cpu_freq_set_config_fast",
            "rtc_clk_cpu_freq_set_xtal",
            "rtc_clk_cpu_freq_mhz_to_config",
            "recalib_bbpll",
            "esp_clk_init",
            /* I2C register access (ROM) */
            "regi2c_ctrl_read_reg_mask",
            "regi2c_ctrl_write_reg",
            "regi2c_ctrl_write_reg_mask",
            /* MSPI timing */
            "mspi_timing_change_speed_mode_cache_safe",
            "mspi_timing_enter_low_speed_mode",
            "mspi_timing_enter_high_speed_mode",
            /* Heap / memory */
            "heap_caps_init",
            "__esp_system_init_fn_init_heap",
            "soc_get_available_memory_regions",
            /* libc (calls malloc -> abort when heap empty) */
            "__esp_system_init_fn_init_libc",
            /* Interrupt allocation */
            "esp_intr_alloc_intrstatus",
            "esp_intr_alloc",
            /* Time */
            "esp_rtc_get_time_us",
            "esp_timer_get_time",
            "esp_timer_impl_get_time",
            "systimer_hal_get_counter_value",
            "esp_system_get_time",
            /* Brownout */
            "esp_brownout_init",
            /* Peripheral clocks */
            "esp_perip_clk_init",
            /* Log timestamp (divide by zero) */
            "esp_log_early_timestamp",
            /* Error handler */
            "_esp_error_check_failed",
            /* CPU1 (powered off in QEMU) */
            "esp_cpu_unstall",
            "ets_set_appcpu_boot_addr",
            "call_start_cpu1",
            /* RTC init (polls SPI/MMU ROM functions) */
            "rtc_init",
            "mspi_init",
            "sys_rtc_init",
            "esp_rtc_init",
            /* Startup (calls ROM spin loops) */
            "system_early_init",
            "startup_resume_other_cores",
            /* Abort/panic (avoid ROM spin loops) */
            "abort",
            "esp_system_abort",
            /* Init framework functions (all return ESP_OK) */
            "esp_system_init_fn",
            /* ESP-IDF system init functions */
            "__esp_system_init_fn_init_efuse_check",
            "__esp_system_init_fn_init_show_cpu_freq",
            "__esp_system_init_fn_init_show_app_info",
            "__esp_system_init_fn_init_efuse_show_app_info",
            "__esp_system_init_fn_init_psram_new",
            "__esp_system_init_fn_add_psram_to_heap",
            "__esp_system_init_fn_init_libc",
            "__esp_system_init_fn_init_newlib_time",
            "__esp_system_init_fn_esp_timer_init_os",
            "__esp_system_init_fn_esp_timer_init_nonos",
            "__esp_system_init_fn_esp_security_init",
            "__esp_system_init_fn_init_brownout",
            "__esp_system_init_fn_init_apb_dma",
            "__esp_system_init_fn_init_coexist",
            "__esp_system_init_fn_init_coredump",
            "__esp_system_init_fn_init_flash",
            "__esp_system_init_fn_init_efuse",
            "__esp_system_init_fn_mbedtls_psa_crypto_init_fn",
            "__esp_system_init_fn_init_disable_rtc_wdt",
            /* UART VFS、console 与 stdio 初始化必须真实执行，确保 owner E2E 经 UART0 到达 production stdin。 */
            "__esp_system_init_fn_init_vfs_nullfs",
            "__esp_system_init_fn_init_vfs_usj_sec",
            "__esp_system_init_fn_usb_serial_jtag_conn_status_init",
            /* Newlib locks are backed by FreeRTOS mutexes on ESP-IDF.
             * The simulator does not run a real scheduler, so lock paths
             * must not execute queue/mutex code before the first frame. */
            "_lock_init",
            "_lock_init_recursive",
            "_lock_close",
            "_lock_close_recursive",
            "_lock_acquire",
            "_lock_acquire_recursive",
            "_lock_release",
            "_lock_release_recursive",
            "__retarget_lock_init",
            "__retarget_lock_init_recursive",
            "__retarget_lock_close",
            "__retarget_lock_close_recursive",
            "__retarget_lock_acquire",
            "__retarget_lock_acquire_recursive",
            "__retarget_lock_release",
            "__retarget_lock_release_recursive",
            /* FreeRTOS: RETW-patch queue/task functions so they
             * return immediately without doing real work.  The
             * scheduler is bypassed via vTaskStartScheduler below. */
            "xQueueGenericCreate",
            "xQueueGenericReset",
            "xQueueCreateMutex",
            /* ESP-IDF WithCaps wrapper 會先配置 queue backing storage，再呼叫
             * static FreeRTOS API。模擬器改由 opaque queue handle 持有生命週期，
             * 因此在 wrapper 邊界攔截，並讓成對 delete 保持不配置記憶體。 */
            "xQueueCreateWithCaps",
            "xSemaphoreCreateGenericWithCaps",
            "vQueueDeleteWithCaps",
            "vSemaphoreDeleteWithCaps",
            "xQueueGenericSend",
            "xQueueSemaphoreTake",
            "xQueueTakeMutexRecursive",
            "xQueueGiveMutexRecursive",
            "xQueueReceive",
            "xQueuePeek",
            "xQueueGenericSendFromISR",
            "xQueueGiveFromISR",
            "xQueueReceiveFromISR",
            "uxQueueMessagesWaiting",
            "uxQueueSpacesAvailable",
            "vQueueDelete",
            "xQueueGenericGetStaticBuffers",
            "xQueueGenericCreateStatic",
            "xQueueCreateCountingSemaphore",
            "xQueueCreateCountingSemaphoreStatic",
            "xQueueCreateMutexStatic",
            "pvPortMalloc",
            "vPortFree",
            "heap_caps_malloc",
            "heap_caps_malloc_base",
            "heap_caps_malloc_default",
            "heap_caps_malloc_prefer",
            "heap_caps_aligned_alloc",
            "heap_caps_aligned_alloc_base",
            "heap_caps_free",
            "heap_caps_calloc",
            "heap_caps_calloc_base",
            "heap_caps_calloc_prefer",
            "heap_caps_realloc",
            "heap_caps_realloc_base",
            "heap_caps_realloc_default",
            "heap_caps_realloc_prefer",
            "multi_heap_malloc",
            "multi_heap_malloc_impl",
            "multi_heap_free",
            "multi_heap_free_impl",
            "tlsf_malloc",
            "tlsf_free",
            "tlsf_memalign_offs",
            "tlsf_realloc",
            "vTaskStartScheduler",
            "xPortStartScheduler",
            "xTaskCreatePinnedToCore",
            "xTaskCreateStaticPinnedToCore",
            "xTaskGetSchedulerState",
            "vTaskDelete",
            "vTaskDelay",
            "vTaskSuspendAll",
            "xTaskResumeAll",
            "vTaskSwitchContext",
            "vTaskPrioritySet",
            "vTaskPlaceOnEventList",
            "vTaskPlaceOnEventListRestricted",
            "xTaskRemoveFromEventList",
            "xTaskPriorityInherit",
            "xTaskPriorityDisinherit",
            /* Atomics (s32c1i throws EXCCAUSE=3 on some RAM regions in QEMU) */
            "__atomic_fetch_add_4",
            "__atomic_s32c1i_fetch_add_4",
            "xTaskCheckForTimeOut",
            "xTaskIncrementTick",
            "xTaskGenericNotify",
            "xTaskGenericNotifyWait",
            "ulTaskGenericNotifyValueClear",
            "ulTaskGenericNotifyTake",
            "prvInitialiseNewTask$constprop$0",
            "prvAddNewTaskToReadyList",
            "prvAddCurrentTaskToDelayedList",
            "prvCheckForValidListAndQueue",
            "vApplicationGetIdleTaskMemory",
            "vApplicationGetTimerTaskMemory",
            "xEventGroupCreate",
            "xEventGroupSetBits",
            "xEventGroupWaitBits",
            "esp_log",
            "esp_log_va",
            "esp_log_write",
            "esp_log_writev",
            "esp_log_impl_lock",
            "esp_log_impl_unlock",
            "esp_log_level_set",
            "esp_log_set_default_level",
            "esp_log_is_tag_loggable",
            "esp_log_linked_list_set_level",
            "esp_log_linked_list_get_level",
            "esp_log_linked_list_clean",
            "__assert_func",
            "malloc",
            "calloc",
            "free",
            "realloc",
            "_malloc_r",
            "_calloc_r",
            "_free_r",
            "_realloc_r",
            "_ZdlPv",
            "_ZdlPvj",
            "_ZdaPv",
            "_ZdaPvj",
        };
        int n_retw_names = sizeof(retw_names) / sizeof(retw_names[0]);
        fprintf(stderr, "[QEMU-DBG] RETW: %d names to resolve\n", n_retw_names);

        /* Short firmware wrappers/accessors that still execute real C++
         * code need the pre-RETW underflow/illegal checks bypassed.
         * Returning through the safe stub helper can read stale env->regs[0]
         * instead of the live translated A0, so register the exact RETW PC
         * and keep the normal translated-register RETW path. */
        static const char* retw_normal_precheck_names[] = {
            "_ZN9HalSystem17isRebootFromPanicEv",
            "_ZN15RuntimePlatform7backendEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend17beginPowerManagerEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend19bootTimestampMillisEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend16loadI18nSettingsEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend10loadStoresEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend8beginBleEb",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend22beginBackgroundWorkersEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend24beginFrontlightAndBuzzerEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend14syncFrontlightERK10MPSettings",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend18handleUsbPowerWakeER7HalGPIO",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend19bindBleMainLoopTaskEP19tskTaskControlBlock",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend23shouldStartInputWatcherEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend21hasConnectedAppClientEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend17shouldRunAutoLockEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend18shouldRunAutoSleepEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend29shouldHandleDashboardBootLockEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend30shouldTrackActivityPerformanceEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend29shouldRunSleepButtonDeepSleepEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend26shouldUseBlockingLoopDelayEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend30shouldUseReaderStorageTtfFontsEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend28shouldSkipTxtAdjacentPreloadEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend37shouldRunFileBrowserCoverWorkerInlineEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend47shouldSkipFileBrowserCoverWorkerSramPreflightEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend32shouldShowVirtualPetDebugActionsEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend20hasNetworkConnectionEv",
            "_ZN12_GLOBAL__N_131SimulatorRuntimePlatformBackend15beforeLoopDelayEb",
            "_ZN16BackgroundWorker5beginEv",
            "_ZN16ReaderOpenWorker5beginEv",
        };
        int n_retw_normal_precheck_names = sizeof(retw_normal_precheck_names) / sizeof(retw_normal_precheck_names[0]);

        /* Parse ELF section headers to find .symtab + .strtab */
        if (elf_len >= 52 && n_retw_names > 0) {
          uint16_t e_shnum = *(uint16_t*)(elf_data + 48);
          uint32_t e_shoff = *(uint32_t*)(elf_data + 32);
          uint16_t e_shentsize = *(uint16_t*)(elf_data + 46);
          /* uint16_t e_shstrndx = *(uint16_t *)(elf_data + 50); */

