Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
          uint32_t symtab_off = 0, symtab_size = 0, strtab_off = 0;
          for (int si = 0; si < e_shnum; si++) {
            uint32_t sh_off = e_shoff + si * e_shentsize;
            if (sh_off + 40 > elf_len) break;
            uint32_t* sh = (uint32_t*)(elf_data + sh_off);
            uint32_t sh_type = sh[1];
            if (sh_type == 2) { /* SHT_SYMTAB */
              symtab_off = sh[4];
              symtab_size = sh[5];
              /* sh_link = index of associated strtab */
              uint32_t str_idx = sh[6];
              uint32_t str_sh_off = e_shoff + str_idx * e_shentsize;
              if (str_sh_off + 40 <= elf_len) {
                uint32_t* str_sh = (uint32_t*)(elf_data + str_sh_off);
                strtab_off = str_sh[4];
              }
            }
          }

          if (symtab_off && strtab_off) {
            /* Iterate symtab entries (Elf32_Sym = 16 bytes) */
            int n_syms = symtab_size / 16;
            for (int ni = 0; ni < n_retw_names && n_retw < MAX_RETW_PATCHES; ni++) {
              const char* want = retw_names[ni];
              int want_len = strlen(want);
              if (strcmp(want, "xQueueGenericCreate") == 0 || strcmp(want, "pvPortMalloc") == 0 ||
                  strcmp(want, "heap_caps_malloc") == 0) {
                fprintf(stderr, "[QEMU-DBG] RETW-DBG: searching for '%s' want_len=%d symtab_size=%d strtab=%d\n", want,
                        want_len, symtab_size, strtab_off != 0);
              }
              /* Check if this function needs to return success (pdPASS=1) */
              int is_success = 0;
              for (int si2 = 0; si2 < n_retw_success; si2++) {
                if (strcmp(want, retw_success_names[si2]) == 0) {
                  is_success = 1;
                  break;
                }
              }
              for (int si = 0; si < n_syms; si++) {
                uint32_t sym_off = symtab_off + si * 16;
                if (sym_off + 16 > elf_len) break;
                uint32_t* s = (uint32_t*)(elf_data + sym_off);
                uint32_t st_name = s[0];
                uint32_t st_value = s[1];
                /* uint32_t st_size = s[2]; */
                if (st_name == 0 || st_value == 0) continue;
                if (st_name + want_len >= elf_len) continue;
                if (memcmp(elf_data + strtab_off + st_name, want, want_len + 1) == 0) {
                  retw_dyn[n_retw].name = want;
                  retw_dyn[n_retw].addr = st_value;
                  retw_dyn[n_retw].found = 1;
                  retw_dyn[n_retw].return_success = is_success;
                  n_retw++;
                  break;
                }
              }
            }
            fprintf(stderr, "[QEMU-DBG] Resolved %d/%d RETW patches from ELF symtab\n", n_retw, n_retw_names);

            for (int ni = 0; ni < n_retw_normal_precheck_names; ni++) {
              const char* want = retw_normal_precheck_names[ni];
              int want_len = strlen(want);
              for (int si = 0; si < n_syms; si++) {
                uint32_t sym_off = symtab_off + si * 16;
                if (sym_off + 16 > elf_len) break;
                uint32_t* s = (uint32_t*)(elf_data + sym_off);
                uint32_t st_name = s[0];
                uint32_t st_value = s[1];
                uint32_t st_size = s[2];
                if (st_name == 0 || st_value == 0) continue;
                if (st_name + want_len >= elf_len) continue;
                if (memcmp(elf_data + strtab_off + st_name, want, want_len + 1) == 0) {
                  uint32_t fn_end =
                      st_size > 0 ? st_value + st_size : mofei_resolve_elf_function_end(elf_data, elf_len, want);
                  if (fn_end <= st_value) fn_end = st_value + 64;
                  uint32_t retw_pc = mofei_find_last_retw_in_elf_span(elf_data, elf_len, st_value, fn_end, 256);
                  if (!retw_pc) {
                    fprintf(stderr, "[QEMU-DBG] WARNING: could not find normal-precheck RETW for %s @ 0x%08x\n", want,
                            st_value);
                    break;
                  }
                  mofei_add_retw_normal_precheck(&mofei_sim_addrs, retw_pc, want);
                  break;
                }
              }
            }

            /* Auto-detect allocator-family functions in retw_dyn and add
             * them to alloc_patch_addrs so the typed bump allocator fires
             * for them.  These functions have different signatures, so the
             * patch table stores argument roles instead of treating every A2
             * value as a size. */
            {
              MofeiSimAddrs* ma = &mofei_sim_addrs;
              for (int ri = 0; ri < n_retw; ri++) {
                if (!retw_dyn[ri].found) continue;
                const char* nm = retw_dyn[ri].name;
                MofeiAllocPatchSpec spec = mofei_alloc_patch_spec_for_name(nm);
                if (spec.size_kind != 0) {
                  mofei_add_alloc_patch(ma, retw_dyn[ri].addr, spec, nm);
                }
                if (strcmp(nm, "uxQueueMessagesWaiting") == 0 && ma->call_null_count < MOFEI_CALL_NULL_MAX) {
                  ma->call_null_addrs[ma->call_null_count++] = retw_dyn[ri].addr;
                }
              }
            }

            /* Resolve memory-set patch addresses from symtab */
            for (int mi = 0; mi < n_memset; mi++) {
              const char* want = memset_patches[mi].name;
              int want_len2 = strlen(want);
              for (int si = 0; si < n_syms; si++) {
                uint32_t sym_off2 = symtab_off + si * 16;
                if (sym_off2 + 16 > elf_len) break;
                uint32_t* s = (uint32_t*)(elf_data + sym_off2);
                uint32_t st_name = s[0];
                uint32_t st_value = s[1];
                if (st_name == 0 || st_value == 0) continue;
                if (st_name + want_len2 >= elf_len) continue;
                if (memcmp(elf_data + strtab_off + st_name, want, want_len2 + 1) == 0) {
                  memset_patches[mi].found = 1;
                  memset_patches[mi].addr = st_value;
                  fprintf(stderr, "[QEMU-DBG] MEMSET resolved: %s @ 0x%08x\n", want, st_value);
                  break;
                }
              }
            }
          } else {
            if (mofei_firmware_symbols) {
              for (int ni = 0; ni < n_retw_names && n_retw < MAX_RETW_PATCHES; ni++) {
                const char* want = retw_names[ni];
                int is_success = 0;
                for (int si2 = 0; si2 < n_retw_success; si2++) {
                  if (strcmp(want, retw_success_names[si2]) == 0) {
                    is_success = 1;
                    break;
                  }
                }

                uint32_t st_value = mofei_resolve_elf_symbol(elf_data, elf_len, want);
                if (st_value) {
                  retw_dyn[n_retw].name = want;
                  retw_dyn[n_retw].addr = st_value;
                  retw_dyn[n_retw].found = 1;
                  retw_dyn[n_retw].return_success = is_success;
                  n_retw++;
                }
              }
              fprintf(stderr, "[QEMU-DBG] Resolved %d/%d RETW patches from firmware symbol sidecar\n", n_retw,
                      n_retw_names);

              for (int ni = 0; ni < n_retw_normal_precheck_names; ni++) {
                const char* want = retw_normal_precheck_names[ni];
                uint32_t st_value = mofei_resolve_elf_symbol(elf_data, elf_len, want);
                if (!st_value) {
                  continue;
                }

                uint32_t fn_end = mofei_resolve_elf_function_end(elf_data, elf_len, want);
                if (fn_end <= st_value) fn_end = st_value + 64;
                uint32_t retw_pc = mofei_find_last_retw_in_elf_span(elf_data, elf_len, st_value, fn_end, 256);
                if (!retw_pc) {
                  fprintf(stderr, "[QEMU-DBG] WARNING: could not find normal-precheck RETW for %s @ 0x%08x\n", want,
                          st_value);
                  continue;
                }
                mofei_add_retw_normal_precheck(&mofei_sim_addrs, retw_pc, want);
              }

              {
                MofeiSimAddrs* ma = &mofei_sim_addrs;
                for (int ri = 0; ri < n_retw; ri++) {
                  if (!retw_dyn[ri].found) continue;
                  const char* nm = retw_dyn[ri].name;
                  MofeiAllocPatchSpec spec = mofei_alloc_patch_spec_for_name(nm);
                  if (spec.size_kind != 0) {
                    mofei_add_alloc_patch(ma, retw_dyn[ri].addr, spec, nm);
                  }
                  if (strcmp(nm, "uxQueueMessagesWaiting") == 0 && ma->call_null_count < MOFEI_CALL_NULL_MAX) {
                    ma->call_null_addrs[ma->call_null_count++] = retw_dyn[ri].addr;
                  }
                }
              }

              for (int mi = 0; mi < n_memset; mi++) {
                const char* want = memset_patches[mi].name;
                uint32_t st_value = mofei_resolve_elf_symbol(elf_data, elf_len, want);
                if (st_value) {
                  memset_patches[mi].found = 1;
                  memset_patches[mi].addr = st_value;
                  fprintf(stderr, "[QEMU-DBG] MEMSET resolved: %s @ 0x%08x\n", want, st_value);
                }
              }
            } else {
              fprintf(stderr, "[QEMU-DBG] WARNING: no .symtab found in ELF, skipping dynamic patches\n");
            }
          }
        }

        /* Apply RETW patches: overwrite entry+3 with the appropriate
         * return sequence.
         * - Plain RETW (3 bytes: 90 00 00) for functions returning void/0.
         * - NOP.N + RETW.N (4 bytes: 3D F0 1D F0) for functions that
         *   preserve a caller-provided return candidate or receive a
         *   TCG-level success override.
         * The Xtensa 'entry' instruction is 3 bytes; the second
         * instruction starts at offset +3. */
        {
          uint16_t phnum = *(uint16_t*)(elf_data + 44);
          uint32_t phoff = *(uint32_t*)(elf_data + 28);
          static const uint8_t retw3[] = {0x90, 0x00, 0x00};          /* retw (wide, 3 bytes) */
          static const uint8_t nop_retw[] = {0x3D, 0xF0, 0x1D, 0xF0}; /* nop.n; retw.n (4 bytes) */
          for (int pi = 0; pi < n_retw; pi++) {
            uint32_t patch_addr = retw_dyn[pi].addr + 3;
            uint32_t retw_pc = retw_dyn[pi].return_success ? (retw_dyn[pi].addr + 5) : patch_addr;
            const uint8_t* patch_bytes = retw_dyn[pi].return_success ? nop_retw : retw3;
            int patch_len = retw_dyn[pi].return_success ? 4 : 3;
            for (int i = 0; i < phnum && phoff + (i + 1) * 32 <= elf_len; i++) {
              uint32_t* ph = (uint32_t*)(elf_data + phoff + i * 32);
              if (ph[0] != 1) continue;
              uint32_t p_offset = ph[1];
              uint32_t p_vaddr = ph[3];
              uint32_t p_filesz = ph[4];
              if (p_vaddr <= patch_addr && patch_addr + patch_len <= p_vaddr + p_filesz) {
                uint32_t file_off = p_offset - p_vaddr + patch_addr;
                if (file_off + patch_len <= elf_len) {
                  memcpy(elf_data + file_off, patch_bytes, patch_len);
                  mofei_add_retw_patch(&mofei_sim_addrs, retw_pc, retw_dyn[pi].name);
                  fprintf(stderr, "[QEMU-DBG] RETW%s %s @ 0x%08x\n", retw_dyn[pi].return_success ? "+SUCCESS" : "",
                          retw_dyn[pi].name, retw_pc);
                }
                break;
              }
            }
          }
        }
      }

