Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
      /* Patch ROM functions that crash during call_start_cpu0.
       *
       * The ROM bootloader functions (memset, rom_config_instruction_cache_mode,
       * Cache_Resume_DCache, etc.) access SPI flash tables or hardware registers
       * that aren't initialized in QEMU's -kernel mode (no second-stage bootloader).
       *
       * We patch the ROM binary so these functions return immediately.
       * Two patch types:
       *   A) "Entry + RETW": for functions with an 'entry' instruction,
       *      overwrite entry+3 with RETW (the entry already set up the window).
       *   B) "Entry + RETW.N": for jump-table thunks that have no 'entry',
       *      write 'entry a1,16; retw.n' at the start.
       *
       * ROM function addresses are fixed (from ESP32-S3 ROM binary), so
       * this works across all firmware builds. */
      {
        static const uint8_t retw3[] = {0x90, 0x00, 0x00}; /* retw */
        static const uint8_t entry_retw[] = {
            0x36, 0x21, 0x00, /* entry a1, 16 */
            0x1D, 0xF0,       /* retw.n */
        };

        /* Type A: functions with their own 'entry' instruction.
         * Patch entry+3 with RETW. */
        struct {
          uint32_t addr;
          const char* name;
        } rom_entry_retw[] = {
            /* spi_flash_set_rom_required_regs — called from rom_config_instruction_cache_mode thunk */
            {0x4004bae4, "spi_flash_set_rom_required_regs"},
            /* spi_flash_rom_init */
            {0x4004e290, "spi_flash_rom_init"},
            /* spi_flash_read_ops — the one that dereferences NULL at 0x3fceffc4 */
            {0x4004eab0, "spi_flash_read_ops"},
            /* cache_resume_dcache_impl */
            {0x4004bb38, "cache_resume_dcache_impl"},
            /* cache_resume_impl */
            {0x4004f480, "cache_resume_impl"},
            /* cache_resume_after_config */
            {0x4004bb68, "cache_resume_after_config"},
            /* cache_set_idrom_mmu */
            {0x4004f308, "cache_set_idrom_mmu"},
        };
        for (int ri = 0; ri < (int)(sizeof(rom_entry_retw) / sizeof(rom_entry_retw[0])); ri++) {
          uint32_t addr = rom_entry_retw[ri].addr;
          uint32_t patch_off = (addr - 0x40000000) + 3; /* skip entry */
          if (patch_off + 3 <= rom_len) {
            memcpy(rom_data + patch_off, retw3, 3);
            mofei_add_retw_patch(&mofei_sim_addrs, addr + 3, rom_entry_retw[ri].name);
            fprintf(stderr, "[QEMU-DBG] ROM-RETW %s @ 0x%08x\n", rom_entry_retw[ri].name, addr);
          }
        }

        /* Type B: jump-table thunks (l32r + jx, no 'entry').
         * Overwrite with 'entry a1,16; retw.n'. */
        struct {
          uint32_t addr;
          const char* name;
        } rom_thunk_retw[] = {
            /* memset thunk — LEFT UNPATCHED so the firmware can
             * use memset normally. The ROM memset at 0x400011e8
             * is a jump-table thunk (l32r a9, real_memset; jx a9)
             * that jumps to the real implementation. The real
             * memset writes to DRAM using standard store
             * instructions, which works in QEMU. */
            /* { 0x400011e8, "memset(thunk)" }, */
            /* Cache_Resume_DCache thunk */
            {0x400018c0, "Cache_Resume_DCache(thunk)"},
            /* rom_config_instruction_cache_mode thunk */
            {0x40001a1c, "rom_config_instruction_cache_mode(thunk)"},
            /* rom_config_data_cache_mode thunk */
            {0x40001a28, "rom_config_data_cache_mode(thunk)"},
            /* Cache_Set_IDROM_MMU_Size thunk */
            {0x40001914, "Cache_Set_IDROM_MMU_Size(thunk)"},
            /* esp_rom_get_reset_reason thunk (called early in call_start_cpu0) */
            {0x4000057c, "esp_rom_get_reset_reason(thunk)"},
        };
        for (int ri = 0; ri < (int)(sizeof(rom_thunk_retw) / sizeof(rom_thunk_retw[0])); ri++) {
          uint32_t addr = rom_thunk_retw[ri].addr;
          uint32_t patch_off = addr - 0x40000000;
          if (patch_off + sizeof(entry_retw) <= rom_len) {
            memcpy(rom_data + patch_off, entry_retw, sizeof(entry_retw));
            mofei_add_retw_patch(&mofei_sim_addrs, addr + 3, rom_thunk_retw[ri].name);
            fprintf(stderr, "[QEMU-DBG] ROM-ENTRY-RETW %s @ 0x%08x\n", rom_thunk_retw[ri].name, addr);
          }
        }
      }

      /* Patch ADC calibration functions to return 0.
       * These functions read eFuse calibration data which is not emulated
       * in QEMU, causing infinite loops.  read_cal_channel is the key
       * function that loops on eFuse reads.
       * We patch AFTER load_elf and manual segment loading, writing
       * directly to the system memory address space (overlay RAM).
       * Patch: entry a1, 0; movi.n a2, 0; retw.n
       * (36 21 00 02 0c 1d f0 = 7 bytes) */
      {
        static const uint8_t ret0_patch[] = {0x36, 0x21, 0x00, 0x02, 0x0c, 0x1d, 0xf0};
        for (int ti = 0; ti < mofei_cpu1_sync.adc_patch_count; ti++) {
          uint32_t target = mofei_cpu1_sync.adc_patch_fns[ti];
          if (target == 0) continue;
          address_space_write(&address_space_memory, target, MEMTXATTRS_UNSPECIFIED, ret0_patch, sizeof(ret0_patch));
          /* Also verify by reading back */
          uint8_t check[sizeof(ret0_patch)];
          address_space_read(&address_space_memory, target, MEMTXATTRS_UNSPECIFIED, check, sizeof(check));
          bool ok = (memcmp(check, ret0_patch, sizeof(ret0_patch)) == 0);
          if (ok) {
            mofei_add_retw_patch(&mofei_sim_addrs, target + 5, "adc calibration ret0");
          }
          fprintf(stderr, "[QEMU-DBG] ADC patch @ 0x%08x: %s (readback: %s)\n", target, ok ? "OK" : "MISMATCH",
                  ok ? "matches" : "does NOT match patch!");
        }
      }

      uint64_t manual_image_entry = 0;
      if (elf_len >= 28 && memcmp(elf_data, ELFMAG, 4) == 0) {
        uint32_t entry32 = 0;
        memcpy(&entry32, elf_data + 24, sizeof(entry32));
        manual_image_entry = entry32;
      }

      gchar* tmpfile = g_build_filename(g_get_tmp_dir(), "panda-patched.elf", NULL);
      g_file_set_contents(tmpfile, elf_data, elf_len, NULL);
      g_free(elf_data);

      image_size = load_elf(tmpfile, NULL, translate_phys_addr, &ss->cpu[0], &image_entry, &image_lowaddr, NULL, NULL,
                            0, EM_XTENSA, 0, 0);
      fprintf(stderr, "[QEMU-DBG] ELF load result: size=%d entry=0x%lx lowaddr=0x%lx\n", image_size,
              (unsigned long)image_entry, (unsigned long)image_lowaddr);
      /* load_elf may not write ICACHE/DCACHE segments correctly due to
       * virtual-to-physical translation issues.  Manually write all PT_LOAD
       * segments to the system address space to ensure patched code/data
       * are in RAM (especially the 0x420xxxxx ICACHE overlay). */
      int manual_load_count = 0;
      uint64_t manual_lowaddr = (uint64_t)-1;
      uint64_t manual_highaddr = 0;
      ssize_t manual_image_size = 0;
      {
        uint8_t* elf2 = NULL;
        gsize elf2_len = 0;
        if (g_file_get_contents(tmpfile, (gchar**)&elf2, &elf2_len, NULL) && elf2 != NULL && elf2_len > 0) {
          uint16_t ph2 = *(uint16_t*)(elf2 + 44);
          uint32_t ph2off = *(uint32_t*)(elf2 + 28);
          for (int j = 0; j < ph2 && ph2off + (j + 1) * 32 <= elf2_len; j++) {
            uint32_t* php = (uint32_t*)(elf2 + ph2off + j * 32);
            if (php[0] != 1) continue; /* PT_LOAD */
            uint32_t seg_vaddr = php[3];
            uint32_t seg_filesz = php[4];
            uint32_t seg_offset = php[1];
            if (seg_filesz == 0) continue;
            if (seg_offset + seg_filesz > elf2_len) continue;
            MemTxResult write_result = address_space_write(&address_space_memory, seg_vaddr, MEMTXATTRS_UNSPECIFIED,
                                                           elf2 + seg_offset, seg_filesz);
            if (write_result != MEMTX_OK) {
              fprintf(stderr, "[QEMU-DBG] Manual load seg %d failed: vaddr=0x%08x filesz=0x%x result=%d\n", j,
                      seg_vaddr, seg_filesz, write_result);
              continue;
            }
            manual_load_count++;
            manual_image_size += seg_filesz;
            if (seg_vaddr < manual_lowaddr) {
              manual_lowaddr = seg_vaddr;
            }
            if ((uint64_t)seg_vaddr + seg_filesz > manual_highaddr) {
              manual_highaddr = (uint64_t)seg_vaddr + seg_filesz;
            }
            fprintf(stderr,
                    "[QEMU-DBG] Manual load seg %d: "
                    "vaddr=0x%08x filesz=0x%x\n",
                    j, seg_vaddr, seg_filesz);
          }
          if (mofei_sim_addrs.murphyDeviceShellRunSimulatorLoopWithContext_addr) {
            uint32_t loop_resume = mofei_sim_addrs.murphyDeviceShellRunSimulatorLoopWithContext_addr + 0x5cu;
            uint8_t loop_resume_bytes[6] = {0};
            address_space_read(&address_space_memory, loop_resume, MEMTXATTRS_UNSPECIFIED, loop_resume_bytes,
                               sizeof(loop_resume_bytes));
            fprintf(stderr, "[QEMU-DBG] Murphy loop resume readback @ 0x%08x: %02x %02x %02x %02x %02x %02x\n",
                    loop_resume, loop_resume_bytes[0], loop_resume_bytes[1], loop_resume_bytes[2], loop_resume_bytes[3],
                    loop_resume_bytes[4], loop_resume_bytes[5]);
          }
          g_free(elf2);
        }
      }
      if (image_size < 0 && manual_load_count > 0 && manual_image_entry != 0) {
        fprintf(stderr,
                "[QEMU-DBG] load_elf failed (%s); continuing with %d manually loaded PT_LOAD segments "
                "(entry=0x%lx lowaddr=0x%lx highaddr=0x%lx)\n",
                load_elf_strerror(image_size), manual_load_count, (unsigned long)manual_image_entry,
                (unsigned long)manual_lowaddr, (unsigned long)manual_highaddr);
        image_entry = manual_image_entry;
        image_lowaddr = manual_lowaddr;
        image_size = manual_image_size > 0 ? manual_image_size : 1;
      }
      /* Apply memory-set patches (write runtime values to DRAM/BSS) */
      {
        for (int mi = 0; mi < (int)(sizeof(memset_patches) / sizeof(memset_patches[0])); mi++) {
          if (memset_patches[mi].found) {
            uint8_t val[4];
            memcpy(val, &memset_patches[mi].value, 4);
            address_space_write(&address_space_memory, memset_patches[mi].addr, MEMTXATTRS_UNSPECIFIED, val, 4);
            fprintf(stderr, "[QEMU-DBG] MEMSET %s @ 0x%08x = %u\n", memset_patches[mi].name, memset_patches[mi].addr,
                    memset_patches[mi].value);
          }
        }
      }
      g_free(tmpfile);
      /* Verify init function table loaded correctly */
      {
        uint32_t init_start = 0x3c5a8260;
        uint32_t init_end = 0x3c5a8328;
        fprintf(stderr, "[QEMU-DBG] Init fn table @ 0x%08x-0x%08x:\n", init_start, init_end);
        for (uint32_t a = init_start; a < init_end; a += 8) {
          uint32_t fn_ptr = 0, flags = 0;
          address_space_read(&address_space_memory, a, MEMTXATTRS_UNSPECIFIED, &fn_ptr, 4);
          address_space_read(&address_space_memory, a + 4, MEMTXATTRS_UNSPECIFIED, &flags, 4);
          if (fn_ptr != 0) {
            fprintf(stderr, "  [0x%08x] fn=0x%08x flags=0x%x\n", a, fn_ptr, flags);
          }
        }
      }
      if (image_size < 0) {
        error_report("Error: could not load ELF file '%s'", load_elf_filename);
        exit(1);
      }
      ss->kernel_entry = image_entry;
    }

    fprintf(stderr, "[QEMU-DBG] XCHAL_RESET_VECTOR_PADDR=0x%lx\n", (unsigned long)XCHAL_RESET_VECTOR_PADDR);
    if (image_entry != XCHAL_RESET_VECTOR_PADDR) {
      /* Patch trampoline into ROM data at the reset vector offset.
       * Trampoline sets SP and jumps to ELF entry.
       *
       * Layout (26 bytes):
       *   +0x00: j _code            -- 00 02 06
       *   +0x03: padding            -- 00
       *   +0x04: .word image_entry    -- literal
       *   +0x08: .word MOFEI_SIM_FAKE_APP_STACK_TOP
       *   +0x0c: l32r a1, [sp]      -- ff ff 11
       *   +0x0f: rsync              -- 00 20 10
       *   +0x12: l32r a0, [entry]   -- ff fb 01
       *   +0x15: jx a0              -- 00 00 a0
       */
      size_t tramp_offset = XCHAL_RESET_VECTOR_PADDR - esp32s3_memmap[ESP32S3_MEMREGION_IROM].base;
      uint8_t p[4];
      memcpy(p, &image_entry, 4);
      const uint32_t boot_stack_top = MOFEI_SIM_FAKE_APP_STACK_TOP;
      uint8_t sp[4];
      memcpy(sp, &boot_stack_top, 4);
      uint8_t boot[] = {
          0x00,  0x02,  0x06,         /* +0x00: j _code */
          0x00,                       /* +0x03: padding */
          p[0],  p[1],  p[2],  p[3],  /* +0x04: .word image_entry */
          sp[0], sp[1], sp[2], sp[3], /* +0x08: .word fake app stack top */
          0xFF,  0xFF,  0x11,         /* +0x0c: l32r a1, [SP literal] */
          0x00,  0x20,  0x10,         /* +0x0f: rsync */
          0xFF,  0xFB,  0x01,         /* +0x12: l32r a0, [entry literal] */
          0x00,  0x00,  0xA0,         /* +0x15: jx a0 */
      };
      if (rom_data && tramp_offset + sizeof(boot) <= rom_len) {
        memcpy(rom_data + tramp_offset, boot, sizeof(boot));
        fprintf(stderr, "[QEMU-DBG] Trampoline patched at ROM offset 0x%zx, entry=0x%lx\n", tramp_offset,
                (unsigned long)image_entry);
      }
    }

