Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
    /* ROM memset patch removed — we NOP the call sites instead.
     * The ROM memset at offset 0x11e8 is left as-is because
     * NOP'ing the calls is safer (no window frame issues). */

    /* ROM cache function trampoline patches removed — we NOP the call
     * sites instead because retw.n in trampolines causes window issues
     * (the trampolines don't have 'entry', so window state is ambiguous). */

    /* Patch ROM functions that loop endlessly in QEMU TCG.
     * Keep 'entry' intact so window state is managed correctly.
     * Patch bytes after entry with: movi.n a2, value; retw.n */
    if (rom_data && rom_len > 0x5544c + 2) {
      /* Patch ROM strcmp at 0x55448: keep entry (36 21 00),
       * patch bytes at +3 with movi.n a2, 1; retw.n
       * Original at +3: 82 02 00 (l8ui a8, a2, 0)
       * Replace:  0c 12    = movi.n a2, 1  (not equal)
       *           1d f0    = retw.n */
      if (rom_data[0x55448] == 0x36 && rom_data[0x55449] == 0x21 && rom_data[0x5544a] == 0x00) {
        rom_data[0x5544b] = 0x0c;  // movi.n a2, 1
        rom_data[0x5544c] = 0x12;
        rom_data[0x5544d] = 0x1d;  // retw.n
        rom_data[0x5544e] = 0xf0;
        mofei_add_retw_patch(&mofei_sim_addrs, 0x4005544du, "ROM strcmp");
        fprintf(stderr, "[QEMU-DBG] Patched ROM strcmp → entry; movi a2,1; retw\n");
      }
      /* Patch ROM strlen at 0x55698: keep entry (36 21 00),
       * patch bytes at +3 with movi.n a2, 0; retw.n
       * Original at +3: 32 c2 fc (addi a3, a2, -4)
       * Replace:  0c 02    = movi.n a2, 0  (length 0)
       *           1d f0    = retw.n */
      if (rom_data[0x55698] == 0x36 && rom_data[0x55699] == 0x21 && rom_data[0x5569a] == 0x00) {
        rom_data[0x5569b] = 0x0c;  // movi.n a2, 0
        rom_data[0x5569c] = 0x02;
        rom_data[0x5569d] = 0x1d;  // retw.n
        rom_data[0x5569e] = 0xf0;
        mofei_add_retw_patch(&mofei_sim_addrs, 0x4005569du, "ROM strlen");
        fprintf(stderr, "[QEMU-DBG] Patched ROM strlen → entry; movi a2,0; retw\n");
      }
    }

    /* Register ROM as one blob (includes patched trampoline) */
    if (rom_data) {
      rom_add_blob_fixed_as("esp32s3.rom", rom_data, rom_len, esp32s3_memmap[ESP32S3_MEMREGION_IROM].base,
                            CPU(&ss->cpu[0])->as);
    }
    g_free(rom_data);

    ss->cpu[0].env.kernel_entry = ss->kernel_entry;
    ss->cpu[0].env.pc = ss->kernel_entry;
    ss->cpu[0].env.sregs[WINDOW_START] = 1;
    ss->cpu[0].env.regs[1] = MOFEI_SIM_FAKE_APP_STACK_TOP;
    ss->cpu[0].env.sregs[PS] = PS_WOE;
    ss->suppress_reset_count = 3;

    /* Initialize ROM data pointers that the bootloader normally sets up.
     * In the ELF boot path, the 2nd-stage bootloader never runs, so these
     * pointers in SRAM (0x3fceffc0–0x3fcefffc) are all zero.  ROM functions
     * dereference them during early init; a NULL pointer causes an immediate
     * crash at PC=0.
     *
     * Layout (in SRAM, below the ROM data area):
     *   0x3fce0100: retw.n instruction (0x1df0) — safe stub for vtable calls
     *   0x3fce0200: vtable (512 entries = 2KB, all → retw) — covers offsets up to 0x7FC
     *   0x3fce0A00: struct (4 bytes → vtable) — used by 0x3fceffc4 chain
     *   0x3fce0B00: data area (256 bytes, zeroed) — safe for data reads
     *   0x3fce0C00: safe struct (1KB, each word → vtable) — for nested dereferences
     *   0x3fce1000: safe func-ptr (256 bytes, each word → retw) — for indirect calls
     *
     * ROM data pointer map (from firmware .iram0 symbols):
     *   0x3fceffc0: ets_ecc_table_ptr
     *   0x3fceffc4: (vtable struct chain — already initialized above)
     *   0x3fceffd0: _global_impure_ptr
     *   0x3fceffd4: syscall_table_ptr
     *   0x3fceffe4: rom_spiflash_legacy_data
     *   0x3fceffe8: rom_spiflash_legacy_funcs
     *   0x3fcefff4: rom_opiflash_cmd_def
     *   0x3fcefffc: ets_ops_table_ptr
     *
     * Additional ROM pointers discovered via disassembly:
     *   0x3fceff64: used by ROM function at 0x40006f6b (nested struct deref)
     *   Many other pointers in 0x3fceff00–0x3fceffc0 range
     *
     * For function-table pointers we use the vtable (→ retw stub).
     * For data pointers we use the zeroed area.
     * For safety, we also fill the entire 0x3fceff00–0x3fceffff range. */
    {
      const uint32_t retw_addr = 0x3fce0100;
      const uint32_t vtable_addr = 0x3fce0200;
      const uint32_t struct_addr = 0x3fce0A00;
      const uint32_t data_addr = 0x3fce0B00;
      const uint32_t safe_struct_addr = 0x3fce0C00;
      const uint32_t safe_func_addr = 0x3fce1000;
      const uint16_t retw_insn = 0x1df0;
      uint32_t vtable[512];
      for (int i = 0; i < 512; i++) {
        vtable[i] = retw_addr;
      }
      address_space_write(&address_space_memory, retw_addr, MEMTXATTRS_UNSPECIFIED, &retw_insn, 2);
      address_space_write(&address_space_memory, vtable_addr, MEMTXATTRS_UNSPECIFIED, vtable, sizeof(vtable));
      address_space_write(&address_space_memory, struct_addr, MEMTXATTRS_UNSPECIFIED, &vtable_addr, 4);

      /* Zeroed data area */
      uint8_t zeros[256] = {0};
      address_space_write(&address_space_memory, data_addr, MEMTXATTRS_UNSPECIFIED, zeros, sizeof(zeros));

      /* Safe struct area: each word is a pointer to the vtable.
       * Any struct dereference will find the vtable → retw stub.
       * ROM functions may read at large offsets (e.g., 0x278),
       * so allocate enough space to cover the maximum offset. */
      uint32_t safe_struct[256];
      for (int i = 0; i < 256; i++) {
        safe_struct[i] = vtable_addr;
      }
      address_space_write(&address_space_memory, safe_struct_addr, MEMTXATTRS_UNSPECIFIED, safe_struct,
                          sizeof(safe_struct));

      /* Safe func-ptr area: each word is a pointer to retw stub.
       * Any indirect call through these will just return. */
      uint32_t safe_func[64];
      for (int i = 0; i < 64; i++) {
        safe_func[i] = retw_addr;
      }
      address_space_write(&address_space_memory, safe_func_addr, MEMTXATTRS_UNSPECIFIED, safe_func, sizeof(safe_func));

      /* Fill the entire 0x3fceff00–0x3fceffff range with safe_struct_addr.
       * This covers all ROM data pointers including unknown ones.
       * When the ROM dereferences any of these:
       *   *(0x3fceffXX) = safe_struct_addr → *(safe_struct + offset) = vtable_addr
       *   → vtable[N] = retw_addr → call executes retw (returns immediately)
       */
      uint32_t safe_fill[64];
      for (int i = 0; i < 64; i++) {
        safe_fill[i] = safe_struct_addr;
      }
      address_space_write(&address_space_memory, 0x3fceff00, MEMTXATTRS_UNSPECIFIED, safe_fill, sizeof(safe_fill));

      /* Also fill 0x3fcefe00–0x3fcefeff for good measure */
      address_space_write(&address_space_memory, 0x3fcefe00, MEMTXATTRS_UNSPECIFIED, safe_fill, sizeof(safe_fill));

      address_space_write(&address_space_memory, 0x3fceffc4, MEMTXATTRS_UNSPECIFIED, &struct_addr, 4);

