Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
      const uint32_t rom_ptrs[] = {
          0x3fceffc0, 0x3fceffd0, 0x3fceffd4, 0x3fceffe4, 0x3fceffe8, 0x3fcefff4, 0x3fcefffc,
      };
      for (int i = 0; i < (int)(sizeof(rom_ptrs) / sizeof(rom_ptrs[0])); i++) {
        address_space_write(&address_space_memory, rom_ptrs[i], MEMTXATTRS_UNSPECIFIED, &data_addr, 4);
      }
      fprintf(stderr, "[QEMU-DBG] ROM data ptrs initialized: vtable@0x%x data@0x%x safe_struct@0x%x\n", vtable_addr,
              data_addr, safe_struct_addr);
    }
    /* Set CCOMPARE0 to maximum to prevent an immediate timer interrupt.
     * CCOUNT starts at 0 on reset; if CCOMPARE0 is also 0, the timer
     * match fires on the first tick, causing an interrupt storm that
     * traps the CPU in an endless interrupt loop.  Setting it to
     * 0xFFFFFFFF gives us ~4 billion ticks before the first match.
     * CCOMPARE is special register 240; CCOMPARE0/1/2 are at 240/241/242. */
    ss->cpu[0].env.sregs[240] = 0xFFFFFFFF; /* CCOMPARE0 */
    ss->cpu[0].env.sregs[241] = 0xFFFFFFFF; /* CCOMPARE1 */
    ss->cpu[0].env.sregs[242] = 0xFFFFFFFF; /* CCOMPARE2 */
    CPU(&ss->cpu[0])->exception_index = -1;
    CPU(&ss->cpu[0])->halted = 0;
    CPU(&ss->cpu[0])->stop = false;
    CPU(&ss->cpu[0])->stopped = false;
    ss->cpu[1].env.kernel_entry = 0;
    ss->cpu[1].env.runstall = true;
    CPU(&ss->cpu[1])->start_powered_off = true;
    CPU(&ss->cpu[1])->halted = true;

    fprintf(stderr, "[QEMU] kernel_entry=0x%lx pc=0x%x\n", (unsigned long)ss->kernel_entry, ss->cpu[0].env.pc);
  } else {
    /* Flash boot: load ROM binary.  If MOFEI_ROM_BINARY is set, use it
     * as the ROM path (allows the headless harness to pass a patched ROM).
     * Otherwise fall back to the standard pc-bios ROM. */
    char* rom_binary = mofei_resolve_rom_binary();
    if (rom_binary == NULL) {
      error_report("Error: ROM binary not found (set MOFEI_ROM_BINARY or ensure pc-bios/esp32s3_rev0_rom.bin exists)");
      exit(1);
    }

    int size = load_image_targphys_as(rom_binary, esp32s3_memmap[ESP32S3_MEMREGION_IROM].base,
                                      esp32s3_memmap[ESP32S3_MEMREGION_IROM].size, CPU(&ss->cpu[0])->as);
    if (size < 0) {
      error_report("Error: could not load ROM binary '%s'", rom_binary);
      exit(1);
    }
    fprintf(stderr, "[QEMU-DBG] Flash boot ROM: %d bytes from %s\n", size, rom_binary);
    g_free(rom_binary);

    if (ESP32S3_CPU_COUNT > 1) {
      rom_binary = mofei_resolve_rom_binary();
      if (rom_binary == NULL) {
        error_report("Error: ROM binary not found for CPU1");
        exit(1);
      }

      size = load_image_targphys_as(rom_binary, esp32s3_memmap[ESP32S3_MEMREGION_IROM].base,
                                    esp32s3_memmap[ESP32S3_MEMREGION_IROM].size, CPU(&ss->cpu[1])->as);
      if (size < 0) {
        error_report("Error: could not load ROM binary '%s' for CPU1", rom_binary);
        exit(1);
      }
      g_free(rom_binary);
    }

    /* Start CPU0 from ROM reset vector.  Leave kernel_entry clear here:
     * cpu.c uses it for the direct -kernel path and forces a synthetic
     * window state that is not valid for ROM flash boot. */
    ss->cpu[0].env.kernel_entry = 0;
    ss->cpu[0].env.pc = 0x40000400;
    ss->cpu[0].env.sregs[240] = 0xFFFFFFFF;
    ss->cpu[0].env.sregs[241] = 0xFFFFFFFF;
    ss->cpu[0].env.sregs[242] = 0xFFFFFFFF;
    CPU(&ss->cpu[0])->exception_index = -1;
    CPU(&ss->cpu[0])->halted = 0;
    CPU(&ss->cpu[0])->stop = false;
    CPU(&ss->cpu[0])->stopped = false;
    ss->cpu[1].env.kernel_entry = 0;
    ss->cpu[1].env.runstall = true;
    CPU(&ss->cpu[1])->start_powered_off = true;
    CPU(&ss->cpu[1])->halted = true;
  }
  /* Pre-write CPU1 sync flags immediately (instead of timer-based).
   * In the ELF boot path, the firmware enters tight spin loops waiting
   * for s_cpu_up[1] and s_cpu_inited[1]. QEMU timers can't fire while
   * the CPU is in a tight TB loop, so we must set the flags before
   * the CPU starts executing. */
  if (mofei_cpu1_sync.s_cpu_up_1 || mofei_cpu1_sync.s_cpu_inited_1 || mofei_cpu1_sync.s_system_inited_1 ||
      mofei_cpu1_sync.s_system_full_inited) {
    uint8_t one = 1;
    if (mofei_cpu1_sync.s_cpu_up_1) {
      uint32_t s_cpu_up_0 = mofei_cpu1_sync.s_cpu_up_1 - 1;
      address_space_write(&address_space_memory, s_cpu_up_0, MEMTXATTRS_UNSPECIFIED, &one, 1);
      address_space_write(&address_space_memory, mofei_cpu1_sync.s_cpu_up_1, MEMTXATTRS_UNSPECIFIED, &one, 1);
    }
    if (mofei_cpu1_sync.s_cpu_inited_1) {
      uint32_t s_cpu_inited_0 = mofei_cpu1_sync.s_cpu_inited_1 - 1;
      address_space_write(&address_space_memory, s_cpu_inited_0, MEMTXATTRS_UNSPECIFIED, &one, 1);
      address_space_write(&address_space_memory, mofei_cpu1_sync.s_cpu_inited_1, MEMTXATTRS_UNSPECIFIED, &one, 1);
    }
    if (mofei_cpu1_sync.s_system_inited_1) {
      uint32_t s_system_inited_0 = mofei_cpu1_sync.s_system_inited_1 - 1;
      address_space_write(&address_space_memory, s_system_inited_0, MEMTXATTRS_UNSPECIFIED, &one, 1);
      address_space_write(&address_space_memory, mofei_cpu1_sync.s_system_inited_1, MEMTXATTRS_UNSPECIFIED, &one, 1);
    }
    if (mofei_cpu1_sync.s_system_full_inited) {
      address_space_write(&address_space_memory, mofei_cpu1_sync.s_system_full_inited, MEMTXATTRS_UNSPECIFIED, &one, 1);
    }
    fprintf(stderr, "[QEMU] CPU1 sync flags pre-written\n");
  }

  /* Mofei: Start a fast debug timer to trace early boot progress.
   * DISABLED for crash debugging */
#if 0
    {
        static int early_pc_count = 0;
        static QEMUTimer *early_pc_timer;
        if (!early_pc_timer) {
            early_pc_timer = timer_new_ms(QEMU_CLOCK_REALTIME,
                                           mofei_debug_pc_timer_cb, NULL);
        }
        early_pc_count = 0;
        mofei_debug_pc_dumps = 0;
        timer_mod(early_pc_timer,
                  qemu_clock_get_ms(QEMU_CLOCK_REALTIME) + 5000);
    }
#endif

  {
    static QEMUTimer* cpu_resume_timer;
    if (!cpu_resume_timer) {
      cpu_resume_timer = timer_new_ms(QEMU_CLOCK_REALTIME, mofei_cpu_resume_timer_cb, ss);
    }
    timer_mod(cpu_resume_timer, qemu_clock_get_ms(QEMU_CLOCK_REALTIME) + 10000);
  }

