Panda-Intelligence/panda-ai-os-simulator/qemu-peripherals/hw_xtensa_esp32s3.c
  /* Start the CPU tick timer to keep the simulated CPU alive.
   * Without periodic interrupts the firmware halts on `waiti` and
   * never resumes.  The timer injects software interrupts every 100 ms
   * of virtual time to simulate a ticking clock. */
  {
    if (!mofei_cpu_tick_timer) {
      mofei_cpu_tick_timer = timer_new_ms(QEMU_CLOCK_REALTIME, mofei_cpu_tick_timer_cb, ss);
    }
    mofei_cpu_tick_count = 0;
    timer_mod(mofei_cpu_tick_timer, qemu_clock_get_ms(QEMU_CLOCK_REALTIME) + 100); /* 100 ms */
  }

  fprintf(stderr, "[QEMU] esp32s3_machine_init done\n");
}

static ram_addr_t esp32s3_fixup_ram_size(ram_addr_t requested_size) {
  ram_addr_t size;
  if (requested_size == 0) {
    size = 0;
  } else if (requested_size <= 2 * MiB) {
    size = 2 * MiB;
  } else if (requested_size <= 4 * MiB) {
    size = 4 * MiB;
  } else if (requested_size <= 8 * MiB) {
    size = 8 * MiB;
  } else if (requested_size <= 16 * MiB) {
    size = 16 * MiB;
  } else if (requested_size <= 32 * MiB) {
    size = 32 * MiB;
  } else {
    qemu_log("RAM size larger than 32 MB not supported\n");
    size = 32 * MiB;
  }
  return size;
}

/* Initialize machine type */
static void esp32s3_machine_class_init(ObjectClass* oc, void* data) {
  MachineClass* mc = MACHINE_CLASS(oc);
  mc->desc = "Espressif ESP32S3 machine";
  mc->init = esp32s3_machine_init;
  mc->max_cpus = 2;
  mc->default_cpus = 2;
  mc->default_ram_size = 0;
  mc->fixup_ram_size = esp32s3_fixup_ram_size;
}

static const TypeInfo esp32s3_info = {
    .name = TYPE_ESP32S3_MACHINE,
    .parent = TYPE_MACHINE,
    .instance_size = sizeof(Esp32s3MachineState),
    .class_init = esp32s3_machine_class_init,
};

static void esp32s3_machine_type_init(void) { type_register_static(&esp32s3_info); }

type_init(esp32s3_machine_type_init);
